{
    "Must be available to work weekends and evenings.\n": "must avail work weekend even",
    "Part time/Full time positions availableJob Types: Full-time, Part-timeSalary: From $20.00 per hourSchedule:8 hour shiftCOVID-19 considerations:We are providing hand sanitizer, gloves, and masks.Work remotely:No\n": "part time/ful time posit availablejob type full-tim part-timesalari from 20.00 per hourschedule:8 hour shiftcovid-19 consider we provid hand sanit glove masks.work remot no",
    "Take and punch orders i\n": "take punch order",
    "Ability to work with minimal functional direction\n": "abil work minim function direct",
    "Must be able to stand for long periods of time\n": "must abl stand long period time",
    "Must be able to lift using work safe guidelines\n": "must abl lift use work safe guidelin",
    "Passion for great food and outstanding serviceStrong work ethic and “let’s get it done” attitudeEnthusiasm and are customer focusedRetail, customer service experience considered an asset\n": "passion great food outstand servicestrong work ethic “ let ’ get done ” attitudeenthusiasm custom focusedretail custom servic experi consid asset",
    "IND3\n": "ind3",
    "Work Setting\n": "work set",
    "Greet customers\n": "greet custom",
    "The cashier is mostly in charge of operating the cash register while offering a customer service of incomparable quality.\n": "the cashier mostli charg oper cash regist offer custom servic incompar qualiti",
    "This employee is attentive to the needs of customers and answers their questions.\n": "thi employe attent need custom answer question",
    "Offer an excellent customer service\n": "offer excel custom servic",
    "Process the transactions with the customer\n": "process transact custom",
    "Keep the checkout counter neat\n": "keep checkout counter neat",
    "Education : None\n": "educ none",
    "Experience : None\n": "experi none",
    "Work within the Jean Coutu network\n": "work within jean coutu network",
    "Position Summary...\n": "posit summari ...",
    "Business Equipment and Computer Applications\n": "busi equip comput applic",
    "Price scanner\n": "price scanner",
    "Security and Safety\n": "secur safeti",
    "Work Conditions and Physical Capabilities\n": "work condit physic capabl",
    "Attention to detail\n": "attent detail",
    "No employment or similar relationship will be created between the applicant and Loblaws Inc. or its affiliates.\n": "no employ similar relationship creat applic loblaw inc. affili",
    "Employment Type:\n": "employ type",
    "Part time\n": "part time",
    "Type of Role:\n": "type role",
    "telephone and cash handling experience;\n": "telephon cash handl experi",
    "the ability to manage multiple phone lines and respond quickly in a busy and dynamic environment while consistently meeting deadlines; and\n": "abil manag multipl phone line respond quickli busi dynam environ consist meet deadlin",
    "Any information received relating to accommodation will be addressed confidentially.\n": "ani inform receiv relat accommod address confidenti",
    "Acknowledgement will only be forwarded to those applicants who are invited for an interview.\n": "acknowledg forward applic invit interview",
    "Any request for an exemption will be reviewed on a case-by-case basis, as per our COVID-19 Vaccine Policy, and would be subject to the Town’s accommodation process.\n": "ani request exempt review case-by-cas basi per covid-19 vaccin polici would subject town ’ accommod process",
    "Work Location: Whitby, ON\n": "work locat whitbi on",
    "This position reports directly to the Liquor Store Supervisors, and some of the main\n": "thi posit report directli liquor store supervisor main",
    "Ability to work independently\n": "abil work independ",
    "Ability to function as part of the team in a fast paced environment\n": "abil function part team fast pace environ",
    "Commitment to providing customer service\n": "commit provid custom servic",
    "Ability to work flexible shifts which may include nights and weekends\n": "abil work flexibl shift may includ night weekend",
    "PHYSICAL REQUIREMENTS\n": "physic requir",
    "Ability to lift up to 50 pounds\n": "abil lift 50 pound",
    "Ability to climb ladder\n": "abil climb ladder",
    "J2WRTL\n": "j2wrtl",
    "Ability to work under pressure in a fast paced environment\n": "abil work pressur fast pace environ",
    "Ability to follow Harvey’s standards, food/ safety regulations, and Health and Safety policies\n": "abil follow harvey ’ standard food/ safeti regul health safeti polici",
    "A chance to be part of a close knit team\n": "a chanc part close knit team",
    "Process transactions very precisely\n": "process transact precis",
    "Keep all checkout work stations clean, tidy, and uncluttered\n": "keep checkout work station clean tidi unclutt",
    "Comply with the Company’s policies and procedures regarding loss prevention and health and safety\n": "compli compani ’ polici procedur regard loss prevent health safeti",
    "Proficiency with cash register systems will be considered an asset.\n": "profici cash regist system consid asset",
    "IND2\n": "ind2",
    "Ability to lift 50lbs repetitively\n": "abil lift 50lb repetit",
    "Ability to have reliable means of transportation to and from the store\n": "abil reliabl mean transport store",
    "Restaurant\n": "restaur",
    "Work under pressure\n": "work pressur",
    "Combination of sitting, standing, walking\n": "combin sit stand walk",
    "Flexibility\n": "flexibl",
    "Team player\n": "team player",
    "Relocation costs not covered by employer\n": "reloc cost cover employ",
    "customer service, cashiering and clerical experience; or an equivalent combination of training and experience\n": "custom servic cashier cleric experi equival combin train experi",
    "Ability to maintain sustained attention to detail and to make ari\n": "abil maintain sustain attent detail make ari",
    "Provide a fast and friendly check out experience\n": "provid fast friendli check experi",
    "Engage customers on benefits of Rewards and complete enrollments\n": "engag custom benefit reward complet enrol",
    "Participate in the truck un-load and stocking processes to ensure truck standards are followed and completed within budget\n": "particip truck un-load stock process ensur truck standard follow complet within budget",
    "Assist with Omni channel processes\n": "assist omni channel process",
    "Ability to manage conflict and effectively work with challenging customers.\n": "abil manag conflict effect work challeng custom",
    "Ability to work effectively as part of a diverse team, with limited supervision in a fast paced environment.\n": "abil work effect part divers team limit supervis fast pace environ",
    "Schedule:\n": "schedul",
    "Note: Training would start early December to be completed by December 17, 2021\n": "note train would start earli decemb complet decemb 17 2021",
    "Wage:\n": "wage",
    "Ability to work independently in a fast paced environment\n": "abil work independ fast pace environ",
    "A passion for local, organic and sustainable food and natural supplements\n": "a passion local organ sustain food natur supplement",
    "Ability to lift 22 kg.\n": "abil lift 22 kg",
    "Nature's Fare Markets is an equal opportunity employer and as such we strive to foster a workplace where individual differences are recognized, appreciated, and respected.\n": "natur 's fare market equal opportun employ strive foster workplac individu differ recogn appreci respect",
    "IGoIObV4Nu\n": "igoiobv4nu",
    "Travel Requirements: 0 - 10%\n": "travel requir 0 10",
    "Location: 8855 Meadowlark Safeway\n": "locat 8855 meadowlark safeway",
    "Overview\n": "overview",
    "A day in the life of a Cashier: As a customer yourself, you know how important helpful service is.\n": "a day life cashier as custom know import help servic",
    "The impression shoppers get at the front end of the store is key to building customer loyalty.\n": "the impress shopper get front end store key build custom loyalti",
    "Experience\n": "experi",
    "Process cash register payments by cash, cheque, credit card, gift card and debit\n": "process cash regist payment cash chequ credit card gift card debit",
    "Balance and reconcile cash at end of work shift\n": "balanc reconcil cash end work shift",
    "Job Requirements\n": "job requir",
    "Ability to learn quickly\n": "abil learn quickli",
    "Ability to work in a fast paced environment\n": "abil work fast pace environ",
    "Ability to communicate clearly and concisely in both oral and written form\n": "abil commun clearli concis oral written form",
    "Possess strong customer service qualities\n": "possess strong custom servic qualiti",
    "Evening and weekend availability is strongly encouraged\n": "even weekend avail strongli encourag",
    "Must be available to be scheduled anytime on Sunday (Alberta Only)\n": "must avail schedul anytim sunday alberta onli",
    "Must be able to lift or carry objects weighing 0-50 pounds during scheduled shift.\n": "must abl lift carri object weigh 0-50 pound schedul shift",
    "Must be able to stand, bend, kneel, reach, push/pull, walk and squat during scheduled shift.\n": "must abl stand bend kneel reach push/pul walk squat schedul shift",
    "The Company\n": "the compani",
    "Compensation Range\n": "compens rang",
    "Posting End Date\n": "post end date",
    "Note: Applications will be accepted until 11:59 PM on the day prior to the Posting End Date above.\n": "note applic accept 11:59 pm day prior post end date",
    "skillsWil\n": "skillswil",
    "This job description intends to describe the general nature and level of work people assigned to this job perform.\n": "thi job descript intend describ gener natur level work peopl assign job perform",
    "Accommodation is available upon request for applicants with disabilities in the recruitment and assessment process and when hired.Job Types: Part-time, PermanentJob Types: Part-time, PermanentBenefits:Company pensionDental careEmployee assistance programFlexible scheduleLife insuranceStore discountVision careSchedule:Day shiftWeekend availabilityWork remotely:No\n": "accommod avail upon request applic disabl recruit assess process hired.job type part-tim permanentjob type part-tim permanentbenefit compani pensiondent careemploye assist programflex schedulelif insurancestor discountvis careschedul day shiftweekend availabilitywork remot no",
    "Assist customers with self-checkout\n": "assist custom self-checkout",
    "Ability to deliver information in a clear and respectable manner to fellow Team Members, customers, and vendors.\n": "abil deliv inform clear respect manner fellow team member custom vendor",
    "Ability to meet customer service expectations and standards in all interactions with customers, vendors, and Team Members.\n": "abil meet custom servic expect standard interact custom vendor team member",
    "Ability to follow directions and procedures; effective time management and organization skills.\n": "abil follow direct procedur effect time manag organ skill",
    "Passion for natural foods and the mission of Whole Foods Market.\n": "passion natur food mission whole food market",
    "Understanding of and compliance with WFM quality goals.\n": "understand complianc wfm qualiti goal",
    "Must be able to lift 50 pounds.\n": "must abl lift 50 pound",
    "Work requires the following motions: bending, twisting, squatting and reaching.\n": "work requir follow motion bend twist squat reach",
    "Exposure to FDA approved cleaning chemicals.\n": "exposur fda approv clean chemic",
    "Exposure to temperatures: <32 degrees Fahrenheit (freezing), 32-40 degrees Fahrenheit (refrigerators), >90 degrees Fahrenheit.\n": "exposur temperatur 32 degre fahrenheit freez 32-40 degre fahrenheit refriger 90 degre fahrenheit",
    "Ability to work in a wet and cold environment.\n": "abil work wet cold environ",
    "Ability to work a flexible schedule including nights, weekends, and holidays as needed.\n": "abil work flexibl schedul includ night weekend holiday need",
    "Ability to use tools and equipment, including box cutters, electric pallet jacks, and other heavy machinery.\n": "abil use tool equip includ box cutter electr pallet jack heavi machineri",
    "Note: The purpose of this document is to provide a general summary of essential\n": "note the purpos document provid gener summari essenti",
    "Aperçu\n": "aperçu",
    "Rester debout, marcher;\n": "rester debout marcher",
    "CASHIER\n": "cashier",
    "Keep the checkout area clean and orderly\n": "keep checkout area clean orderli",
    "Incentive programs\n": "incent program",
    "Training\n": "train",
    "Ability to establish and maintain effective working relationships with Management, coworkers and customers.\n": "abil establish maintain effect work relationship manag cowork custom",
    "CASHIERKent is the largest retail building supply chain in Atlantic Canada.\n": "cashierk largest retail build suppli chain atlant canada",
    "Fitness Allowance\n": "fit allow",
    "Ability to manage a counter and its contents.\n": "abil manag counter content",
    "Work Conditions:\n": "work condit",
    "Ability to remain stationary for periods of up to 8 hours\n": "abil remain stationari period 8 hour",
    "Ability to bend and stoop on occasion\n": "abil bend stoop occas",
    "Ability to escort guests to other parts of the facility as circumstances dictate\n": "abil escort guest part facil circumst dictat",
    "RRSP\n": "rrsp",
    "race, colour, creed (religion), place of origin, sex (including pregnancy, gender identity), sexual orientation, age, family status, or disability).\n": "race colour creed religion place origin sex includ pregnanc gender ident sexual orient age famili statu disabl",
    "Ability to work a variety of shifts, including evenings and weekends\n": "abil work varieti shift includ even weekend",
    "No telephone calls please.No agency calls please.\n": "no telephon call please.no agenc call pleas",
    "Accommodation is available, if requested.\n": "accommod avail request",
    "Ability to work in an energetic, fast-paced environment\n": "abil work energet fast-pac environ",
    "Authorize payments by cheque\n": "author payment chequ",
    "Resolve problems that arise, such as customer complaints and supply shortages\n": "resolv problem aris custom complaint suppli shortag",
    "Reliability\n": "reliabl",
    "Cashier\n": "cashier",
    "Compensation: $16.50 to $18 Hourly\n": "compens 16.50 18 hourli",
    "Duration\n": "durat",
    "Permanent\n": "perman",
    "Intended job posting audience\n": "intend job post audienc",
    "Anyone who can legally work in Canada can apply for this job.\n": "anyon legal work canada appli job",
    "Position Description\n": "posit descript",
    "Position Title\n": "posit titl",
    "Incumbent -\n": "incumb",
    "II.\n": "ii",
    "Position Summary\n": "posit summari",
    "III.\n": "iii",
    "lottery retailing\n": "lotteri retail",
    "putting vehicle license numbers on all charges\n": "put vehicl licens number charg",
    "putting po#’s on all appropriate charges\n": "put po ’ appropri charg",
    "inspecting and reporting on the labels or lack of, for all inventory items\n": "inspect report label lack inventori item",
    "perform his/her duties in a safety conscious manner that protects all employees and customers from injury and/or damage to property, both the companies and 3rd parties\n": "perform his/her duti safeti consciou manner protect employe custom injuri and/or damag properti compani 3rd parti",
    "provide assistance to co-workers on an ongoing basis as and when required\n": "provid assist co-work ongo basi requir",
    "IV.\n": "iv",
    "Reporting Structure\n": "report structur",
    "Ability to work with colleagues in a co-operative manner\n": "abil work colleagu co-op manner",
    "Must be physically capable of performing the duties and\n": "must physic capabl perform duti",
    "This job entails, working on the register, office work, supervising 2-4 people, general cleaning, opening and closing of business, etc.\n": "thi job entail work regist offic work supervis 2-4 peopl gener clean open close busi etc",
    "Having knowledge of Microsoft office would be a plus.Job Types: Full-time, PermanentSalary: $14.00-$15.00 per hourBenefits:Dental careExtended health careSchedule:Monday to FridayWeekendsWork remotely:No\n": "have knowledg microsoft offic would plus.job type full-tim permanentsalari 14.00- 15.00 per hourbenefit dental careextend health careschedul monday fridayweekendswork remot no",
    "- greet customers as the come through the door- maintain a clean working space- answer telephone and take messages- call customers when special orders come in- all training is providedJob Type: Part-timeSalary: $25,600.00-$42,028.00 per yearBenefits:Store discountSchedule:Day shiftNight shiftWeekend availabilityExperience:sales: 1 year (preferred)customer service: 1 year (preferred)Work remotely:No\n": "greet custom come door- maintain clean work space- answer telephon take messages- call custom special order come in- train providedjob type part-timesalari 25,600.00- 42,028.00 per yearbenefit store discountschedul day shiftnight shiftweekend availabilityexperi sale 1 year prefer custom servic 1 year prefer work remot no",
    "Hire and train or arrange for training of staff\n": "hire train arrang train staff",
    "Supervise and co-ordinate activities of workers\n": "supervis co-ordin activ worker",
    "Work Environment:\n": "work environ",
    "Work is performed in a store retail env\n": "work perform store retail env",
    "Promote the VIP program;\n": "promot vip program",
    "Wrapping merchandise for your clients;\n": "wrap merchandis client",
    "Tell us your best story!\n": "tell us best stori",
    "Team player;\n": "team player",
    "Understanding of fashion trends an asset\n": "understand fashion trend asset",
    "Education\n": "educ",
    "Part Time or Full Time, great opportunity for mature students.\n": "part time full time great opportun matur student",
    "Creativity\n": "creativ",
    "Compensation: $16 Hourly\n": "compens 16 hourli",
    "Closing Date\n": "close date",
    "N/A\n": "n/a",
    "Position: 2\n": "posit 2",
    "Must be able to handle cash\n": "must abl handl cash",
    "Lift up to 50 lbs.\n": "lift 50 lb",
    "Compensation: $15.20 Hourly\n": "compens 15.20 hourli",
    "Education Required: Completion of College; Completion of High School.\n": "educ requir complet colleg complet high school",
    "Experience Required: Working Experience as Grocery Clerk or Store Shelf Stocker in Grocery Store.\n": "experi requir work experi groceri clerk store shelf stocker groceri store",
    "The candidate must be able to work independently, has the ability to communicate verbally and understand and follow written and verbal instructions.\n": "the candid must abl work independ abil commun verbal understand follow written verbal instruct",
    "Must be able to work weekends and some evening shifts.Part-time hours: 10 - 40 per weekJob Types: Full-time, Part-time, PermanentSalary: $12.50-$12.75 per hourCOVID-19 considerations:Employee's must wear masks at this time.Experience:sales: 1 year (preferred)customer service: 1 year (preferred)Work remotely:No\n": "must abl work weekend even shifts.part-tim hour 10 40 per weekjob type full-tim part-tim permanentsalari 12.50- 12.75 per hourcovid-19 consider employe 's must wear mask time.experi sale 1 year prefer custom servic 1 year prefer work remot no",
    "Part time Cashier/Supervisor positions available at Sobeys March Rd in Kanata OntarioJob Type: Part-timeBenefits:Store discountSchedule:8 hour shiftDay shiftHolidaysMonday to FridayNight shiftWeekends\n": "part time cashier/supervisor posit avail sobey march rd kanata ontariojob type part-timebenefit store discountschedule:8 hour shiftday shiftholidaysmonday fridaynight shiftweekend",
    "skills.Ability to multi-task, prioritize and meet deadlines.Ability to work in a standing position for many hoursAbility to lift heavy objects, stretch and bend.We thank all applicants for their interest; however, only selected candidates will be contacted.Job Types: Part-time, TemporarySchedule:Monday to FridayWeekend availabilityExperience:sales: 1 year (preferred)customer service: 1 year (preferred)Work remotely:No\n": "skills.abl multi-task priorit meet deadlines. work stand posit mani hoursabl lift heavi object stretch bend.w thank applic interest howev select candid contacted.job type part-tim temporaryschedul monday fridayweekend availabilityexperi sale 1 year prefer custom servic 1 year prefer work remot no",
    "Work Performed\n": "work perform",
    "Answer the phone in a professional and courteous manner.\n": "answer phone profession courteou manner",
    "Qualifications/Experience\n": "qualifications/experi",
    "Compensation and Other Information\n": "compens other inform",
    "Work location: Canada Games Aquatic Centre, South London Community Pool, East Lions Community Centre\n": "work locat canada game aquat centr south london commun pool east lion commun centr",
    "This position allows you to be booked for any available shifts depending on your availability in Sunshine, Prichard, Rocket, or Orchard.\n": "thi posit allow book avail shift depend avail sunshin prichard rocket orchard",
    "Please ensure your availability/school schedule are attached to your application for the upcoming semester when applying.\n": "pleas ensur availability/school schedul attach applic upcom semest appli",
    "Wage is $17.06/hour, and has the opportunity to be extended into the winter semester with great work.\n": "wage 17.06/hour opportun extend winter semest great work",
    "Contract dates are flexible - starting as soon as possible with an end date of December 17th.\n": "contract date flexibl start soon possibl end date decemb 17th",
    "this date may be extended depending on business operational needs.\n": "date may extend depend busi oper need",
    "Wage\n": "wage",
    "Weekend\n": "weekend",
    "Employer\n": "employ",
    "SKILLS\n": "skill",
    "Work Conditions and Physical\n": "work condit physic",
    "Business Equipment and Computer\n": "busi equip comput",
    "register\n": "regist",
    "credit/debit card payments, Tabulate total payment for goods or services\n": "credit/debit card payment tabul total payment good servic",
    "area, Greet customers, Accept reservations or take-out orders, Wrap or place\n": "area greet custom accept reserv take-out order wrap place",
    "merchandise in bags, Provide customer service, Verify the age of customers when\n": "merchandis bag provid custom servic verifi age custom",
    "business\n": "busi",
    "certificate\n": "certif",
    "room and board provided\n": "room board provid",
    "Provide information to customers\n": "provid inform custom",
    "Dependability\n": "depend",
    "Profit Sharing\n": "profit share",
    "Room for advancement\n": "room advanc",
    "Some lifting.\n": "some lift",
    "Must be in the Yukon to apply\n": "must yukon appli",
    "skillsAbility to work under pressure in a fast paced environmentAbility to follow Harvey’s standards, food/ safety regulations, and Health and Safety policiesWhat’s in it for you: 20% employee discount card valid at participating Recipe brandsFlexible schedulingA chance to be part of a close knit teamGrowth and development opportunities within the restaurantPart-time hours: 15-30 per weekJob Types: Full-time, Part-timePay: $13.50-$14.35 per hourBenefits:Store discountSchedule:Day shiftHolidaysNight shiftWeekend availabilityWork remotely:No\n": "skillsabl work pressur fast pace environment follow harvey ’ standard food/ safeti regul health safeti policieswhat ’ 20 employe discount card valid particip recip brandsflex schedulinga chanc part close knit teamgrowth develop opportun within restaurantpart-tim hour 15-30 per weekjob type full-tim part-timepay 13.50- 14.35 per hourbenefit store discountschedul day shiftholidaysnight shiftweekend availabilitywork remot no",
    "All staff must wear masks for their shift.\n": "all staff must wear mask shift",
    "Language: English\n": "languag english",
    "Ability to use computers, telephones, and other equipment as needed\n": "abil use comput telephon equip need",
    "Ability to work as part of a team\n": "abil work part team",
    "Experience in a similar position\n": "experi similar posit",
    "Ability to work a flexible schedule of nights, days, weekends, and holidays\n": "abil work flexibl schedul night day weekend holiday",
    "Paid time off\n": "paid time",
    "Tuition Assistance\n": "tuition assist",
    "Adoption Assistance\n": "adopt assist",
    "Experience in the use of Microsoft Office programs, web-based services and other applications.6.\n": "experi use microsoft offic program web-bas servic applications.6",
    "Ability to host engaging and enriching programs and activities, both in the Library and out in the community.9.\n": "abil host engag enrich program activ librari community.9",
    "Ability to build and maintain positive relationships with the public, staff and partners while working as a member of a team.10.\n": "abil build maintain posit relationship public staff partner work member team.10",
    "Experience in helping customer answer their questions and finding their next great read could be preferred.Closing Date:  November 12, 2021Competition #76/21 - position #20003Regina Public Library is committed to an inclusive workplace that reflects the community that we serve.\n": "experi help custom answer question find next great read could preferred.clos date novemb 12 2021competit 76/21 posit 20003regina public librari commit inclus workplac reflect commun serv",
    "Employment Type: Full Time\n": "employ type full time",
    "Rate: $20.94 Hour\n": "rate 20.94 hour",
    "Adaptability\n": "adapt",
    "Completion of the Food Advance program or willingness to obtain\n": "complet food advanc program willing obtain",
    "Proficient in Microsoft Office programs (including Word, Outlook and Excel)\n": "profici microsoft offic program includ word outlook excel",
    "Must be available to work weekends and evenings.Previous cash handling experience is preferred but not required.Job Types: Full-time, PermanentSalary: From $17.00 per hourCOVID-19 considerations:We provide gloves, masks, and lots of hand sanitizer to our staff.\n": "must avail work weekend evenings.previ cash handl experi prefer required.job type full-tim permanentsalari from 17.00 per hourcovid-19 consider we provid glove mask lot hand sanit staff",
    "A challenge?\n": "a challeng",
    "Grow with Us!We are currently looking for “Foodies” for our Mount Pearl location…people who love food as much as we do!\n": "grow us we current look “ foodi ” mount pearl location…peopl love food much",
    "Efficiency\n": "effici",
    "Integrity\n": "integr",
    "Type of Product\n": "type product",
    "Building materials (other than lumber)\n": "build materi lumber",
    "Estimate or quote prices, credit or contract terms, warranties and delivery dates\n": "estim quot price credit contract term warranti deliveri date",
    "Greet customers and discuss type, quality and quantity of merchandise or services sought for purchase, rental or lease\n": "greet custom discuss type qualiti quantiti merchandis servic sought purchas rental leas",
    "Communication skills are key - you should be comfortable talking to strangers.- You've got attitude - the right kind of course - and understand t\n": "commun skill key comfort talk strangers.- you 've got attitud right kind cours understand",
    "skillsAttention to detail.Team playerAble to respond, react and adapt quickly to changeMust be able to provide professional referencesResponsibilities: Provide excellent customer service.\n": "skillsattent detail.team player respond react adapt quickli changemust abl provid profession referencesrespons provid excel custom servic",
    "Availability\n": "avail",
    "Must be available for overnights when requested\n": "must avail overnight request",
    "Must be available 1 out of the 3 days on the weekend (Friday, Saturday, Sunday)\n": "must avail 1 3 day weekend friday saturday sunday",
    "Must be available for 2 shifts during the week (Monday-Thursday)\n": "must avail 2 shift week monday-thursday",
    "Must be available for retail blackout periods (Included but not limited to back to school Aug 18 - Sept 5, Black Friday week November 21-28th, Holiday Season December 19- January 3rd)\n": "must avail retail blackout period includ limit back school aug 18 sept 5 black friday week novemb 21-28th holiday season decemb 19- januari 3rd",
    "Amazing discount on Nike gear\n": "amaz discount nike gear",
    "Opportunity to learn and grow your career with an outstanding luxury athleticwear brand\n": "opportun learn grow career outstand luxuri athleticwear brand",
    "Must be a team player with an ability to also work independently with little or no supervision.\n": "must team player abil also work independ littl supervis",
    "Flexibility to work various shifts is required.\n": "flexibl work variou shift requir",
    "Step 1: Let us know you’re interested!\n": "step 1 let us know ’ interest",
    "Work environment\n": "work environ",
    "Intent of the process\n": "intent process",
    "The ability to work a flexible schedule based on business needs\n": "the abil work flexibl schedul base busi need",
    "The job posting highlights the most critical\n": "the job post highlight critic",
    "Ability to work in varying weather conditions (including but not limited to cold and hot weather) Ability to stand or walk for long periods of the day.\n": "abil work vari weather condit includ limit cold hot weather abil stand walk long period day",
    "Location: 117557, 290 Bremner Blvd, Toronto, ON\n": "locat 117557 290 bremner blvd toronto on",
    "Employment Status: Employee (Casual)\n": "employ statu employe casual",
    "COMPANY OVERVIEW:\n": "compani overview",
    "Please visit our Career Portal any time for new job openings and to keep your resume and contact information up to date.\n": "pleas visit career portal time new job open keep resum contact inform date",
    "Experience the thrill of Canada's Wonder of the World as a member of an award winning team... climb your way to a 553.33m career.\n": "experi thrill canada 's wonder world member award win team ... climb way 553.33m career",
    "Must be fluent in English (CLBA - Canadian Language Benchmark Assessment score of 5 or higher)\n": "must fluent english clba canadian languag benchmark assess score 5 higher",
    "A desire for growth\n": "a desir growth",
    "Must be available to work flexible shifts which may include nights and weekends\n": "must avail work flexibl shift may includ night weekend",
    "Attention to detail and organizational skills.\n": "attent detail organiz skill",
    "Ability to resolve retail and/or customer issues.\n": "abil resolv retail and/or custom issu",
    "Ability to multitask, adapt and cope with challenging and changing situations.\n": "abil multitask adapt cope challeng chang situat",
    "Ability to work with computerized systems and with minimum supervision.\n": "abil work computer system minimum supervis",
    "No experience required.\n": "no experi requir",
    "An interest in fishkeeping is an asset.\n": "an interest fishkeep asset",
    "Must be able to work weekends.Duties of our cashiers are as follows;Provide a positive customer experience with fair, friendly, and courteous service.Register sales by scanning items, itemizing and totaling customers’ purchases.Resolve customer issues and answers questions.Bag purchases when needed.Collect payments by accepting cash, credit and debit cards.Provides pricing information by answering questions.Maintain a safe and clean working environment by complying with procedures, rules, and regulations.Contribute to team effort by accomplishing related duties as needed.Job Type: Part-timeSalary: From $14.35 per hourBenefits:Store discountSchedule:Weekend availabilityWork remotely:No\n": "must abl work weekends.duti cashier follow provid posit custom experi fair friendli courteou service.regist sale scan item item total custom ’ purchases.resolv custom issu answer questions.bag purchas needed.collect payment accept cash credit debit cards.provid price inform answer questions.maintain safe clean work environ compli procedur rule regulations.contribut team effort accomplish relat duti needed.job type part-timesalari from 14.35 per hourbenefit store discountschedul weekend availabilitywork remot no",
    "Own your Style and your Future\n": "own style futur",
    "A passion for inspiring repeat business by creating exceptional customer experiences both on-line and in-store.\n": "a passion inspir repeat busi creat except custom experi on-lin in-stor",
    "A goal directed achiever equally happy working individually and as part of a team in support of achieving store goals.\n": "a goal direct achiev equal happi work individu part team support achiev store goal",
    "This position includes a multi-area ski pass to Sunshine Village & other resorts, a staff event calendar for experiencing the Rockies, and free transportation from Banff and Canmore to Sunshine.\n": "thi posit includ multi-area ski pass sunshin villag resort staff event calendar experienc rocki free transport banff canmor sunshin",
    "Ability to work efficiently with computerized systems.\n": "abil work effici computer system",
    "Ability to work with minimum supervision.\n": "abil work minimum supervis",
    "Experience in a customer service role and/or with a Canadian Tire store is considered an asset.\n": "experi custom servic role and/or canadian tire store consid asset",
    "Ability to work in a fast-paced team environment that provides assistance and support to co-workers to achieve common goals.\n": "abil work fast-pac team environ provid assist support co-work achiev common goal",
    "Ability to go up and down a ladder and stairs while carrying merchandise.\n": "abil go ladder stair carri merchandis",
    "Profit sharing awards to all qualifying employees.\n": "profit share award qualifi employe",
    "Store and Automotive Service center discount program.\n": "store automot servic center discount program",
    "A desire to provide outstanding customer service to our loyal customers\n": "a desir provid outstand custom servic loyal custom",
    "An ability to prioritize tasks, follow directions and manage time\n": "an abil priorit task follow direct manag time",
    "A willingness to work both autonomously and with at team\n": "a willing work autonom team",
    "A desire to comply with established department procedures and safe work practices\n": "a desir compli establish depart procedur safe work practic",
    "Ability to safely bend, twist and lift up to 30lbs on a consistent basis\n": "abil safe bend twist lift 30lb consist basi",
    "Ability to walk and stand for the duration of scheduled shift\n": "abil walk stand durat schedul shift",
    "Relocation costs covered by employer\n": "reloc cost cover employ",
    "Education : Other trades certificate or diploma\n": "educ other trade certif diploma",
    "Experience : 1 to less than 7 months\n": "experi 1 less 7 month",
    "Monitoring and reporting of stock levels.\n": "monitor report stock level",
    "Identification and reporting of hazards, Proactive in enforcing health & safety standards.\n": "identif report hazard proactiv enforc health safeti standard",
    "Ability to display excellent team work skills; communicating effectively across multiple areas of the Rentals department.\n": "abil display excel team work skill commun effect across multipl area rental depart",
    "An understanding of ski and snowboard equipment.\n": "an understand ski snowboard equip",
    "Repair and tuning knowledge is an asset.\n": "repair tune knowledg asset",
    "Ability to show initiative during the quieter times.\n": "abil show initi quieter time",
    "Disability Benefits\n": "disabl benefit",
    "Ensure that cashiers area are clean\n": "ensur cashier area clean",
    " Experience with data entry and/or accounting\n": "experi data entri and/or account",
    " Knowledge/experience of the Red Cross Swim Program is preferred\n": "knowledge/experi red cross swim program prefer",
    "Uphold a team work appearance offering assistance where available or when requested\n": "uphold team work appear offer assist avail request",
    "Casino experience an asset\n": "casino experi asset",
    "Must be able to register with AGLC\n": "must abl regist aglc",
    "The schedule for this position may vary and would require the ability to work shift work, late nights, weekends and holidays.\n": "the schedul posit may vari would requir abil work shift work late night weekend holiday",
    "An opportunity to work within a progressive, exciting team environment.\n": "an opportun work within progress excit team environ",
    "An opportunity to work with a skilled Management team.\n": "an opportun work skill manag team",
    "Ability to follow instructions and procedures.\n": "abil follow instruct procedur",
    "This role will require the flexibility to work a variety of shifts including day, evening, weekends, and holidays as scheduled.\n": "thi role requir flexibl work varieti shift includ day even weekend holiday schedul",
    "Must be available to work weekday mornings.\n": "must avail work weekday morn",
    "The job requires extended periods of standing, as well as being able to lift 50lbs and work in various weather conditions and environments.\n": "the job requir extend period stand well abl lift 50lb work variou weather condit environ",
    "The receptionist will play a crucial role in the dealership environment, by welcoming customers into the dealership, handling a busy switchboard, attending to customer needs and performing cashier duties as required.\n": "the receptionist play crucial role dealership environ welcom custom dealership handl busi switchboard attend custom need perform cashier duti requir",
    "Assist in order processing, research, filing and follow-up\n": "assist order process research file follow-up",
    "Process payments\n": "process payment",
    "skillset rocks no matter what zone you're in and you can easily flex between the Salesfloor, Cash & Wrap, Fitting Room and Stockroom as needed.\n": "skillset rock matter zone 're easili flex salesfloor cash wrap fit room stockroom need",
    "#practicemakesperfect\n": "practicemakesperfect",
    "Brand\n": "brand",
    "GUESS\n": "guess",
    "Store\n": "store",
    "Store Address\n": "store address",
    "ARITZIA\n": "aritzia",
    "Head to our About Us for the scoop on\n": "head about us scoop",
    "Compensation: $17 Hourly\n": "compens 17 hourli",
    "The job position includes following duties:\n": "the job posit includ follow duti",
    "Maintaining cleanliness of station\n": "maintain cleanli station",
    "Cash out\n": "cash",
    "Each drink is customizable from the type of tea to a wide selection of toppings.If you have the following qualities, then WE WANT YOU!Willingness to learn - hands on mentorship you’ll learn how to prepare food and beverages to standard recipes or customized for customers, including recipe changes such as sweetness, ice level or different toppings- Availability to work flexible hours that may include early mornings, evenings, weekends, nights and/or holidays-Openness to getting the job done and helping your team in a dynamic retail environment.NOTE: No previous experience required.Only candidates selected for the hiring process will be contacted.Please attach your availability with your application.All customers are required to wear face mask.\n": "each drink customiz type tea wide select toppings.if follow qualiti we want you willing learn hand mentorship ’ learn prepar food beverag standard recip custom custom includ recip chang sweet ice level differ toppings- avail work flexibl hour may includ earli morn even weekend night and/or holidays-open get job done help team dynam retail environment.not no previou experi required.onli candid select hire process contacted.pleas attach avail application.al custom requir wear face mask",
    "This position will primarily be scheduled in our North Vancouver branch; however, it may require coverage at our Burnaby branch time to time.\n": "thi posit primarili schedul north vancouv branch howev may requir coverag burnabi branch time time",
    "Training will take place in both locations, no exceptions.Job duties include: Operating Cashier Station, paperwork sorting, answering incoming calls and transferring customer calls accordingly, misc.\n": "train take place locat exceptions.job duti includ oper cashier station paperwork sort answer incom call transfer custom call accordingli misc",
    "administration data entry tasks.Hours:M-F 6:00 am - 2:30 pm or 8:30 am - 5:00 pmThis position will require some Saturday shifts as well from 8:00 am - 4:00 pmJob Type: Full-timeAdditional pay:Overtime payBenefits:Casual dressCompany eventsDental careExtended health careOn-site parkingRRSP matchStore discountVision careWellness programSchedule:8 hour shiftWork remotely:No\n": "administr data entri tasks.hour m-f 6:00 2:30 pm 8:30 5:00 pmthi posit requir saturday shift well 8:00 4:00 pmjob type full-timeaddit pay overtim paybenefit casual dresscompani eventsdent careextend health careon-sit parkingrrsp matchstor discountvis carewel programschedule:8 hour shiftwork remot no",
    "Must be available to work a variety of shifts including days, evenings and weekends\n": "must avail work varieti shift includ day even weekend",
    "This position will remain open until f\n": "thi posit remain open f",
    "Experience:\n": "experi",
    "Ability to handle large sums of money, keep records of account and perform cash balancing.\n": "abil handl larg sum money keep record account perform cash balanc",
    "Ability to prioritize and organize daily tasks.\n": "abil priorit organ daili task",
    "Ability to establish effective working relationships.\n": "abil establish effect work relationship",
    "Ability to use a variety of computer programs.\n": "abil use varieti comput program",
    "customer service, work cash registerJob Types: Full-time, PermanentSchedule:Day shiftWeekend availabilityWork remotely:No\n": "custom servic work cash registerjob type full-tim permanentschedul day shiftweekend availabilitywork remot no",
    "Description\n": "descript",
    "Responsabilités :\n": "responsabilité",
    "Marchandisage des zones désignées\n": "marchandisag de zone désigné",
    "Dynamique\n": "dynamiqu",
    "Expérience : Aucune\n": "expérienc aucun",
    "This role suits an outgoing individual who enjoys interacting with customers in a fast paced environment.The job involves processing customer sales at our pay point.No experience required, we will train.Job Types: Full-time, Part-time, PermanentSalary: From $14.25 per hourBenefits:Extended health careFlexible scheduleOn-site parkingProfit sharingStore discountSchedule:8 hour shiftMonday to FridayWeekendsWork remotely:No\n": "thi role suit outgo individu enjoy interact custom fast pace environment.th job involv process custom sale pay point.no experi requir train.job type full-tim part-tim permanentsalari from 14.25 per hourbenefit extend health careflex scheduleon-sit parkingprofit sharingstor discountschedule:8 hour shiftmonday fridayweekendswork remot no",
    "Min.\n": "min",
    "An interest in working with food\n": "an interest work food",
    "skillsAbility to make changeBasic math skillsAttention to detailPart-time hours:Job Types: Part-time, PermanentSalary: $14.35 per hourSchedule:8 hour shiftDay shiftNight shiftWeekendsWork remotely:No\n": "skillsabl make changebas math skillsattent detailpart-tim hour job type part-tim permanentsalari 14.35 per hourschedule:8 hour shiftday shiftnight shiftweekendswork remot no",
    "): Not applicableExperience: Experience an asset, Will TrainLanguages: Speak English, Read English, Write EnglishWork Setting: Convenience store/Gas barBusiness Equipment: Price scanner, Cash register, Point-of-Sale System, General office equipmentSpecific Skills: Customer service oriented, Plan, organize, direct, control and evaluate daily operations, Implement operational procedures, Balance cash and complete balance sheets, cash reports, reconciliation and related forms,Transportation/Travel Information: Own transportation, Public transportation is availableWork Conditions and Physical Capabilities: Fast-paced environment, Work under pressure, Attention to detail, Standing for extended periodsEssential Skills: Reading text, Numeracy, Oral communication, Working with others, Computer use, Problem solving.Job Types: Full-time, Part-time, PermanentSchedule:10 hour shift8 hour shiftWork remotely:No\n": "not applicableexperi experi asset will trainlanguag speak english read english write englishwork set conveni store/ga barbusi equip price scanner cash regist point-of-sal system gener offic equipmentspecif skill custom servic orient plan organ direct control evalu daili oper implement oper procedur balanc cash complet balanc sheet cash report reconcili relat form transportation/travel inform own transport public transport availablework condit physic capabl fast-pac environ work pressur attent detail stand extend periodsessenti skill read text numeraci oral commun work other comput use problem solving.job type full-tim part-tim permanentschedule:10 hour shift8 hour shiftwork remot no",
    "A knowledge of small animal and reptile care is a huge asset.\n": "a knowledg small anim reptil care huge asset",
    "The store is open from ten til six most days and we’re open every day except Christmas.\n": "the store open ten til six day ’ open everi day except christma",
    "This position being posted will require weekend coverage.\n": "thi posit post requir weekend coverag",
    "Ongoing support from your assigned coach/manager\n": "ongo support assign coach/manag",
    "A culture that promotes a healthy, fulfilling work/life balance while offer long-term career opportunities\n": "a cultur promot healthi fulfil work/lif balanc offer long-term career opportun",
    "#RP\n": "rp",
    "Contract\n": "contract",
    "Must be available to work nights/days, weekends, 3pm-11pm.\n": "must avail work nights/day weekend 3pm-11pm",
    "Prepping Food,\n": "prep food",
    "Keep kitchen clean,\n": "keep kitchen clean",
    "Help cook Breakfast or lunch as needed,\n": "help cook breakfast lunch need",
    "satisfactory to the employer will be required before starting in\n": "satisfactori employ requir start",
    "Fluent in reading / writing English.Resume must include 3 references.Job Types: Full-time, Part-timeSalary: From $14.35 per hourAdditional pay:TipsSchedule:10 hour shift8 hour shiftWeekendsWork remotely:No\n": "fluent read write english.resum must includ 3 references.job type full-tim part-timesalari from 14.35 per houraddit pay tipsschedule:10 hour shift8 hour shiftweekendswork remot no",
    "Ability to memorize a list of PLU codes\n": "abil memor list plu code",
    "Ability to work a flexible shifts including evenings and weekends\n": "abil work flexibl shift includ even weekend",
    "Paid meal break\n": "paid meal break",
    "Shopping discount\n": "shop discount",
    "Email\n": "email",
    "In-person at the store\n": "in-person store",
    "Compensation will be discussed during interview.\n": "compens discuss interview",
    "vacation time, bonuses, etc...\n": "vacat time bonus etc ...",
    "Fluent in other languages an asset but not required.Part time hours are available immediately.\n": "fluent languag asset required.part time hour avail immedi",
    "Must be able to work day and evening shifts.Part-time hours: 20-35 per weekJob Types: Part-time, PermanentSalary: $14.35 per hourExperience:sales: 1 year (preferred)customer service: 1 year (preferred)Work remotely:No\n": "must abl work day even shifts.part-tim hour 20-35 per weekjob type part-tim permanentsalari 14.35 per hourexperi sale 1 year prefer custom servic 1 year prefer work remot no",
    "Be good with numbers, very well organized, and outgoing.Automotive background is preferred.Fluent in English and French is preferred but not required.Job Types: Full-time, PermanentSalary: From $18.00 per hourSchedule:8 hour shiftWork remotely:No\n": "be good number well organ outgoing.automot background preferred.flu english french prefer required.job type full-tim permanentsalari from 18.00 per hourschedule:8 hour shiftwork remot no",
    "Must be reliable, flexible and detail oriented.Looking forward to your application!Part-time hours: 3-20 per weekJob Types: Part-time, Temporary, PermanentSalary: From $12.75 per hourBenefits:Store discountSchedule:8 hour shiftDay shiftHolidaysMonday to FridayNight shiftWeekend availabilityCOVID-19 considerations:We frequently sanitize high traffic areas and fitting rooms.\n": "must reliabl flexibl detail oriented.look forward applic part-tim hour 3-20 per weekjob type part-tim temporari permanentsalari from 12.75 per hourbenefit store discountschedule:8 hour shiftday shiftholidaysmonday fridaynight shiftweekend availabilitycovid-19 consider we frequent sanit high traffic area fit room",
    "Someone that is fast on their feet and quick thinker as well someone that can multi-task between answering the phone, greeting customers and packing orders.Part-time hours: 20 per weekJob Types: Full-time, Part-timeSalary: $15.00-$17.00 per hourSchedule:Monday to FridayOn callWeekend availabilityExperience:sales: 1 year (preferred)customer service: 1 year (preferred)Work remotely:No\n": "someon fast feet quick thinker well someon multi-task answer phone greet custom pack orders.part-tim hour 20 per weekjob type full-tim part-timesalari 15.00- 17.00 per hourschedul monday fridayon callweekend availabilityexperi sale 1 year prefer custom servic 1 year prefer work remot no",
    "Work hours will fluctuate based on the overall team schedule.\n": "work hour fluctuat base overal team schedul",
    "Must be hard working and quick on your feet, work well with others as well as be able to work independantly.\n": "must hard work quick feet work well other well abl work independantli",
    "Training is provided, mostly evenings and weekends, some days and split shifts.\n": "train provid mostli even weekend day split shift",
    "Must be available to work all of December.Part time hours are 12-18 hours per weekFull time hours are 30-35 hours per weekJob Types: Full-time, Part-time, PermanentSalary: $15.20 per hourAdditional pay:Tips\n": "must avail work december.part time hour 12-18 hour per weekful time hour 30-35 hour per weekjob type full-tim part-tim permanentsalari 15.20 per houraddit pay tip",
    "This candidate will also replenish shelves from back stock, and provide outstanding service to the community.\n": "thi candid also replenish shelv back stock provid outstand servic commun",
    "The position is physically demanding in nature and requires sense of urgency, attention to detail and ability to prioritize.\n": "the posit physic demand natur requir sens urgenc attent detail abil priorit",
    "Position is unionized, subject to union dues and a probationary period of 200 hours.\n": "posit union subject union due probationari period 200 hour",
    "Location: 8877 Port O'Call Mall Safeway\n": "locat 8877 port o'cal mall safeway",
    "PLUMBING ASSOCIATE\n": "plumb associ",
    "CULTIVATING A BETTER WORLDFood served fast doesn’t have to be a typical fast food experience.\n": "cultiv a better worldfood serv fast ’ typic fast food experi",
    "dissatisfied customer, returns, defective merchandise)Ensure all customer repairs are processed and completed in a timely manner\n": "dissatisfi custom return defect merchandis ensur custom repair process complet time manner",
    "Education in related field an asset\n": "educ relat field asset",
    "Assist the store management team by printing sales reports, completing deposits, balance sheets, and completing “day specific” duties.\n": "assist store manag team print sale report complet deposit balanc sheet complet “ day specif ” duti",
    "Assist in managing correspondence from Head Office\n": "assist manag correspond head offic",
    "location: Sage Creek, WinnipegPassionate, Proactive...yes, maybe even a little Obsessive.\n": "locat sage creek winnipegpassion proactiv ... ye mayb even littl obsess",
    "Ability to learn manual and automated systems/tools.\n": "abil learn manual autom systems/tool",
    "Providing service to several people or departments, working under many simultaneous deadlines.\n": "provid servic sever peopl depart work mani simultan deadlin",
    "Accommodation is available upon request for applicants and employees with disabilities.\n": "accommod avail upon request applic employe disabl",
    "Ability to understand the needs of the customer\n": "abil understand need custom",
    "Display a “customer comes first” attitude.\n": "display “ custom come first ” attitud",
    "Resolving customer issues effectively at store level in a timely and positive manner.\n": "resolv custom issu effect store level time posit manner",
    "Be a team player and contribute to the stores’ success.\n": "be team player contribut store ’ success",
    "Ability to work a flexible schedule including evenings and weekends Excellent communication skills and customer service skills\n": "abil work flexibl schedul includ even weekend excel commun skill custom servic skill",
    "Completion of our online Armatus Abuse Training and required Health and Safety training\n": "complet onlin armatu abus train requir health safeti train",
    "Ability to resolve customer concerns in a diplomatic manner.\n": "abil resolv custom concern diplomat manner",
    "Ability to engage customers in a friendly and professional manner.\n": "abil engag custom friendli profession manner",
    "Capacity to communicate with customers effectively using a variety of mediums.\n": "capac commun custom effect use varieti medium",
    "Ability to plan, organize and prioritize efficiently while working in both the Service Desk and Copy Centre areas to effectively serve our customers.\n": "abil plan organ priorit effici work servic desk copi centr area effect serv custom",
    "Ability to work effectively with ongoing distractions is necessary.\n": "abil work effect ongo distract necessari",
    "Capacity to work independently and seek out assistance as required.\n": "capac work independ seek assist requir",
    "Education:\n": "educ",
    "Please inform us of the accommodation(s) that you may require.\n": "pleas inform us accommod may requir",
    "Information received relating to accommodation will be addressed confidentially.\n": "inform receiv relat accommod address confidenti",
    "Schedule: Part-time\n": "schedul part-tim",
    "placing and screwing in small washer on bolt, picking up a paper clip, etc...).\n": "place screw small washer bolt pick paper clip etc ...",
    "Location The Ritz-Carlton Toronto, 181 Wellington Street West, Toronto, ONT, Canada\n": "locat the ritz-carlton toronto 181 wellington street west toronto ont canada",
    "Schedule Full-Time\n": "schedul full-tim",
    "Relocation?\n": "reloc",
    "N\n": "n",
    "Schedule services for individuals and large groups using spa/salon reservations software system.\n": "schedul servic individu larg group use spa/salon reserv softwar system",
    "Call guests to confirm scheduled services.\n": "call guest confirm schedul servic",
    "Update the reservations/cancellations list throughout the day, inform providers of last-minute changes, and resolve scheduling issues as needed by working with supervisor/manager.\n": "updat reservations/cancel list throughout day inform provid last-minut chang resolv schedul issu need work supervisor/manag",
    "Check in guests for appointments, confirm first and last name, and provide general spa orientation to guests upon arrival.\n": "check guest appoint confirm first last name provid gener spa orient guest upon arriv",
    "Process guest payments for spa/salon services and obtain payment authorization as needed.\n": "process guest payment spa/salon servic obtain payment author need",
    "Balance, scan, and drop receipts with Accounting.\n": "balanc scan drop receipt account",
    "Comply with quality assurance expectations and standards.\n": "compli qualiti assur expect standard",
    "Perform other reasonable job duties as requested by Supervisors.\n": "perform reason job duti request supervisor",
    "MIRJ\n": "mirj",
    "Notification to Applicants: The Ritz-Carlton Toronto takes seriously its obligations under provincial human rights and accessibility legislation (such as the Accessibility for Ontarians with Disabilities Act, 2005, the Accessibility for Manitobans Act, and Nova Scotia Accessibility Act).\n": "notif applic the ritz-carlton toronto take serious oblig provinci human right access legisl access ontarian disabl act 2005 access manitoban act nova scotia access act",
    "Location:\n": "locat",
    "工作地點:\n": "工作地點",
    "溫哥華 國華旗艦店\n": "溫哥華 國華旗艦店",
    "職位條件:\n": "職位條件",
    "Ability to work in a team and manage time effectively.\n": "abil work team manag time effect",
    "募集個性活潑開朗、對推廣台灣食品有高度熱誠的夥伴加入。\n": "募集個性活潑開朗、對推廣台灣食品有高度熱誠的夥伴加入。",
    "歡迎加入成為國華夥伴！\n": "歡迎加入成為國華夥伴！",
    "工作內容:\n": "工作內容",
    "負責商品進貨入庫、缺補貨、商品陳列管及促銷品換檔工作\n": "負責商品進貨入庫、缺補貨、商品陳列管及促銷品換檔工作",
    "維持店內環境與陳列櫃週遭及產品之整潔\n": "維持店內環境與陳列櫃週遭及產品之整潔",
    "This job is suitable for someone who is willing to work hard.\n": "thi job suitabl someon will work hard",
    "Possibility for interview on the spot.Job Types: Full-time, PermanentSalary: From $16.00 per hourPart-time hours: 20 per weekJob Type: Part-timeSalary: From $16.00 per hour\n": "possibl interview spot.job type full-tim permanentsalari from 16.00 per hourpart-tim hour 20 per weekjob type part-timesalari from 16.00 per hour",
    "Wage: $15.00 per hour, plus 11.2 % holiday & vacation pay.\n": "wage 15.00 per hour plu 11.2 holiday vacat pay",
    "Competition will remain open until suitable candidates are found.\n": "competit remain open suitabl candid found",
    "YARD ASSOCIATE\n": "yard associ",
    "Company descriptionTriple O's is known for serving the highest quality, unique tasting burgers, shakes and fries.We're open for breakfast, lunch and dinner and offer a great working environment including extended health and dental benefits.\n": "compani descriptiontripl o 's known serv highest qualiti uniqu tast burger shake fries.w 're open breakfast lunch dinner offer great work environ includ extend health dental benefit",
    "This position is a fit for an energetic team player who is passionate about great food and thrives in a fast-paced environment.If you feel that you are the right candidate for this position, then please send your resume via email, or in person at our location on 3643 De Wolf way in MerrittJob descriptionPrevious guest service and cash handling experience is an asset, but this role can also be a great first job for a friendly team-oriented quick learner.We offer competitive earnings, employee discounts on our amazing food, flexible hours and opportunities to develop and advance.Part-time hours: 30-40 per weekExpected start date: 2021-10-18Job Types: Full-time, Part-time, CasualSalary: $16.00-$17.00 per hourAdditional pay:Overtime payBenefits:Discounted or free foodOn-site parkingSchedule:8 hour shiftDay shiftHolidaysMonday to FridayNight shiftOvertimeWeekend availabilityWork remotely:No\n": "thi posit fit energet team player passion great food thrive fast-pac environment.if feel right candid posit pleas send resum via email person locat 3643 de wolf way merrittjob descriptionprevi guest servic cash handl experi asset role also great first job friendli team-ori quick learner.w offer competit earn employe discount amaz food flexibl hour opportun develop advance.part-tim hour 30-40 per weekexpect start date 2021-10-18job type full-tim part-tim casualsalari 16.00- 17.00 per houraddit pay overtim paybenefit discount free foodon-sit parkingschedule:8 hour shiftday shiftholidaysmonday fridaynight shiftovertimeweekend availabilitywork remot no",
    "Be at least 19 years of age\n": "be least 19 year age",
    "): Not applicableExperience: Experience an asset, Will TrainLanguages: Speak English, Read English, Write EnglishWork Setting: Convenience store/Gas barBusiness Equipment: Price scanner, Cash register, Point-of-Sale System, General office equipmentSpecific Skills: Customer service oriented, Plan, organize, direct, control and evaluate daily operations, Implement operational procedures, Balance cash and complete balance sheets, cash reports, reconciliation and related forms,Transportation/Travel Information: Own transportation, Public transportation is availableWork Conditions and Physical Capabilities: Fast-paced environment, Work under pressure, Attention to detail, Standing for extended periodsEssential Skills: Reading text, Numeracy, Oral communication, Working with others, Computer use, Problem solving.137 Bristol Ave, Liverpool, NSJoin our team!Job Types: Full-time, Part-timeSchedule:10 hour shift8 hour shiftWork remotely:No\n": "not applicableexperi experi asset will trainlanguag speak english read english write englishwork set conveni store/ga barbusi equip price scanner cash regist point-of-sal system gener offic equipmentspecif skill custom servic orient plan organ direct control evalu daili oper implement oper procedur balanc cash complet balanc sheet cash report reconcili relat form transportation/travel inform own transport public transport availablework condit physic capabl fast-pac environ work pressur attent detail stand extend periodsessenti skill read text numeraci oral commun work other comput use problem solving.137 bristol ave liverpool nsjoin team job type full-tim part-timeschedule:10 hour shift8 hour shiftwork remot no",
    "Availability to work day shift\n": "avail work day shift",
    "Preference will be given with those with retail experience.Job Type: Part-timeWork remotely:No\n": "prefer given retail experience.job type part-timework remot no",
    "card or cashLooking for honest, positive attitude, and able to work fast and quicklyPlease contact Jimmy at 416-456-3358.Part-time hours: 35 per weekExpected start date: 2021-11-03Job Types: Full-time, Part-time, PermanentSalary: $15.00-$20.00 per hourAdditional pay:Bonus payTipsCOVID-19 considerations:All COVID-19 precaution take place to ensure safety of everyone.\n": "card cashlook honest posit attitud abl work fast quicklypleas contact jimmi 416-456-3358.part-tim hour 35 per weekexpect start date 2021-11-03job type full-tim part-tim permanentsalari 15.00- 20.00 per houraddit pay bonu paytipscovid-19 consider all covid-19 precaut take place ensur safeti everyon",
    "Motivated customer oriented individual available for a variety of shifts including evenings and weekends.\n": "motiv custom orient individu avail varieti shift includ even weekend",
    "Description:\n": "descript",
    "Posting End Date: 09-NOV-2021\n": "post end date 09-nov-2021",
    "Completion of Grade 12 or equivalent.\n": "complet grade 12 equival",
    "No experience is necessary, we will train the right person.If this sounds like you, we would love to meet you!Job Types: Full-time, Part-timeSalary: From $15.20 per hourSchedule:8 hour shiftDay shiftMonday to FridayNight shiftWeekend availabilityWork remotely:No\n": "no experi necessari train right person.if sound like would love meet job type full-tim part-timesalari from 15.20 per hourschedule:8 hour shiftday shiftmonday fridaynight shiftweekend availabilitywork remot no",
    "Product knowledge\n": "product knowledg",
    "Background in sales\n": "background sale",
    "Ability to read, write and effectively communicate in English with customers, peers and management\n": "abil read write effect commun english custom peer manag",
    "Ability to multi-task, while being attentive to customers and remaining flexible to the needs of the business\n": "abil multi-task attent custom remain flexibl need busi",
    "Ability to work as part of a team and take initiative independent of direct supervision\n": "abil work part team take initi independ direct supervis",
    "Employee discounts\n": "employe discount",
    "Preparing food and keeping our world famous burgers and fries, world famous.\n": "prepar food keep world famou burger fri world famou",
    "Working cash, working your smile.\n": "work cash work smile",
    "Package take-out food.\n": "packag take-out food",
    "Familiarity with cash register functions\n": "familiar cash regist function",
    "Ability to quickly perform basic math\n": "abil quickli perform basic math",
    "Willingness to work a flexible schedule that may include weekends and holidays\n": "willing work flexibl schedul may includ weekend holiday",
    "Ability to: lift 4 lbs.\n": "abil lift 4 lb",
    "Please apply on-line with your cover letter and resume at https://careers.dnv.org by November 16, 2021 to be considered.\n": "pleas appli on-lin cover letter resum http //careers.dnv.org novemb 16 2021 consid",
    "Experience in the liquor industry is considered an asset.\n": "experi liquor industri consid asset",
    "The use of the masculine gender has been adopted in order to lighten the text and has no discriminatory intent.\n": "the use masculin gender adopt order lighten text discriminatori intent",
    "Être sensible au vol interne et au vol à l'étalage et participe à les prévenir en respectant les politiques;\n": "être sensibl au vol intern et au vol à l'étalag et particip à le prévenir en respect le politiqu",
    "Respecter les\n": "respect le",
    "skillsAbility to execute and thrive in a fast-paced environmentA knack for delivering customer service and a desire to make connections with guestsAccountability and work ethicMust be available at least 2 weekend days (Friday-Sunday)We care for our team members by:Sharing tips equally between all restaurant employees30% discount off shift, free drinks on shiftOpportunities for internal promotion*Job Type: Full-timeSalary: From $14.35 per hourAdditional pay:TipsBenefits:Discounted or free foodSchedule:Day shiftHolidaysMonday to FridayOn callWeekend availabilityWork remotely:No\n": "skillsabl execut thrive fast-pac environmenta knack deliv custom servic desir make connect guestsaccount work ethicmust avail least 2 weekend day friday-sunday we care team member share tip equal restaur employees30 discount shift free drink shiftopportun intern promot job type full-timesalari from 14.35 per houraddit pay tipsbenefit discount free foodschedul day shiftholidaysmonday fridayon callweekend availabilitywork remot no",
    "Chez Your Independent Grocer, nous recherchons des personnes formidables pour renforcer continuellement notre culture.\n": "chez your independ grocer nou recherchon de personn formid pour renforc continuel notr cultur",
    "Type d'emploi:\n": "type d'emploi",
    "Post\n": "post",
    "The target is to ensure excellent service standards and maintain high customer satisfaction.Job Type: Full-time OR Part-time, PermanentHours:  FlexibleWork Remotely:  NoJob Types: Full-time, PermanentSalary: $20.00-$25.00 per hourAdditional pay:Bonus payOvertime payBenefits:Flexible scheduleOn-site parkingSchedule:Day shiftNo weekendsCOVID-19 considerations:Masks, gloves and hand sanitizer are provided to all employees and customers.Education:Secondary School (preferred)Experience:administrative assistant: 2 years (preferred)receptionist: 2 years (preferred)Work remotely:No\n": "the target ensur excel servic standard maintain high custom satisfaction.job type full-tim or part-tim permanenthour flexiblework remot nojob type full-tim permanentsalari 20.00- 25.00 per houraddit pay bonu payovertim paybenefit flexibl scheduleon-sit parkingschedul day shiftno weekendscovid-19 consider mask glove hand sanit provid employe customers.educ secondari school prefer experi administr assist 2 year prefer receptionist 2 year prefer work remot no",
    "Do you possess the skills to meet the rigorous demands of the cus\n": "do possess skill meet rigor demand cu",
    "Experience in all aspects of customer service and people management.\n": "experi aspect custom servic peopl manag",
    "Ability to analyze and interpret the needs of clients and offer the appropriate options, solutions, and resolutions required.\n": "abil analyz interpret need client offer appropri option solut resolut requir",
    "Work Conditions\n": "work condit",
    "Exposure to inclement weather.\n": "exposur inclement weather",
    "Pay\n": "pay",
    "*Parking gratuit sur place*Nourriture gratuite*Rabais YUL Employé*PourboiresType d'emploi : Temps Plein, Temps PartielSalaire : 15,00$ par heureAvantages :Horaires flexiblesN\n": "park gratuit sur place nourritur gratuit rabai yul employé pourboirestyp d'emploi temp plein temp partielsalair 15,00 par heureavantag horair flexiblesn",
    "Property Description: Pincourt\n": "properti descript pincourt",
    "Property Number: 4280\n": "properti number 4280",
    "Experience in a retail environment preferred\n": "experi retail environ prefer",
    "Sense of urgency\n": "sens urgenc",
    "(gestion de la relation avec la clientèle).\n": "gestion de la relat avec la clientèl",
    "(ex.\n": "ex",
    ": retirer les communications reçues par courriel, faire les commandes client et les commandes de fournitures, etc.).\n": "retir le commun reçu par courriel fair le command client et le command de fournitur etc",
    "Expérience dans la vente au détail de préférence\n": "expérienc dan la vent au détail de préférenc",
    "Ability to make cappuccinos, lattes and expressos a must.Job Types: Full-time, PermanentSalary: $15.00-$18.00 per hourAdditional pay:Overtime payTipsBene\n": "abil make cappuccino latt expresso must.job type full-tim permanentsalari 15.00- 18.00 per houraddit pay overtim paytipsben",
    "Assist in display of merchandise\n": "assist display merchandis",
    "skillsTeam playerGood time-management skillsGreat interpersonal and communication skillsActive listeningHigh school diploma; food safety training will be considered a plusJob Type: Full-timeJob Types: Full-time, Part-time, PermanentSalary: $11.75-$12.00 per hourSchedule:HolidaysMonday to FridayWeekendsExperience:Customer service: 1 year (preferred)Shift availability:Day Shift (preferred)Night Shift (preferred)Work remotely:No\n": "skillsteam playergood time-manag skillsgreat interperson commun skillsact listeninghigh school diploma food safeti train consid plusjob type full-timejob type full-tim part-tim permanentsalari 11.75- 12.00 per hourschedul holidaysmonday fridayweekendsexperi custom servic 1 year prefer shift avail day shift prefer night shift prefer work remot no",
    "Please answer all the questions asked.\n": "pleas answer question ask",
    "Please specify.Do you have reliable transportation in the event there is no public transportation available?Do you have a food safety certificate?Do you have any previous experience in a fast food type restaurant?Work remotely:No\n": "pleas specify.do reliabl transport event public transport avail do food safeti certif do previou experi fast food type restaur work remot no",
    "Ability to work as part of a team, and independently.\n": "abil work part team independ",
    "Ability to work as part of a team and individually, in a fast-paced environment.\n": "abil work part team individu fast-pac environ",
    "Ability to work weekends and weeknights and on occasion be available to cover shifts.\n": "abil work weekend weeknight occas avail cover shift",
    "Provide your own uniform in compliance with our uniform policy.\n": "provid uniform complianc uniform polici",
    "Equipment and Machinery Experience\n": "equip machineri experi",
    "Food processing industry\n": "food process industri",
    "Price items using stamp or stickers according to price list\n": "price item use stamp sticker accord price list",
    "Obtain articles for customers from shelf or stockroom\n": "obtain articl custom shelf stockroom",
    "Load and off-load machines\n": "load off-load machin",
    "Keep stock clean and in order\n": "keep stock clean order",
    "Order stock\n": "order stock",
    "Order picking\n": "order pick",
    "Record incoming stock\n": "record incom stock",
    "etc.\n": "etc",
    "Contribute to the sales and margin goals in the services area of the store, including print, digital marketing, shipping and tech services.\n": "contribut sale margin goal servic area store includ print digit market ship tech servic",
    "Own the appearance and standards of the solutions shop, and partner with the solutions shop team to maintain supplies.\n": "own appear standard solut shop partner solut shop team maintain suppli",
    "This list is only a sample; a Breakfast at Hilton Host(ess)/Cashier may be required to perform other duties.Hospitality Fallsview Holdings Inc. is an Equal Opportunity Employer.\n": "thi list sampl breakfast hilton host ess /cashier may requir perform duties.hospit fallsview hold inc. equal opportun employ",
    "Must be able to work daytime & evenings, weekends and holidays.\n": "must abl work daytim even weekend holiday",
    "Must be available for Christmas Break, Family Day Weekend and March Break.\n": "must avail christma break famili day weekend march break",
    "Winter at the resort boasts 43 ski and snowboard trails enhanced by a world-class snowmaking system.\n": "winter resort boast 43 ski snowboard trail enhanc world-class snowmak system",
    "Work schedule requires working evenings and weekends.Core Competencies· Customer and Contractor focus· Effective communicator and salesperson· Problem solver· Positive attitude· Eth\n": "work schedul requir work even weekends.cor competencies· custom contractor focus· effect commun salesperson· problem solver· posit attitude· eth",
    "The atmosphere is fun, teams are energetic, and ingredients are fresh and simple.\n": "the atmospher fun team energet ingredi fresh simpl",
    "Wage starts at $16/hr with opportunity to increase based on performance after a 3 month probation period has passed.\n": "wage start 16/hr opportun increas base perform 3 month probat period pass",
    "Ability to work a flexible schedule including evenings and weekends\n": "abil work flexibl schedul includ even weekend",
    "Must be able to enthusiastically interact with customers to drive sales.\n": "must abl enthusiast interact custom drive sale",
    "Evening, weekend and holiday shifts required.\n": "even weekend holiday shift requir",
    "This position reports directly to the Liquor Store Manager and some of the main\n": "thi posit report directli liquor store manag main",
    "Experience Level\n": "experi level",
    "Entry\n": "entri",
    "Compensation\n": "compens",
    "Hiring Organization\n": "hire organ",
    "On-location\n": "on-loc",
    "Possibility of advancement.\n": "possibl advanc",
    "pushing shopping carts from parking lot into the store on a regular basis\n": "push shop cart park lot store regular basi",
    "price checking for front end cashiers\n": "price check front end cashier",
    "Loblaw recognizes Canada's diversity as a source of national pride and strength.\n": "loblaw recogn canada 's divers sourc nation pride strength",
    "Accommodation is available upon request for applicants with disabilities in the recruitment and assessment process and when hired.\n": "accommod avail upon request applic disabl recruit assess process hire",
    "skills-development, and career pathways - as our team members grow and succeed both personally and professionally, so does Hudson.\n": "skills-develop career pathway team member grow succeed person profession hudson",
    "Assist in achieving sales goals and targets\n": "assist achiev sale goal target",
    "Assist customers with placing orders\n": "assist custom place order",
    "Candidate Requirements:\n": "candid requir",
    "Experience within th\n": "experi within th",
    "L'Équipeur\n": "l'équipeur",
    "Industry experience in financial services, retail, hospitality etc\n": "industri experi financi servic retail hospit etc",
    "A minimum of one year of client service preferably 2-3 years in one position.\n": "a minimum one year client servic prefer 2-3 year one posit",
    "Experience handling cash as well as experience working in a sales environment\n": "experi handl cash well experi work sale environ",
    "Working knowledge of Microsoft Office including Outlook, Excel, Word & PowerPoint\n": "work knowledg microsoft offic includ outlook excel word powerpoint",
    "Understanding of call center tools and technology used to manage KPIs and SLAs\n": "understand call center tool technolog use manag kpi sla",
    "Ability to work in a professional fast-paced environment\n": "abil work profession fast-pac environ",
    "COMPENSATION DETAILS:\n": "compens detail",
    "Paid Time-Off\n": "paid time-off",
    "SCHEDULE:\n": "schedul",
    "NEED A SCHEDULE THAT WORKS WITH YOUR LIFE?\n": "need a schedul that work with your life",
    "PHYSICAL REQUIREMENTS:\n": "physic requir",
    "The employee may occasionally be required to move about the office to accomplish tasks; reach in any direction; raise or lower objects, move objects from place to place, hold onto objects, and move or exert force up to forty (40) pounds.\n": "the employe may occasion requir move offic accomplish task reach direct rais lower object move object place place hold onto object move exert forc forti 40 pound",
    "CONDITIO\n": "conditio",
    "A preview of what you will have to do on a day-to\n": "a preview day-to",
    "Company descriptionVlad’s Bakery and Pastry is a family owned business.\n": "compani descriptionvlad ’ bakeri pastri famili own busi",
    "The owner has 30+ years in the business, working elsewhere and previously owning similar businesses.\n": "the owner 30+ year busi work elsewher previous own similar busi",
    "Work for a local business owner while having the support of a strong retail brand.\n": "work local busi owner support strong retail brand",
    "Benefit from a purchase discount program, flexible and varied schedules, competitive pay and online learning through Pharmaprix University (UPHX).\n": "benefit purchas discount program flexibl vari schedul competit pay onlin learn pharmaprix univers uphx",
    "Accommodation is available upon request for applicants and colleagues with disabilities.\n": "accommod avail upon request applic colleagu disabl",
    "The stylist also assists in all areas of store operations as requested by immediate supervisor.Primary ResponsibilitiesMaximize personal sales at all opportunitiesProvide a friendly and wel\n": "the stylist also assist area store oper request immedi supervisor.primari responsibilitiesmaxim person sale opportunitiesprovid friendli wel",
    "Possess a keen memory and delightful sense of humor\n": "possess keen memori delight sens humor",
    "In-store\n": "in-stor",
    "On-line\n": "on-lin",
    "A goal achiever; working individually and part of a team to achieve the store success\n": "a goal achiev work individu part team achiev store success",
    " A culture that is both rich and diverse, focused on onboarding great talent!\n": "a cultur rich divers focus onboard great talent",
    "A coach committed to supporting achievement of your personal career goals.\n": "a coach commit support achiev person career goal",
    "Perform other duties as required including Cashier duties when necessary\n": "perform duti requir includ cashier duti necessari",
    "QUALIFICATIONS\n": "qualif",
    "Plan work to maximize efficiency and minimize costs\n": "plan work maxim effici minim cost",
    "EXPERIENCE\n": "experi",
    "Familiarity with retail business\n": "familiar retail busi",
    "J2WFSM\n": "j2wfsm",
    "Judgment & decisions would be made based on ability to ask the right questions leading to the appropriate solutions\n": "judgment decis would made base abil ask right question lead appropri solut",
    "This position requires the ability to act upon tasks and goals outlined by management\n": "thi posit requir abil act upon task goal outlin manag",
    "Experience with retail/grocery and cash handling\n": "experi retail/groceri cash handl",
    "Commitment to providing exceptional customer service\n": "commit provid except custom servic",
    "Poste régulier\n": "post régulier",
    "The growth of recreational cannabis is a new and exciting industry and IPOT Cannabis is at the forefront.IPOT has opened its first shop located in Downtown Toronto and we are looking for a customer sales associate who enjoys working in a collaborative environment, eager to become a cannabis connoisseur, and is not afraid to express themselves within an entrepreneurial setting.\n": "the growth recreat cannabi new excit industri ipot cannabi forefront.ipot open first shop locat downtown toronto look custom sale associ enjoy work collabor environ eager becom cannabi connoisseur afraid express within entrepreneuri set",
    "Join our deli crew in our Lake Cowichan location.\n": "join deli crew lake cowichan locat",
    "This job is for you.Job Types: Full-time, Part-timeBenefits:Dental careDisability insuranceDiscounted or free foodExtended health careLife insuranceRRSP matchStore discountVision careSchedule:8 hour shiftWork remotely:No\n": "thi job you.job type full-tim part-timebenefit dental caredis insurancediscount free foodextend health carelif insurancerrsp matchstor discountvis careschedule:8 hour shiftwork remot no",
    "Metro-Vancouver\n": "metro-vancouv",
    "Experience in hospitality / customer service\n": "experi hospit custom servic",
    "Must be reliable and show up to shifts on time\n": "must reliabl show shift time",
    "Accommodation is available on request from candidates taking part in all aspects of the selection process.\n": "accommod avail request candid take part aspect select process",
    "skills.CUSTOMER SERVICE SKILLS Must possess a friendly, helpful and cheerful attitude to make customers feel welcome.\n": "skills.custom servic skill must possess friendli help cheer attitud make custom feel welcom",
    "Must be patience, attentive and be able to upsell.\n": "must patienc attent abl upsel",
    "Must be able to communicate clearly.EDUCATION and/or EXPERIENCE High school diploma preferred 6 months to 1 year of experience in branded quick service restaurants or restaurant with fast paced service Solid understanding of Health and Safety issues Solid understanding of Food SafetyCERTIFICATES, LICENSES, REGISTRATIONS Certified in recognized Safe Food Handling program preferred First Aid certificate preferred WHMIS certificate preferred Must be bondableJob Types: Full-time, Part-time, PermanentSalary: $13.50-$15.00 per hourSchedule:Day shiftNight shiftWork remotely:No\n": "must abl commun clearly.educ and/or experi high school diploma prefer 6 month 1 year experi brand quick servic restaur restaur fast pace servic solid understand health safeti issu solid understand food safetycertif licens registr certifi recogn safe food handl program prefer first aid certif prefer whmi certif prefer must bondablejob type full-tim part-tim permanentsalari 13.50- 15.00 per hourschedul day shiftnight shiftwork remot no",
    "Ability to anticipate situations and problem-solve independently\n": "abil anticip situat problem-solv independ",
    "Availability to work evenings and weekends\n": "avail work even weekend",
    "chris.fountain@cosmo.ca\n": "chris.fountain cosmo.ca",
    "This person will provide information to customers, perform math calculations (providing square footage) or reading tape measures to calculate inches and or sq ft. Cash, debit and credit transaction experience.Opportunity for advancement!Responsibilities: Professionalism in customer servicePoint of SaleCash debit and credit transactionsAnswer customer questionsPerform merchandising and light stockSome curbside may be requiredHours: 8:00 AM - 5:00 PM Mon - Fri8:00 AM - 4:00 PM SaturdayClosed SundaysTerms of employment: a probationary period of 3 mos will apply before direct hireJob Types: Full-time, Permanent, TemporarySalary: From $16.00 per hourBenefits:Store discountSchedule:8 hour shiftDay shiftMonday to FridayWeekendsWork remotely:No\n": "thi person provid inform custom perform math calcul provid squar footag read tape measur calcul inch sq ft. cash debit credit transact experience.opportun advanc respons profession custom servicepoint salecash debit credit transactionsansw custom questionsperform merchandis light stocksom curbsid may requiredhour 8:00 am 5:00 pm mon fri8:00 am 4:00 pm saturdayclos sundaysterm employ probationari period 3 mo appli direct hirejob type full-tim perman temporarysalari from 16.00 per hourbenefit store discountschedule:8 hour shiftday shiftmonday fridayweekendswork remot no",
    "Please refrain from calling the store.\n": "pleas refrain call store",
    "All employment decisions at I.O.N.\n": "all employ decis i.o.n",
    "***This job summary is intended to describe the general nature and level of work associates assigned to this job perform.\n": "thi job summari intend describ gener natur level work associ assign job perform",
    "Ability to work under minimal supervision, prioritize, multitask, detail oriented and highly organized;\n": "abil work minim supervis priorit multitask detail orient highli organ",
    "Possess a valid driver’s licence;\n": "possess valid driver ’ licenc",
    "Ability for overnight travel for coverage and out of town for meetings/training;\n": "abil overnight travel coverag town meetings/train",
    "Must be able to lift 25–30 pounds and occasionally up to 60 pounds.\n": "must abl lift 25–30 pound occasion 60 pound",
    "Ability to work in a fast pace environment\n": "abil work fast pace environ",
    "Ability to work independently and as part of a team\n": "abil work independ part team",
    "Each store has an Associate-Owner, so you will work for a local business owner while having the support of a national brand.\n": "each store associate-own work local busi owner support nation brand",
    "Benefit from a purchase discount program, flexible and varied schedules, competitive pay and online learning through Academy.\n": "benefit purchas discount program flexibl vari schedul competit pay onlin learn academi",
    "skills.Attention to detail.20 Hours/weekPart-time hours: 20 per weekJob Type: Part-timeSalary: Up to $17.00 per hourSchedule:Monday to FridayWeekend availabilityExperience:Medical office: 1 year (preferred)Work remotely:No\n": "skills.attent detail.20 hours/weekpart-tim hour 20 per weekjob type part-timesalari up 17.00 per hourschedul monday fridayweekend availabilityexperi medic offic 1 year prefer work remot no",
    "Ask about one of our many career path success stories during your interview.\n": "ask one mani career path success stori interview",
    "Shift into gear and apply today.\n": "shift gear appli today",
    "skillsKey Competenciesverbal and written communication skillsprofessional personal presentationcustomer service orientationinformation managementorganizing and planningattention to detailinitiativereliabilitystress toleranceJob Types: Full-time, Part-timeExperience:Customer Service: 1 year (Required)Location:Mississauga, ON (Preferred)\n": "skillskey competenciesverb written commun skillsprofession person presentationcustom servic orientationinform managementorgan planningattent detailinitiativereliabilitystress tolerancejob type full-tim part-timeexperi custom servic 1 year requir locat mississauga on prefer",
    "Ability to prioritize activities quickly in response to changing initiatives\n": "abil priorit activ quickli respons chang initi",
    "skillsUpbeat, optimistic, passionate, friendly and authenticBuilds relationships naturally, embraces individuality and diversityComfortable working in a team focused environment and sharing ideasMultiple language skills are an assetCapable of working together with customers to resolve any service issuesWork a flexible schedule that will include weekends, evenings, holidays, and special eventsEager to develop new skills and is responsive to feedbackResults-oriented and process driven, with high expectations of self and teamAVAILABILITYAll employees must be available at least one weekend day.Reference ID: https://app.jobvite.com/j?cj=oXcshfwC&s=IndeedPart-time hours: 25-40 per weekJob Types: Full-time, Part-time, PermanentSalary: From $15.20 per hourSchedule:8 hour shiftDay shiftHolidaysMonday to FridayWeekend availabilityCOVID-19 considerations:We follow all public health guidelines related to retail spaces.Application question(s):Are there any restrictions on your availability?\n": "skillsupbeat optimist passion friendli authenticbuild relationship natur embrac individu diversitycomfort work team focus environ share ideasmultipl languag skill assetcap work togeth custom resolv servic issueswork flexibl schedul includ weekend even holiday special eventseag develop new skill respons feedbackresults-ori process driven high expect self teamavailabilityal employe must avail least one weekend day.refer id http //app.jobvite.com/j cj=oxcshfwc s=indeedpart-tim hour 25-40 per weekjob type full-tim part-tim permanentsalari from 15.20 per hourschedule:8 hour shiftday shiftholidaysmonday fridayweekend availabilitycovid-19 consider we follow public health guidelin relat retail spaces.appl question are restrict avail",
    "Perform other reasonable job duties as requested by Manager.Other Duties:- assist and making coffee whenever needed- taking payment and handling cash accordingly whenever neededAn assets if you:- flexible and able to work on weekdays and weekends- have some baking experience (doesn’t matter how long)- comfortable to work alone on some shiftsJob Types: Full-time, Part-timeSalary: $15.20-$15.50 per hourAdditional pay:TipsBenefits:Discounted or free foodSchedule:Day shiftWork remotely:No\n": "perform reason job duti request manager.oth duti assist make coffe whenev needed- take payment handl cash accordingli whenev neededan asset flexibl abl work weekday weekends- bake experi ’ matter long comfort work alon shiftsjob type full-tim part-timesalari 15.20- 15.50 per houraddit pay tipsbenefit discount free foodschedul day shiftwork remot no",
    "Assist Customers in a retail settingBasic food prepFood safe preferredCleaning, organizing and restocking retail areaCash handlingCustomer sreviceJob Types: Full-time, Part-time, PermanentSalary: $18.00-$24.00 per hourSchedule:WeekendsExperience:sales: 1 year (preferred)customer service: 1 year (preferred)Work remotely:No\n": "assist custom retail settingbas food prepfood safe preferredclean organ restock retail areacash handlingcustom srevicejob type full-tim part-tim permanentsalari 18.00- 24.00 per hourschedul weekendsexperi sale 1 year prefer custom servic 1 year prefer work remot no",
    "skills· Strong customer service/people skills· Enjoys working with kids· Enjoys working within a team environment.· Must be available to work evenings and weekends· Must be available to work the entire winter.· Snowboard/Ski Tech/Tuning experience is an asset· Snowboarding, biking, wakeboard\n": "skills· strong custom service/peopl skills· enjoy work kids· enjoy work within team environment.· must avail work even weekends· must avail work entir winter.· snowboard/ski tech/tun experi asset· snowboard bike wakeboard",
    "All staff are encouraged to vaccinate.Ability to commute/relocate:Edmonton, AB: reliably commute or be willing to relocate with an employer-provided relocation package (preferred)Education:AEC / DEP or Skilled Trade Certifi\n": "all staff encourag vaccinate. commute/reloc edmonton ab reliabl commut will reloc employer-provid reloc packag prefer educ aec dep skill trade certifi",
    "Ability to recognize and react to changing work demands\n": "abil recogn react chang work demand",
    "Ability to effectively maneuver around Sales floor and stockroom, repetitive bending standing, twisting, stopping, squatting and climbing up and down ladders\n": "abil effect maneuv around sale floor stockroom repetit bend stand twist stop squat climb ladder",
    "Ability to work a flexible schedule to meet the needs of the business, including early morning, weekend and night shifts.\n": "abil work flexibl schedul meet need busi includ earli morn weekend night shift",
    "Ensure that a clean and safe environment is always top-of-mind, keeping the safety of yourself, fellow associates, and our customers as a key priority.\n": "ensur clean safe environ alway top-of-mind keep safeti fellow associ custom key prioriti",
    "Ability to achieve customer service excellence and sales results\n": "abil achiev custom servic excel sale result",
    "Ability to communicate with and engage customers effectively using a variety of mediums.\n": "abil commun engag custom effect use varieti medium",
    "Passionate\n": "passion",
    "RRSP/DPSP\n": "rrsp/dpsp",
    "Tuition Reimbursement Program\n": "tuition reimburs program",
    "Movement of freight by use of ladders and stock pickers is required.\n": "movement freight use ladder stock picker requir",
    "#bringyourpassion\n": "bringyourpass",
    "Schedule: Full-time\n": "schedul full-tim",
    "A day in the life of a Sales Associate:\n": "a day life sale associ",
    "Ability to work a flexible schedule to meet the needs of the business, including evening and weekend shifts\n": "abil work flexibl schedul meet need busi includ even weekend shift",
    "Ability to lift up to 40 pounds, as well as constant standing, walking, squatting, and bending\n": "abil lift 40 pound well constant stand walk squat bend",
    "LOCATION\n": "locat",
    "Make a difference.\n": "make differ",
    "Love your work.\n": "love work",
    "Everyone plays a role in the care continuum.\n": "everyon play role care continuum",
    "Work in a happy, positive team environment, must also be able to work independently.\n": "work happi posit team environ must also abl work independ",
    "skillsMust be able to work both independently and with a teamExcellent customer servi\n": "skillsmust abl work independ teamexcel custom servi",
    "Join the Point Zero Family!\n": "join point zero famili",
    "**The candidate selected will need to be tidy and detail-oriented, as they will be an integral help in maintaining cleaning and visual standards.\n": "the candid select need tidi detail-ori integr help maintain clean visual standard",
    "Ability to physically lift, push, pull up to 50 lbs.\n": "abil physic lift push pull 50 lb",
    "Must be committed to a SAFE working environment\n": "must commit safe work environ",
    "This position is based out of the Valleyview Liquor Store, though it may be require on some occasions to travel and work at other locations as business needs arise\n": "thi posit base valleyview liquor store though may requir occas travel work locat busi need aris",
    "All career opportunities will be open a minimum of 5 business days from the date of posting.\n": "all career opportun open minimum 5 busi day date post",
    "A day in the life of a Variety Clerk:\n": "a day life varieti clerk",
    "Ensure standards of department presentation and operations are met; including cleanliness, rotation, ordering and superior customer service\n": "ensur standard depart present oper met includ cleanli rotat order superior custom servic",
    "Completion of associated paperwork\n": "complet associ paperwork",
    "Ensure proper backroom procedures are being met\n": "ensur proper backroom procedur met",
    "Possess strong Customer Service qualities\n": "possess strong custom servic qualiti",
    "skills.Ability to make change.Basic math skills.Attention to detail.Expected start date: 2021-11-12Job Types: Full-time, TemporarySalary: Up to $15.00 per hourBenefits:Casual dressStore discountSchedule:8 hour shiftWork remotely:No\n": "skills.abl make change.bas math skills.attent detail.expect start date 2021-11-12job type full-tim temporarysalari up 15.00 per hourbenefit casual dressstor discountschedule:8 hour shiftwork remot no",
    "Someone needed to have some knowledge on POS ( cashier) and to dress burgersJob Types: Full-time, Part-timeSalary: Up to $15.00 per hourAdditional pay:TipsBenefits:Discounted or free foodSchedule:Day shiftNight shiftWork remotely:No\n": "someon need knowledg po cashier dress burgersjob type full-tim part-timesalari up 15.00 per houraddit pay tipsbenefit discount free foodschedul day shiftnight shiftwork remot no",
    "Building strong working relationships with team members and guests\n": "build strong work relationship team member guest",
    "Handling cash transactions including but not limited to foreign currency exchange, traveler’s cheques, short pays, over payments, cash counts, coins and bills\n": "handl cash transact includ limit foreign currenc exchang travel ’ chequ short pay payment cash count coin bill",
    "Monitoring and reporting all discrepancies and suspicious cash activities\n": "monitor report discrep suspici cash activ",
    "Redeeming value chips and gaming tickets for cash\n": "redeem valu chip game ticket cash",
    "skillsAbility to move with tempo to meet time bound expectationsGood written and verbal communication skillsProficient in use of technology to successfully engage in customer interactions (i.e.\n": "skillsabl move tempo meet time bound expectationsgood written verbal commun skillsprofici use technolog success engag custom interact i.e",
    "Redeeming value chips and gaming tickets f\n": "redeem valu chip game ticket f",
    "This position you must be min.\n": "thi posit must min",
    "Must be available weekends*\n": "must avail weekend",
    "Passion for active, healthy living\n": "passion activ healthi live",
    "Ability to strike up conversations with customers\n": "abil strike convers custom",
    "Find what moves you\n": "find move",
    "Specialty shop\n": "specialti shop",
    "Maintain a clean, customer friendly environment in the store\n": "maintain clean custom friendli environ store",
    "Ring customer sales on an electronic cash register\n": "ring custom sale electron cash regist",
    "Perform all regular cleaning activities and other tasks that are included on job assignments\n": "perform regular clean activ task includ job assign",
    "Must be able to communicate clearly and effectively with customers and coworkers\n": "must abl commun clearli effect custom cowork",
    "Desire to be part of a performance-dr\n": "desir part performance-dr",
    "Must be able to lift 70lbs\n": "must abl lift 70lb",
    "Company matched RRSPs (Helping you plan for your future\n": "compani match rrsp help plan futur",
    "Desire to provide great service\n": "desir provid great servic",
    "Passionate about food\n": "passion food",
    "Greet customers and respond to customer questions,\n": "greet custom respond custom question",
    "Attention to detail and quality,\n": "attent detail qualiti",
    "Ability to work in a fast-paced environment,\n": "abil work fast-pac environ",
    "Ab\n": "ab",
    "This employee is attentive to customers needs and responds to their requests.\n": "thi employe attent custom need respond request",
    "Offer excellent customer service\n": "offer excel custom servic",
    "Respond to patient requests within the legal limits of\n": "respond patient request within legal limit",
    "Experience working in a concession, food preparation, or food handling environment is an asset\n": "experi work concess food prepar food handl environ asset",
    "Work well under pressure; can handle multiple tasks simultaneously\n": "work well pressur handl multipl task simultan",
    "Experience operating iPad with Square technology is an asset\n": "experi oper ipad squar technolog asset",
    "Every team member will be familiar with the business process documentation and internal control objectives related to their position and how their job description aligns with specific internal control activities for which they are responsible.\n": "everi team member familiar busi process document intern control object relat posit job descript align specif intern control activ respons",
    "Every team member must adhere to all Company and regulatory policies as they relate to functions of\n": "everi team member must adher compani regulatori polici relat function",
    "The abo\n": "the abo",
    "taking telephone order, serve customers on counter, assist chef for some simple work at free time, and cleaning.\n": "take telephon order serv custom counter assist chef simpl work free time clean",
    "need to be bilingual.Part-time hours: 20 per weekExpected start date: 2021-11-15Job Types: Part-time, PermanentSalary: $13.50-$14.00 per hourAdditional pay:TipsBenefits:Discounted or free foodSchedule:Day shiftWeekend availabilityWork remotely:No\n": "need bilingual.part-tim hour 20 per weekexpect start date 2021-11-15job type part-tim permanentsalari 13.50- 14.00 per houraddit pay tipsbenefit discount free foodschedul day shiftweekend availabilitywork remot no",
    "Ability to adapt to new technology\n": "abil adapt new technolog",
    "The requirement to be fully vaccinated is subject to provincial/territorial human rights legislation.\n": "the requir fulli vaccin subject provincial/territori human right legisl",
    "(Training will be provided)FoodSafe level 1 is an asset but not requiredTeam player with a strong work ethic and positive attitudeStanding/ Walking at least 7 hoursPotential Career Opportunities: Next Level: Shift supervisor and Store ManagerBenefits: Half an hour break pay after three months probation periodDiscounts on our food and drinks2 free drinks in the shiftPlease drop off your resume on 101-7315 Edmonds St or Email me.Job Type: Part-timeJob Type: Part-timeSalary: From $15.20 per hourAdditional pay:TipsBenefits:Discounted or free foodStore discountSchedule:8 hour shiftDay shiftHolidaysMonday to FridayNo weekendsWeekend availabilityLicence:Smart Serve, SIR or equivalent (Preferred)Work remotely:No\n": "train provid foodsaf level 1 asset requiredteam player strong work ethic posit attitudestanding/ walk least 7 hourspotenti career opportun next level shift supervisor store managerbenefit half hour break pay three month probat perioddiscount food drinks2 free drink shiftpleas drop resum 101-7315 edmond st email me.job type part-timejob type part-timesalari from 15.20 per houraddit pay tipsbenefit discount free foodstor discountschedule:8 hour shiftday shiftholidaysmonday fridayno weekendsweekend availabilitylic smart serv sir equival prefer work remot no",
    "customer servicecash/debitlottolight cleaning/sanitizing*Part-time hours: 20-25 per weekJob Types: Part-time, PermanentSalary: Up to $16.00 per hourBenefits:Store discountSchedule:8 hour shiftDay shiftHolidaysMonday to FridayWeekend availabilityCOVID-19 considerations:All customers and employees are required to wear mask, common surfaces are sanitized regularlyExperience:Customer service: 1 year (preferred)Shift availability:Day Shift (preferred)Work remotely:No\n": "custom servicecash/debitlottolight cleaning/sanit part-tim hour 20-25 per weekjob type part-tim permanentsalari up 16.00 per hourbenefit store discountschedule:8 hour shiftday shiftholidaysmonday fridayweekend availabilitycovid-19 consider all custom employe requir wear mask common surfac sanit regularlyexperi custom servic 1 year prefer shift avail day shift prefer work remot no",
    "This position currently pays $17.40-$19.00 per hour, plus discounts on Food & Beverage, Hotel stays, and Marina activities at our sister properties!\n": "thi posit current pay 17.40- 19.00 per hour plu discount food beverag hotel stay marina activ sister properti",
    "Position Summary:\n": "posit summari",
    "Process all payment types, vouchers, paid-outs, charges and email/print folios\n": "process payment type voucher paid-out charg email/print folio",
    "Understanding of squirrel, and other key systems (Visionline)\n": "understand squirrel key system visionlin",
    "Quality of service, able to hand complaints and provide resolution\n": "qualiti servic abl hand complaint provid resolut",
    "Class 5 license\n": "class 5 licens",
    "Ability to plan, prioritize and complete multiple projects in a timely manner\n": "abil plan priorit complet multipl project time manner",
    "Ability to develop common sense solutions to everyday problems\n": "abil develop common sens solut everyday problem",
    "Ability to develop and motivate staff to achieve goals\n": "abil develop motiv staff achiev goal",
    "Ability to work with all employees to promote teamwork and co-operative relationships within and across departments\n": "abil work employe promot teamwork co-op relationship within across depart",
    "Company matched RRSPs (Helping you plan for your future)\n": "compani match rrsp help plan futur",
    "Address:\n": "address",
    "Ability to multi-task and work independently when neededIntermediate English and Basic French language\n": "abil multi-task work independ neededintermedi english basic french languag",
    "Priority is given to internal candidates within their employment category.\n": "prioriti given intern candid within employ categori",
    "skillsWork well autonomously and in a team· Ability and willingness to run a cash register· Good communication and organizational skills· Ability to multitask in a fast-paced environment· Ability to take initiative to complete tasks and solve problems· Ability to meet deadlines· Ability to manage time and prioritizePhysical Requirements: Ability to stand for extended periods and climb a ladder;Move, lift and handle boxes of merchandise and fixtures throughout the store (weighing up to 30 pounds).hours: 20-45 per weekExpected start date: 2021-11-01Job Types: Full-time, Part-time, Temporary, ContractBenefits:Store discountSchedule:10 hour shift8 hour shif\n": "skillswork well autonom team· abil willing run cash register· good commun organiz skills· abil multitask fast-pac environment· abil take initi complet task solv problems· abil meet deadlines· abil manag time prioritizephys requir abil stand extend period climb ladder move lift handl box merchandis fixtur throughout store weigh 30 pound .hour 20-45 per weekexpect start date 2021-11-01job type full-tim part-tim temporari contractbenefit store discountschedule:10 hour shift8 hour shif",
    "Ability to lift 30-50 pounds\n": "abil lift 30-50 pound",
    "Ability to stand for extensive periods of time\n": "abil stand extens period time",
    "Salesclerk\n": "salesclerk",
    "Salesperson\n": "salesperson",
    "Ability to work a varied schedule including weekends, evenings and statutory holidays.\n": "abil work vari schedul includ weekend even statutori holiday",
    "No phone calls or recruiting agencies please.\n": "no phone call recruit agenc pleas",
    "Ability to lift 70lbs./stand for 3 hour intervals\n": "abil lift 70lbs./stand 3 hour interv",
    "Experience working in a team environment and independently an asset\n": "experi work team environ independ asset",
    "Experience working in an environment with safety standards an asset\n": "experi work environ safeti standard asset",
    "POSTING DETAILS\n": "post detail",
    "Location: 506 - Winnipeg\n": "locat 506 winnipeg",
    "Experience in retail sales and supervision is preferred\n": "experi retail sale supervis prefer",
    "The ability to work both independently and collaboratively is a requirement.\n": "the abil work independ collabor requir",
    "skills.Ability to work well within a team.Ability to receive feedback and take action when appropriate.Able to stand and move about for long periods of time; reach, bend, stoop, etc.\n": "skills.abl work well within team.abl receiv feedback take action appropriate. stand move long period time reach bend stoop etc",
    "Ability to stand for extended periods and climb a ladder;\n": "abil stand extend period climb ladder",
    "Availability Requirements:\n": "avail requir",
    "This job description is not intended to be all-inclusive.\n": "thi job descript intend all-inclus",
    "✓ Flexible schedule\n": "✓ flexibl schedul",
    "Selection decisions are solely based on job-related factors.\n": "select decis sole base job-rel factor",
    "Woot!!\n": "woot",
    "Employment is contingent upon a sati\n": "employ conting upon sati",
    "ADDITIONAL INFORMATION\n": "addit inform",
    "Work in a fragrance filled environment.\n": "work fragranc fill environ",
    "COMPANY OVERVIEW\n": "compani overview",
    "Schedule\n": "schedul",
    "Schedule Description\n": "schedul descript",
    "This position is also involved in assisting with the planning, development and implementation of the Bookstore's website.\n": "thi posit also involv assist plan develop implement bookstor 's websit",
    "Provide support for parking services and ke\n": "provid support park servic ke",
    "Discount on vehicles, service and parts for you and your family\n": "discount vehicl servic part famili",
    "Must be a self starter and work well unsupervised.\n": "must self starter work well unsupervis",
    "Order merchandise\n": "order merchandis",
    "Art Knapp - Courtenay is looking for new members to join our front end team.\n": "art knapp courtenay look new member join front end team",
    "Ability to multi-task\n": "abil multi-task",
    "Perform other related duties as assigned\n": "perform relat duti assign",
    "Courtenay\n": "courtenay",
    "Please call 855-556-2675 or email aoda@lb.com if you require an accommodation.\n": "pleas call 855-556-2675 email aoda lb.com requir accommod",
    "skillsYou’re up for learning new things and willing to jump right in and get your hands dirtyYou’re ridiculously reliable, incredibly responsible and always punctualYou’re available to work evenings and weekendsBonus points for having: At least 6 months experience working with a point of sale systemAt least 6 months of cash handling experienceContract length: 2.5 monthsPart-time hours: 20-30 per weekJob Types: Part-time, TemporaryBenefits:Flexible scheduleOn-site parkingStore discountSchedule:HolidaysWeekend availabilityExperience:sales: 1 year (preferred)customer service: 1 year (preferred)Work remotely:No\n": "skillsyou ’ learn new thing will jump right get hand dirtyy ’ ridicul reliabl incred respons alway punctualy ’ avail work even weekendsbonu point at least 6 month experi work point sale systemat least 6 month cash handl experiencecontract length 2.5 monthspart-tim hour 20-30 per weekjob type part-tim temporarybenefit flexibl scheduleon-sit parkingstor discountschedul holidaysweekend availabilityexperi sale 1 year prefer custom servic 1 year prefer work remot no",
    "A career in Nike Retail demands creativity and a\n": "a career nike retail demand creativ",
    "skillsEnjoy working within a team environment to achieve store goalsMulti-tasking abilities to assist customers while completing operational tasksEnjoy working in a team environmentPOSITION DETAILSCustomer service positions assisting customers shopManaging change rooms, customer requests and cash deskOrganizing stock and inventory to maintain store appearanceStanding for long periods of time, using ladders and lifting boxesPersonal and family discountPart-time hours: 20 per weekJob Types: Part-time, Permanent\n": "skillsenjoy work within team environ achiev store goalsmulti-task abil assist custom complet oper tasksenjoy work team environmentposit detailscustom servic posit assist custom shopmanag chang room custom request cash deskorgan stock inventori maintain store appearancestand long period time use ladder lift boxesperson famili discountpart-tim hour 20 per weekjob type part-tim perman",
    "Must be comfortable to work alone if needed.The successful candidate will be required, but not limited to: unloading shipments, stocking shelves, taking inventory, operating a till, assisting customers' needs, and other general duties.Job Types: Full-time, Part-timeBenefits:Casual dressOn-site parkingSchedule:Day shiftHolidaysNight shiftWeekend availabilityCOVID-19 considerations:All customers/staff required to wear a mask.\n": "must comfort work alon needed.th success candid requir limit unload shipment stock shelv take inventori oper till assist custom need gener duties.job type full-tim part-timebenefit casual dresson-sit parkingschedul day shiftholidaysnight shiftweekend availabilitycovid-19 consider all customers/staff requir wear mask",
    "Ability to work in a team environment that provides assistance and support to co-workers to achieve common goals.\n": "abil work team environ provid assist support co-work achiev common goal",
    "Check figures, postings, and documents for accuracy.\n": "check figur post document accuraci",
    "Record, store, access, and/or analyze computerized financial information.\n": "record store access and/or analyz computer financi inform",
    "Organize, secure, and maintain all files and records in accordance with document retention and confidentiality policies and procedures.\n": "organ secur maintain file record accord document retent confidenti polici procedur",
    "Audit and reconcile all revenue postings.\n": "audit reconcil revenu post",
    "This position requires associates to be fully vaccinated for COVID-19 per current Public Health Agency of Canada standards or approved for a Human Rights accommodation.\n": "thi posit requir associ fulli vaccin covid-19 per current public health agenc canada standard approv human right accommod",
    "Notification to Applicants: Delta Hotels Quebec takes seriously its obligations under the applicable provincial legislation and will provide accommodations to job applicants needing assistance.\n": "notif applic delta hotel quebec take serious oblig applic provinci legisl provid accommod job applic need assist",
    "OUTGROWN YOUR OWN BACKYARD?\n": "outgrown your own backyard",
    "Ability to clearly communicate with others\n": "abil clearli commun other",
    "Availability to work a flexible, often changing retail schedule to support needs of the business which may change seasonally and in response to business trends or forecasts\n": "avail work flexibl often chang retail schedul support need busi may chang season respons busi trend forecast",
    "This job description is not meant to be an all-inclusive list of duties and\n": "thi job descript meant all-inclus list duti",
    "Company descriptionindian grocery store ,serving noth and south indian ,fiji,srilanka,african groceries,meat,vegetables and money gram servicesJob descriptionThe Store Attendant is responsible for performing duties associated with the upkeep and maintenance of a Store.\n": "compani descriptionindian groceri store serv noth south indian fiji srilanka african groceri meat veget money gram servicesjob descriptionth store attend respons perform duti associ upkeep mainten store",
    "Ability to work well under pressure in a fast-paced environment\n": "abil work well pressur fast-pac environ",
    "Ability to work cohesively with fellow colleagues as part of a team with minimum supervision\n": "abil work cohes fellow colleagu part team minimum supervis",
    "The hotel is unable to assist candidates in obtaining Canadian work authorization.\n": "the hotel unabl assist candid obtain canadian work author",
    "The mix of sport and fashion is what makes us unique.\n": "the mix sport fashion make us uniqu",
    "A love of fashion, sport and a healthy, active lifestyle\n": "a love fashion sport healthi activ lifestyl",
    "The mix of fashion and sport is what makes us unique.\n": "the mix fashion sport make us uniqu",
    "Access to the best brands and vendors including training and learning opportunities\n": "access best brand vendor includ train learn opportun",
    "Must be able to sit or stand for up to 8 hoursDesirable: 1.\n": "must abl sit stand 8 hoursdesir 1",
    "Experience in the hospitality industry2.\n": "experi hospit industry2",
    "skillsWork well autonomously and in a teamPhysical Requirements: Ability to stand for extended periods and climb a ladder;Move, lift and handle boxes of merchandise and fixtures throughout the store (weighing up to 30 pounds).Availability Requirements: Days, evenings and weekends.This job description is not intended to be all-inclusive.\n": "skillswork well autonom teamphys requir abil stand extend period climb ladder move lift handl box merchandis fixtur throughout store weigh 30 pound .avail requir day even weekends.thi job descript intend all-inclus",
    "Selection decisions are solely based on job-related factors.Ardene is an equal opportunity employer, and as such, does not discriminate in hiring or terms and conditions of employment on the basis of an individual’s race, ancestry, color, place of origin, religion, gender, gender identity, citizenship, age, sexual orientation, disability, national origin, family status, marital status or any other or any other characteristic protected by applicable laws.\n": "select decis sole base job-rel factors.arden equal opportun employ discrimin hire term condit employ basi individu ’ race ancestri color place origin religion gender gender ident citizenship age sexual orient disabl nation origin famili statu marit statu characterist protect applic law",
    "Selection decisions are solely based on job-related factors.Job Types: Part-time, Temporary, Contract\n": "select decis sole base job-rel factors.job type part-tim temporari contract",
    "Required Experience:\n": "requir experi",
    "Working knowledge of computers\n": "work knowledg comput",
    "Ability to lift up to 25 lbs\n": "abil lift 25 lb",
    "Ability to move and replace fixtures, shelves and hardware throughout the store\n": "abil move replac fixtur shelv hardwar throughout store",
    "Ability to use ladders on a frequent basis\n": "abil use ladder frequent basi",
    "Capacity to stand for long periods\n": "capac stand long period",
    "Rexall 7149 - 1055 West Georgia Street, Unit 122 Vancouver, BC V6E 3P3 It starts with you.\n": "rexal 7149 1055 west georgia street unit 122 vancouv bc v6e 3p3 it start",
    "A desire and ability to work with the public.\n": "a desir abil work public",
    "Maintain a professional appearance and manner at all times\n": "maintain profession appear manner time",
    "Ability to effectively deal with guest and employee concerns in a friendly and positive manner\n": "abil effect deal guest employe concern friendli posit manner",
    "frnch1\n": "frnch1",
    "Ability to multitask and show flexibility across priorities\n": "abil multitask show flexibl across prioriti",
    "Ability to establish and maintain good working relationships with all levels of the organization and the public\n": "abil establish maintain good work relationship level organ public",
    "Profil\n": "profil",
    "Ability to build strong relationships with your team and customersStrong communication and interpersonal skillsSense of initiative and commercial creativityInitiative, flexibility and organisationLeadership\n": "abil build strong relationship team customersstrong commun interperson skillssens initi commerci creativityin flexibl organisationleadership",
    "Location Le Centre Sheraton Montreal Hotel, 1201 Rene-Levesque Blvd West, Montreal, QC, Canada VIEW ON MAP\n": "locat le centr sheraton montreal hotel 1201 rene-levesqu blvd west montreal qc canada view on map",
    "Schedule Part-Time\n": "schedul part-tim",
    "Process all payment types such as room charges, cash, checks, debit, or credit.\n": "process payment type room charg cash check debit credit",
    "Coordinate with Housekeeping to track readiness of rooms for check-in.\n": "coordin housekeep track readi room check-in",
    "Supply guests with directions and information regarding property and local areas of interest.\n": "suppli guest direct inform regard properti local area interest",
    "Cash guests' personal checks and traveler's checks.\n": "cash guest person check travel 's check",
    "Balance and drop receipts according to Accounting specifications.\n": "balanc drop receipt accord account specif",
    "Notification to Applicants: Le Centre Sheraton Montreal Hotel takes seriously its obligations under the applicable provincial legislation and will provide accommodations to job applicants needing assistance.\n": "notif applic le centr sheraton montreal hotel take serious oblig applic provinci legisl provid accommod job applic need assist",
    "Ability to work independently and participate as an active and responsible team member in a cooperative team environment.\n": "abil work independ particip activ respons team member cooper team environ",
    "Ability to stand for long periods with frequent twisting, bending, crouching and reaching is required.\n": "abil stand long period frequent twist bend crouch reach requir",
    "Ability to lift/move up to 25 pounds on a regular basis.\n": "abil lift/mov 25 pound regular basi",
    "Represent the organization in a positive, professional and engaging manner\n": "repres organ posit profession engag manner",
    "Exhibit good listening skills, have strong oral/written communication skills\n": "exhibit good listen skill strong oral/written commun skill",
    "Develop an understanding and support for the mission and purpose of The Salvation Army in Canada and its implications as related to position\n": "develop understand support mission purpos the salvat armi canada implic relat posit",
    "cleaning of all equipment at store.\n": "clean equip store",
    "take out garbage, etc.\n": "take garbag etc",
    "Exposure to extreme cold temperatures while performing occasional work in a walk in cooler and/or freezer.Exposure to occasional noise.Work with a minimum direction and periodic supervision.\n": "exposur extrem cold temperatur perform occasion work walk cooler and/or freezer.exposur occasion noise.work minimum direct period supervis",
    "Ability to stand and/or walk for up to 8 hours.Ability to occasionally lift and/or carry up to 30 pounds from ground to overhead up to 30 minutes of workday (i.e., assisting in\n": "abil stand and/or walk 8 hours.abl occasion lift and/or carri 30 pound ground overhead 30 minut workday i.e. assist",
    "stocking/maintaining inventory levels).\n": "stocking/maintain inventori level",
    "(This handwork requires eye-hand coordination, and\n": "thi handwork requir eye-hand coordin",
    "NOTE: This Job Description may change periodically as required by business necessity, with or without advance notice to employees.\n": "note thi job descript may chang period requir busi necess without advanc notic employe",
    "Be Real: with your needs and feedback for your team and leaders and adaptable to the needs of the business as required.\n": "be real need feedback team leader adapt need busi requir",
    "Ability to work flexible hours to meet the needs of the shop including holidays, evenings and weekends\n": "abil work flexibl hour meet need shop includ holiday even weekend",
    "Ability to oversee and support operations of a retail shop as needed, including but not limited to: Till and cash, visuals and inventory, soap cutting, wrapping, labeling, potting, boxing and recycling.\n": "abil overse support oper retail shop need includ limit till cash visual inventori soap cut wrap label pot box recycl",
    "Experience in customer service\n": "experi custom servic",
    "Experience working in a team environment\n": "experi work team environ",
    "Experience working in skincare or cosmetics\n": "experi work skincar cosmet",
    "Experience in cross cultural collaboration and DEIB or social justice training\n": "experi cross cultur collabor deib social justic train",
    "Fluency in Spanish, French or other languages\n": "fluenci spanish french languag",
    "All background checks and pre-employment tests will be paid for by Mid Island Co-op.We thank all candidates for their interest; however, only those selected to continue in the recruitment process will be contacted.Part-time hours: 16-32 per weekJob Types: Full-time, Part-time, PermanentSalary: From $15.80 per hourAdditional pay:Bonus payBenefits:Casual dressCompany pensionDental careDisability insuranceEmployee assistance programExtended health careFlexible scheduleLife insuranceOn-site parkingPaid time offTuition reimbursementVision careSchedule:8 hour shiftDay shiftHolidaysMonday to FridayNight shiftWeekend availabilityWork remotely:No\n": "all background check pre-employ test paid mid island co-op.w thank candid interest howev select continu recruit process contacted.part-tim hour 16-32 per weekjob type full-tim part-tim permanentsalari from 15.80 per houraddit pay bonu paybenefit casual dresscompani pensiondent caredis insuranceemploye assist programextend health careflex schedulelif insuranceon-sit parkingpaid time offtuit reimbursementvis careschedule:8 hour shiftday shiftholidaysmonday fridaynight shiftweekend availabilitywork remot no",
    "Balance to zero at the completion of each shift;Initiates and completes sales transactions with visitors.\n": "balanc zero complet shift initi complet sale transact visitor",
    "Team members are united by valuesand proud of the reputation we are building together.\n": "team member unit valuesand proud reput build togeth",
    "Everyone at Spark is a purpose driven leader.\n": "everyon spark purpos driven leader",
    "Every day is aprofessional development day at Spark.\n": "everi day aprofession develop day spark",
    "skills· Able to maintain professional, positive, and calm under pressure· Organized and reliable; adept at multitasking and has time management skills· Proficient with Microsoft Office· At least 1 year of experience in reception/administrative dutiesCandidates with front desk experience at clinics or spas would be preferred.What We Offer You: · Fantastic location in the heart of Toronto· Short walk away from TTC subway - Yonge & Bloor station· Collaborative environment with a high-performing team that enjoys learning from each other· Equal treatment on all levels· Electronic medical records, direct billing, and online booking (less filing and paperwork)To Apply: · Send a cover letter with your availability and resume· For more information about our clinic, you may visit our website at https://www.stepupclinic.com/We thank all applicants for their interest in joining the Step Up team.\n": "skills· abl maintain profession posit calm pressure· organ reliabl adept multitask time manag skills· profici microsoft office· at least 1 year experi reception/administr dutiescandid front desk experi clinic spa would preferred.what we offer you · fantast locat heart toronto· short walk away ttc subway yong bloor station· collabor environ high-perform team enjoy learn other· equal treatment levels· electron medic record direct bill onlin book less file paperwork to appli · send cover letter avail resume· for inform clinic may visit websit http //www.stepupclinic.com/w thank applic interest join step up team",
    "Ability to multi-task, while being attentive to the needs of clients and the business.\n": "abil multi-task attent need client busi",
    "The holiday season is here and we are looking for some extra help!\n": "the holiday season look extra help",
    "The position is PT temporary until Jan of 2022.\n": "the posit pt temporari jan 2022",
    "Position will be to commence quickly upon finding the right candidate.Contract length: 2 monthsPart-time hours: 15-30 per weekJob Types: Part-time, Temporary, ContractSalary: From $15.00 per hourBenefits:Store discountSchedule:8 hour shiftDay shiftHolidaysNight shiftOn callWeekend availabilityCOVID-19 considerations:All staff and customers required to be compliant with all Provincial Covid measures in place, and as changes are madeExperience:sales: 1 year (required)customer service: 1 year (required)Work remotely:No\n": "posit commenc quickli upon find right candidate.contract length 2 monthspart-tim hour 15-30 per weekjob type part-tim temporari contractsalari from 15.00 per hourbenefit store discountschedule:8 hour shiftday shiftholidaysnight shifton callweekend availabilitycovid-19 consider all staff custom requir compliant provinci covid measur place chang madeexperi sale 1 year requir custom servic 1 year requir work remot no",
    "Aufgaben\n": "aufgaben",
    "Qualifikationen\n": "qualifikationen",
    "Commitment to inclusion & diversity\n": "commit inclus divers",
    "Training, development and career growth opportunities\n": "train develop career growth opportun",
    "State of the art working facilities\n": "state art work facil",
    "Recognition rewards and discount programs\n": "recognit reward discount program",
    "Professionalism in customer service\n": "profession custom servic",
    "Sugge\n": "sugg",
    "Take initiative and work well with minimal supervision\n": "take initi work well minim supervis",
    "Discount at our retail stores\n": "discount retail store",
    "Training and professional development opportunities\n": "train profession develop opportun",
    "Uniform and safety shoe allowance\n": "uniform safeti shoe allow",
    "Preference given to Whitehorse residents.\n": "prefer given whitehors resid",
    "No experience necessary, just willing to learn.\n": "no experi necessari will learn",
    "Working stock filling shelvesPart-time hours: 16-24 per weekApplication deadline: 2021-11-11Expected start date: 2021-11-15Job Types: Part-time, PermanentBenefits:Store discountSchedule:8 hour shiftDay shiftHolidaysMonday to FridayWeekend availabilityExperience:sales: 1 year (preferred)customer service: 1 year (preferred)Work remotely:No\n": "work stock fill shelvespart-tim hour 16-24 per weekappl deadlin 2021-11-11expect start date 2021-11-15job type part-tim permanentbenefit store discountschedule:8 hour shiftday shiftholidaysmonday fridayweekend availabilityexperi sale 1 year prefer custom servic 1 year prefer work remot no",
    "Maintain the highest quality standards and portion consistency.· Responsible for serving/bartending when needed.\n": "maintain highest qualiti standard portion consistency.· respons serving/bartend need",
    "OUR VALUES\n": "our valu",
    "Familiar with the use of a cash register is an asset\n": "familiar use cash regist asset",
    "Must be a team player\n": "must team player",
    "skills.Unyielding salesmanship.Confidence and enthusiasm.Love for fashion.Job Type: Part-timeSalary: $14.35-$16.00 per hourBenefits:Flexible scheduleStore discountSchedule:8 hour shiftHolidaysOn callWeekend availabilityCOVID-19 considerations:COVID-19 considerations:Personal protective equipment provided or requiredPlastic shield at work stationsSocial distancing guidelines in placeSanitizing, disinfecting, or cleaning procedures in placeEducation:Secondary School (preferred)Experience:sales: 1 year (preferred)customer service: 1 year (preferred)Shift availability:Day Shift (preferred)Night Shift (preferred)Work remotely:No\n": "skills.unyield salesmanship.confid enthusiasm.lov fashion.job type part-timesalari 14.35- 16.00 per hourbenefit flexibl schedulestor discountschedule:8 hour shiftholidayson callweekend availabilitycovid-19 consider covid-19 consider person protect equip provid requiredplast shield work stationssoci distanc guidelin placesanit disinfect clean procedur placeeduc secondari school prefer experi sale 1 year prefer custom servic 1 year prefer shift avail day shift prefer night shift prefer work remot no",
    "The job\n": "the job",
    "Preparing food and drinks\n": "prepar food drink",
    "Managing delivery and mobile orders\n": "manag deliveri mobil order",
    "Ability to follow The Salvation Army Standards, Policies and Procedures in the operation of a Thrift Store.\n": "abil follow the salvat armi standard polici procedur oper thrift store",
    "Ability to be confidential & trustworthy as the incumbent is looking out for the interest of the Thrift Store and The Salvation Army.\n": "abil confidenti trustworthi incumb look interest thrift store the salvat armi",
    "Location\n": "locat",
    "Midland\n": "midland",
    "PERKS\n": "perk",
    "Efficiency with cashier duties; ringing and taking orders correctly\n": "effici cashier duti ring take order correctli",
    "Ability to work effectively during busy periods;\n": "abil work effect busi period",
    "Ability to work under pressure;\n": "abil work pressur",
    "Ability to work standing for long periods;\n": "abil work stand long period",
    "www.mandys.ca\n": "www.mandys.ca",
    "skillsRetail or customer service experience an assetSome perks of working with us include an amazing clothing discount, an excellent training program and flexible scheduling!Please email your resume in PDF format and include in the subject line the location to which you are applying, or you can drop your resumes off in person to the below address:Swift Current Mall1 Springs DriveSwift Current, SKS9H 3X6(306) 773-4047Eclipse would like to thank all applicants for their interest, however, only those candidates selected for an interview will be contacted.Eclipse is an equal opportunity employer, and as such, does not discriminate in hiring or terms and conditions of employment on the basis of an individual’s race, ancestry, color, place of origin, religion, gender, gender i\n": "skillsretail custom servic experi assetsom perk work us includ amaz cloth discount excel train program flexibl schedul pleas email resum pdf format includ subject line locat appli drop resum person address swift current mall1 spring driveswift current sks9h 3x6 306 773-4047eclips would like thank applic interest howev candid select interview contacted.eclips equal opportun employ discrimin hire term condit employ basi individu ’ race ancestri color place origin religion gender gender",
    "Company Description\n": "compani descript",
    "This position is eligible for an annual retention bonus of up to $1050\n": "thi posit elig annual retent bonu 1050",
    "Look into bags, toolboxes and wheelbarrows at the entrance and exit of the store for any forgotten parts or for tools not authorized in the yard;\n": "look bag toolbox wheelbarrow entranc exit store forgotten part tool author yard",
    "Be engaged and able to hold a conversation with customers;\n": "be engag abl hold convers custom",
    "Offer an excellent customer service;\n": "offer excel custom servic",
    "Be resourceful;\n": "be resourc",
    "Ability to work indoors and outdoors in a changing environment;\n": "abil work indoor outdoor chang environ",
    "Overtime opportunities;\n": "overtim opportun",
    "Overtime at time and a half after 44 hours;\n": "overtim time half 44 hour",
    "Bonus plan up to $1050/ year\n": "bonu plan 1050/ year",
    "Paid steel toe boot;\n": "paid steel toe boot",
    "Uniform provided;\n": "uniform provid",
    "(Think your friends and family love you now?\n": "think friend famili love",
    "Integrity and adherence to standards, policy and procedures\n": "integr adher standard polici procedur",
    "Experience in a team driven environment\n": "experi team driven environ",
    "Please ensure that you take the time to ensure your profile shows us why you’re the most qualified applicant for the role.\n": "pleas ensur take time ensur profil show us ’ qualifi applic role",
    "Growing organization\n": "grow organ",
    "Ongoing Training & Development\n": "ongo train develop",
    "Duty meal in our newly renovated staff cafeteria\n": "duti meal newli renov staff cafeteria",
    "Opportunity to develop your talent and\n": "opportun develop talent",
    "Opportunity\n": "opportun",
    "The job can be quite physical and involves standing, walking and lifting.\n": "the job quit physic involv stand walk lift",
    "Work Conditions and Physical Capabilities Fast-paced environment, Combination of sitting, standing, walking, Walking, Attention to detail, Standing for extended periods Personal Suitability Reliability, Team player, Client focus, Excellent oral communication, Flexibility, Organized Additional Skills Hire and train or arrange for training of staff, Order merchandise, Establish work schedules Specific Skills Assign sales workers to duties, Authorize payments by cheque, Authorize return of merchandise, Sell merchandise, Prepare reports on sales volumes, merchandising and personnel matters, Resolve problems that arise, such as customer complaints and supply shortages, Organize and maintain inventory, Supervise and co-ordinate activities of workers Work Setting Retail businessJob Types: Full-time, PermanentSalary: From $15.00 per hourBenefits:Store discountSchedule:8 hour shiftMonday to FridayNight shiftExperience:sales: 1 year (preferred)customer service: 1 year (preferred)\n": "work condit physic capabl fast-pac environ combin sit stand walk walk attent detail stand extend period person suitabl reliabl team player client focu excel oral commun flexibl organ addit skill hire train arrang train staff order merchandis establish work schedul specif skill assign sale worker duti author payment chequ author return merchandis sell merchandis prepar report sale volum merchandis personnel matter resolv problem aris custom complaint suppli shortag organ maintain inventori supervis co-ordin activ worker work set retail businessjob type full-tim permanentsalari from 15.00 per hourbenefit store discountschedule:8 hour shiftmonday fridaynight shiftexperi sale 1 year prefer custom servic 1 year prefer",
    "No experience required.Job Types: Full-time, Part-timeSalary: $14.35 per hourSchedule:8 hour shiftWork remotely:No\n": "no experi required.job type full-tim part-timesalari 14.35 per hourschedule:8 hour shiftwork remot no",
    "skills.Willingness to learn.Excellent mathematical skills.Prior retail experience is beneficial.Willingness to continually develop professional skills and knowledge base.Ability to work cooperatively in a team atmosphere.Job Types: Part-timeJob Type: Part-timeSchedule:8 hour shiftWeekend availabilityExperience:sales: 1 year (preferred)customer service: 1 year (preferred)Work remotely:No\n": "skills.willing learn.excel mathemat skills.prior retail experi beneficial.willing continu develop profession skill knowledg base. work cooper team atmosphere.job type part-timejob type part-timeschedule:8 hour shiftweekend availabilityexperi sale 1 year prefer custom servic 1 year prefer work remot no",
    "Preference will be given with those with retail experience.Job Type: Part-timeJob Type: Part-timeSchedule:Monday to FridayWeekend availabilityWork remotely:No\n": "prefer given retail experience.job type part-timejob type part-timeschedul monday fridayweekend availabilitywork remot no",
    "skills.Must possess strong organizational and time management skills.Must possess an outstanding level of customer service with a guest focus, be punctual, well-organized and have a keen eye for detail.Must have excellent attention to details.Must be able to stand for long periods of timeJob Types: Full-time, Part-timeAdditional pay:Tips\n": "skills.must possess strong organiz time manag skills.must possess outstand level custom servic guest focu punctual well-organ keen eye detail.must excel attent details.must abl stand long period timejob type full-tim part-timeaddit pay tip",
    "The cuisine of the food comes from southern barbecue, specifically Kansas City.\n": "the cuisin food come southern barbecu specif kansa citi",
    "Ability to take direction and to work in a team environment.\n": "abil take direct work team environ",
    "Ability to work calmly and effectively under pressure.\n": "abil work calmli effect pressur",
    "Commitment to quality service, and food and beverage knowledge.\n": "commit qualiti servic food beverag knowledg",
    "Any area of the recruitment process, in any format (collectively, \"Recruitment\"), including telephone screening, in-person interviews, employer-to-applicant video conferencing, comply with applicable laws, including provincial human rights legislation and all Provincial laws regarding accessibility.\n": "ani area recruit process format collect `` recruit '' includ telephon screen in-person interview employer-to-applic video conferenc compli applic law includ provinci human right legisl provinci law regard access",
    "The recruitment and interview processes will be made available and provided in a way that best suits the needs of an applicant.\n": "the recruit interview process made avail provid way best suit need applic",
    "INDFOH\n": "indfoh",
    "Pursuant to the San Francisco Fair Chance Ordinance, we will consider qualified applicants with arrest and conviction records for employment.\n": "pursuant san francisco fair chanc ordin consid qualifi applic arrest convict record employ",
    "Do you thrive in sales and have exemplary customer service?\n": "do thrive sale exemplari custom servic",
    "No experience is necessary, we will train the right person!If this sounds like you, we would love to meet you!Job Types: Full-time, Part-timeSalary: From $15.20 per hourSchedule:8 hour shiftDay shiftMonday to FridayNight shiftWeekend availabilityWork remotely:No\n": "no experi necessari train right person if sound like would love meet job type full-tim part-timesalari from 15.20 per hourschedule:8 hour shiftday shiftmonday fridaynight shiftweekend availabilitywork remot no",
    "skills.Must possess strong organizational and time management skills.Must possess an outstanding level of customer service with a guest focus, be punctual, well-organized and have a keen eye for detail.Must have excellent attention to details.Must be able to stand for long periods of timeExpected start date: 2021-11-08Job Types: Full-time, Part-timeWork remotely:No\n": "skills.must possess strong organiz time manag skills.must possess outstand level custom servic guest focu punctual well-organ keen eye detail.must excel attent details.must abl stand long period timeexpect start date 2021-11-08job type full-tim part-timework remot no",
    "Work Arrangements\n": "work arrang",
    "Expected shift hours 7:00am – 7:00pm in January (4th – 18th) Monday – Friday.\n": "expect shift hour 7:00am – 7:00pm januari 4th – 18th monday – friday",
    "DO what you love.\n": "do love",
    "Be good at it.\n": "be good",
    "Must be able to stand for 8 hours shiftStocking and cleaning duties are required to doOther duties as assignedAddress: 7280 Dixie Road, Mississauga, ON L5S 1E1Please DO NOT APPLY IF YOU DON'T WISH TO WORK.\n": "must abl stand 8 hour shiftstock clean duti requir doother duti assignedaddress 7280 dixi road mississauga on l5 1e1pleas do not appli if you do n't wish to work",
    "This role also involves store maintenance such as stocking shelves, merchandising and general housekeeping.\n": "thi role also involv store mainten stock shelv merchandis gener housekeep",
    "This position also requires delivering friendly and courteous service while processing customer purchases efficiently and correctly.\n": "thi posit also requir deliv friendli courteou servic process custom purchas effici correctli",
    "An eye for the details.Team oriented.\n": "an eye details.team orient",
    "Please no phone calls.Job Types: Full-time, PermanentBenefits:Company eventsDental careDisability insuranceEmployee assistance programEmployee stock purchase planExtended health careLife insuranceRRSP matchStore discountSchedule:8 hour shiftMonday to FridayWeekend availabilityExperience:sales: 1 year (preferred)customer service: 1 year (preferred)Work remotely:No\n": "pleas phone calls.job type full-tim permanentbenefit compani eventsdent caredis insuranceemploye assist programemploye stock purchas planextend health carelif insurancerrsp matchstor discountschedule:8 hour shiftmonday fridayweekend availabilityexperi sale 1 year prefer custom servic 1 year prefer work remot no",
    "skillsü Detail orientatedü 19 years or olderü CannSell CertificationWe appreciate and thank all applicants for their interest, but only qualified applicants will be contacted.\n": "skillsü detail orientatedü 19 year olderü cannsel certificationw appreci thank applic interest qualifi applic contact",
    "Proficient in Microsoft Office (Word, Outlook, Excel, etc.)\n": "profici microsoft offic word outlook excel etc",
    "skills· flexible availability as the operating hours require some evenings and weekends· willingness to learn and grow with the business_ If this sounds like you, please send your resume!\n": "skills· flexibl avail oper hour requir even weekends· willing learn grow business_ if sound like pleas send resum",
    "This position is based out of the Gloucester Gas Bar, though it may require on some occasions to travel and work at other locations as business needs arise\n": "thi posit base gloucest ga bar though may requir occas travel work locat busi need aris",
    "This position is from 10:30 to 4 pm, Monday to Friday.\n": "thi posit 10:30 4 pm monday friday",
    "A cashier will also prepare Ubereats orders for drivers to pick up and provide curbside pick-up for our customers.\n": "a cashier also prepar ubereat order driver pick provid curbsid pick-up custom",
    "Position SummaryThe Retail Clerk provides prompt, courteous and knowledgeable service and advice to all customers/clients of Prairie Meats LP to enhance their shopping experience.\n": "posit summaryth retail clerk provid prompt courteou knowledg servic advic customers/cli prairi meat lp enhanc shop experi",
    "Ability to work a flexible schedule including nights, weekends, and holidays as needed\n": "abil work flexibl schedul includ night weekend holiday need",
    "Firm commitment to accountability\n": "firm commit account",
    "Ability to utilize computer for word processing, and email communications\n": "abil util comput word process email commun",
    "Working knowledge of Excel\n": "work knowledg excel",
    "Supervise the volunteers in the front and in the back of the shop throughout the day\n": "supervis volunt front back shop throughout day",
    "Provide an exceptional level of guest experience through guest interactions, sales and service.\n": "provid except level guest experi guest interact sale servic",
    "Perform all cash handling duties (opening, cash balancing, coin orders and closing).\n": "perform cash handl duti open cash balanc coin order close",
    "Ensure proactive communication with other key departments on resort (Guest Services, Mountain Operations, etc.)\n": "ensur proactiv commun key depart resort guest servic mountain oper etc",
    "Perform other duties as assigned.\n": "perform duti assign",
    "Work flexible shifts, including weekends and holidays.\n": "work flexibl shift includ weekend holiday",
    "A staff season’s pass for the resort and local mountains.\n": "a staff season ’ pass resort local mountain",
    "Please apply with your resume.\n": "pleas appli resum",
    "Salary/Wage: $15.30\n": "salary/wag 15.30",
    "skillsAbility to stand, bend, kneel and lift up-to 30lbs and use ladders (training provided)Ability to work flexible shifts – day, evening and weekendsJob Types: Full-time, Part-time, ContractSchedule:Monday to FridayWeekend availabilityCOVID-19 considerations:All staff must be double vaccinated.\n": "skillsabl stand bend kneel lift up-to 30lb use ladder train provid abil work flexibl shift – day even weekendsjob type full-tim part-tim contractschedul monday fridayweekend availabilitycovid-19 consider all staff must doubl vaccin",
    "Send us your resume and cover letter detailing why you’re a good fit for Eden.Scheduling: Store Hours: 10:00am-9:00pm 7 days a week.\n": "send us resum cover letter detail ’ good fit eden.schedul store hour 10:00am-9:00pm 7 day week",
    "Cultivate a relationship with the community via personal involvement, PR events and advertising opportunities.\n": "cultiv relationship commun via person involv pr event advertis opportun",
    "Assist in merchandising, display maintenance and store housekeeping.\n": "assist merchandis display mainten store housekeep",
    "Ability to work varied hours/days as business dictates.\n": "abil work vari hours/day busi dictat",
    "Experience in either general sales, budgeting, service contracts, hotel / property management, or auto rental are desired but not required.\n": "experi either gener sale budget servic contract hotel properti manag auto rental desir requir",
    "Must be able to read, write, and speak in the English language.\n": "must abl read write speak english languag",
    "(apron, badges, etc)\n": "apron badg etc",
    "No agency or telephone inquiries please.\n": "no agenc telephon inquiri pleas",
    "skills.Ability to lift up to 50 lbs.\n": "skills.abl lift 50 lb",
    "Adherence to policy – follows the operating and safety policies without fail\n": "adher polici – follow oper safeti polici without fail",
    "Send your resume to shiela.perez@randstad.ca\n": "send resum shiela.perez randstad.ca",
    "Please reach out to paul.mesiona@randstad.ca, along with your resume.\n": "pleas reach paul.mesiona randstad.ca along resum",
    "Please reach out to shiela.perez@randstad.ca , along with your resume.\n": "pleas reach shiela.perez randstad.ca along resum",
    "Every month we give away a prize to one lucky customer.\n": "everi month give away prize one lucki custom",
    "No experience is needed we can teach you everything you need to know!Hours would be 7am-3pm4-5 shifts a weekDuties includeServing customersstalking shelvesMaintaining a clean work spaceWe are looking for someone to start immediately.\n": "no experi need teach everyth need know hour would 7am-3pm4-5 shift weekduti includeserv customersstalk shelvesmaintain clean work spacew look someon start immedi",
    "This position will report to the Grocery Manager.\n": "thi posit report groceri manag",
    "Action Oriented\n": "action orient",
    "The position is based on 24-40 hrs/wk.\n": "the posit base 24-40 hrs/wk",
    "The candidate must be able to work days, evenings, and weekends on a rotational basis.\n": "the candid must abl work day even weekend rotat basi",
    "Completion of high school diploma or equivalent experience\n": "complet high school diploma equival experi",
    "food & beverage service, housekeeping, etc.)\n": "food beverag servic housekeep etc",
    "Employee Perks!\n": "employe perk",
    "Closing shift will also be responsible for the cash out at the end of the day, ensuring clients are out of the facility on time, and completing the duties list.Ideal candidates should have some customer service experience, sales experience is also an asset.Shifts will be 1-2 weekday closing shifts [6pm-10pm] and weekends [2pm-7pm], Wednesday evening availability is a must.Job Type: Part-timeSalary: From $15.20 per hourBenefits:On-site gymOn-site parkingStore discountSchedule:HolidaysMonday to FridayWeekend availabilityApplication question(s):Are you available Wednesday Evenings between 6pm-10pm?Education:Secondary School (preferred)Experience:Customer service: 1 year (preferred)Work remotely:No\n": "close shift also respons cash end day ensur client facil time complet duti list.id candid custom servic experi sale experi also asset.shift 1-2 weekday close shift 6pm-10pm weekend 2pm-7pm wednesday even avail must.job type part-timesalari from 15.20 per hourbenefit on-sit gymon-sit parkingstor discountschedul holidaysmonday fridayweekend availabilityappl question are avail wednesday even 6pm-10pm educ secondari school prefer experi custom servic 1 year prefer work remot no",
    "Flexibility to work a variety of hours which may include days, evenings, night shifts and weekends\n": "flexibl work varieti hour may includ day even night shift weekend",
    "Part time employees can be scheduled up to 28 hours a week.\n": "part time employe schedul 28 hour week",
    "Do you love to work in a fast-paced, dynamic, customer-driven environment?\n": "do love work fast-pac dynam customer-driven environ",
    "skills.Ability to multi-task, prioritize and meet deadlines.Ability to work in a standing position for many hoursAbility to lift heavy objects, stretch and bend.We thank all applicants for their interest; however, only selected candidates will be contacted.WE ARE RUDSAK.\n": "skills.abl multi-task priorit meet deadlines. work stand posit mani hoursabl lift heavi object stretch bend.w thank applic interest howev select candid contacted.w are rudsak",
    "skills· Basic mathematical skills· Ability to communicate effectively with staff and customers· Ability to work independently in a fast-paced environmentPhysical ability to perform the duties of the jobWorking Conditions:· Lifting weights of 10 - 20 kilograms (bags of dog food, potatoes, onions, cases of pop)· Standing for long periods of time while at the cash· Reaching and lifting of grocery items while scanning items (e.g., cases of pop, large bags of potatoes, dog food)· Exposure to heat, cold and dust due to work location near store entrance/exitsExposure to chemicals used to clean conveyor belt, scanner and food alleysExpected start date: 2021-11-07Job T\n": "skills· basic mathemat skills· abil commun effect staff customers· abil work independ fast-pac environmentphys abil perform duti jobwork condit · lift weight 10 20 kilogram bag dog food potato onion case pop · stand long period time cash· reach lift groceri item scan item e.g. case pop larg bag potato dog food · exposur heat cold dust due work locat near store entrance/exitsexposur chemic use clean conveyor belt scanner food alleysexpect start date 2021-11-07job t",
    "Ability to understand and carry out oral and written instructions and request clarification when needed\n": "abil understand carri oral written instruct request clarif need",
    "Operating in 67 countries, we serve over 100 million consumers each day through our unique combination of services.\n": "oper 67 countri serv 100 million consum day uniqu combin servic",
    "Start your journey with Sodexo, as we continue to grow across Canada!\n": "start journey sodexo continu grow across canada",
    "skills· desire an interest in the health and fitness community· sales experience an asset· Must be 19 years or older to applyYour job duties/\n": "skills· desir interest health fit community· sale experi asset· must 19 year older applyyour job duties/",
    "Overview:\n": "overview",
    "Meeting or exceeding individual sales and key business driver goals\n": "meet exceed individu sale key busi driver goal",
    "Maintaining awareness and following policies and procedures as they relate to standard operating procedures, loss prevention and safety\n": "maintain awar follow polici procedur relat standard oper procedur loss prevent safeti",
    "Ability to regularly lift and/or move up to 10 lbs, and frequently lift and/or move up to 25 lbs\n": "abil regularli lift and/or move 10 lb frequent lift and/or move 25 lb",
    "Flexibility to work weekends, evenings, and holidays when needed\n": "flexibl work weekend even holiday need",
    "Experience with customer service or counter sales\n": "experi custom servic counter sale",
    "Outstanding customer service and verbal communication skills\n": "outstand custom servic verbal commun skill",
    "Experience working in a fast-paced environment\n": "experi work fast-pac environ",
    "Possess a strong work ethic and a high standard of integrity\n": "possess strong work ethic high standard integr",
    "Ability to work well independently and in a team setting\n": "abil work well independ team set",
    "Desire to have fun with teammates and customers\n": "desir fun teammat custom",
    "Familiarity with using the Internet as a resource to problem solve and find alternative solutions for customers\n": "familiar use internet resourc problem solv find altern solut custom",
    "Ability to problem solve and provide our customers with solutions for their plumbing & heating issues\n": "abil problem solv provid custom solut plumb heat issu",
    "Participation in our pension plan with employer contributions\n": "particip pension plan employ contribut",
    "The ability to provide inspirational, authentic and personalized customer service\n": "the abil provid inspir authent person custom servic",
    "Schedul\n": "schedul",
    "Ability to multitask and adapt to shifting priorities - flexibility to work in multiple departments\n": "abil multitask adapt shift prioriti flexibl work multipl depart",
    "Experience as a Hairstylist or an Esthetician is considered an asset but not required\n": "experi hairstylist esthetician consid asset requir",
    "Be Your Natural Self!\n": "be your natur self",
    "No regard shall be given to an applicant’s race, religion, skin colour, sexual orientation, and political belief.\n": "no regard shall given applic ’ race religion skin colour sexual orient polit belief",
    "Following business unit approved marketing guidelines and prepare pitch deck materials to showcase the aforementioned recommendations through formal pitch presentations and meeting consults.\n": "follow busi unit approv market guidelin prepar pitch deck materi showcas aforement recommend formal pitch present meet consult",
    "Ensuring customer renewals and retention activities are appropriately reflected in pipeline and supporting activities.\n": "ensur custom renew retent activ appropri reflect pipelin support activ",
    "Establishing implementation roadmaps and monitoring progress to ensure that anticipated revenue for the account is achieved immediately following implementation.\n": "establish implement roadmap monitor progress ensur anticip revenu account achiev immedi follow implement",
    "Technology is always on your mind.\n": "technolog alway mind",
    "Stay with our client for a season or build a career; the option is yours!\n": "stay client season build career option",
    "Are you up to the challenge?\n": "are challeng",
    "Pharmacy or drugstore\n": "pharmaci drugstor",
    "Main\n": "main",
    ")-Coffee or Tea “Markout” is a pound of coffee or box of tea or K-cups each weekDiscounts with local and national retailers (cell phones, gym memberships, entertainment tickets, hotels, etc.\n": "-coffe tea “ markout ” pound coffe box tea k-cup weekdiscount local nation retail cell phone gym membership entertain ticket hotel etc",
    "https://starbucks.taleo.net/careersection/1000222retail/jobdetail.ftl?job=190008830Part-time hours: 10-34 per weekJob Types: Full-time, Part-time, PermanentSalary: $14.50-$17.00 per hourPart-time hours: 12-40 per weekExpected start date: 2021-11-15Job Types: Part-time, PermanentSalary: $14.50-$17.00 per hourBenefits:Casual dressCompany eventsDental careDisability insuranceEmployee assistance programEmployee stock purchase planExtended health careFlexible scheduleLife insurancePaid time offProfit sharingStock optionsStore discountTuition reimbursementVision careWellness programSchedule:8 hour shiftDay shiftHolidaysMonday to FridayNight shiftWeekend availabilityCOVID-19 considerations:Yes!\n": "http //starbucks.taleo.net/careersection/1000222retail/jobdetail.ftl job=190008830part-tim hour 10-34 per weekjob type full-tim part-tim permanentsalari 14.50- 17.00 per hourpart-tim hour 12-40 per weekexpect start date 2021-11-15job type part-tim permanentsalari 14.50- 17.00 per hourbenefit casual dresscompani eventsdent caredis insuranceemploye assist programemploye stock purchas planextend health careflex schedulelif insurancepaid time offprofit sharingstock optionsstor discounttuit reimbursementvis carewel programschedule:8 hour shiftday shiftholidaysmonday fridaynight shiftweekend availabilitycovid-19 consider ye",
    "Benefit from working flexible hours, evenings and weekends\n": "benefit work flexibl hour even weekend",
    "Ability to stand and walk for long periods of time; bend and reach repeatedly\n": "abil stand walk long period time bend reach repeatedli",
    "Apply\n": "appli",
    "Must be available to work Holidays, Evenings and Weekends.\n": "must avail work holiday even weekend",
    "Main Responsibilities are:\n": "main respons",
    "Greet customers and direct them toward appropriate sales staff\n": "greet custom direct toward appropri sale staff",
    "Process all sales transactions, receive payments and obtain the necessary authorizations for purchases made by cheque or credit card\n": "process sale transact receiv payment obtain necessari author purchas made chequ credit card",
    "skillsGood math skillsStrong communication and time management skillsFlexibilityBCLC experience an assetExpected start date: 2021-11-15Job Type: Full-timeSalary: $15.20-$16.00 per hourSchedule:8 hour shiftExperience:sales: 1 year (preferred)customer service: 1 year (preferred)\n": "skillsgood math skillsstrong commun time manag skillsflexibilitybclc experi assetexpect start date 2021-11-15job type full-timesalari 15.20- 16.00 per hourschedule:8 hour shiftexperi sale 1 year prefer custom servic 1 year prefer",
    "Emplacement Principal...\n": "emplac princip ...",
    "Position is for day shifts and evening shifts.\n": "posit day shift even shift",
    "Looking cashier for Jugo juice.Job Types: Full-time, Part-timeSalary: From $14.25 per hourBenefits:On-site parkingSchedule:8 hour shiftDay shiftMonday to FridayNight shiftWeekend availabilityWork remotely:No\n": "look cashier jugo juice.job type full-tim part-timesalari from 14.25 per hourbenefit on-sit parkingschedule:8 hour shiftday shiftmonday fridaynight shiftweekend availabilitywork remot no",
    "Handling cash and processing debitOrder takingHandling food and packing ordersAnswering phoneKeeping area clean, sanitized and stockedPreparing beverages and baked goods for customersSuccessful candidate will have a high level of customer service, work well independently and with a team.Job Types: Full-time, PermanentSalary: From $12.00 per hourAdditional pay:Overtime payTipsBenefits:Casual dressDental careDiscounted or free foodExtended health careFlexible scheduleOn-site parkingStore discountVision careSchedule:8 hour shiftWork remotely:No\n": "handl cash process debitord takinghandl food pack ordersansw phonekeep area clean sanit stockedprepar beverag bake good customerssuccess candid high level custom servic work well independ team.job type full-tim permanentsalari from 12.00 per houraddit pay overtim paytipsbenefit casual dressdent carediscount free foodextend health careflex scheduleon-sit parkingstor discountvis careschedule:8 hour shiftwork remot no",
    "Ensuring service is maintained at levels above industry standards.\n": "ensur servic maintain level industri standard",
    "Work Environment Considerations\n": "work environ consider",
    "time, money handling\n": "time money handl",
    "Every team\n": "everi team",
    "member will follow the internal control practices required of their position and department.\n": "member follow intern control practic requir posit depart",
    "Every team member will follow and support the Core Values, Mission and Guiding Principles\n": "everi team member follow support core valu mission guid principl",
    "Compliance Requirements · Every team member must comply with all requiremen\n": "complianc requir · everi team member must compli requiremen",
    "No experience is required, just a can-do attitude and:A positive outlook with bags of personalityA passion for delivering excellence in everything you doGood communication skills because you will be talking to our amazing customers dailyCourage to show your confidenceYou will often need to multitask, therefore a hard-working attitude if key hereA bit\n": "no experi requir can-do attitud a posit outlook bag personalitya passion deliv excel everyth dogood commun skill talk amaz custom dailycourag show confidencey often need multitask therefor hard-work attitud key herea bit",
    "skills.CUSTOMER SERVICE SKILLSMust possess a friendly, helpful and cheerful attitude to make customers feel welcome.\n": "skills.custom servic skillsmust possess friendli help cheer attitud make custom feel welcom",
    "Must be patient, attentive and be able to upsell.LANGUAGE SKILLSMust have the ability to read, write and speak English or other languages as necessary.\n": "must patient attent abl upsell.languag skillsmust abil read write speak english languag necessari",
    "Must be able tocommunicate clearly.EDUCATION and/or EXPERIENCEHigh school diploma preferred6 months to 1 year of experience in branded quick service restaurants or restaurant with fast paced serviceSolid understanding of Health and Safety issuesSolid understanding of Food SafetyCERTIFICATES, LICENSES, REGISTRATIONSCertified in recognized Safe Food Handling program preferredFirst Aid certificate preferredWHMIS certificate preferredMust be bondableLocation: 995 Wellington Road, London, Ontario N6E 1W4Job Types: Full-time, Part-time\n": "must abl tocommun clearly.educ and/or experiencehigh school diploma preferred6 month 1 year experi brand quick servic restaur restaur fast pace servicesolid understand health safeti issuessolid understand food safetycertif licens registrationscertifi recogn safe food handl program preferredfirst aid certif preferredwhmi certif preferredmust bondableloc 995 wellington road london ontario n6e 1w4job type full-tim part-tim",
    "Core Competencies:\n": "core compet",
    "Full\n": "full",
    "skillsAbility to stand, reach, lift, bend, kneel, stoop, climb, push and pull items weighing 50 pounds or lessAbility to follow written and oral instructionsAbility to work in a cold environment as required (fridge, freezer, etc.\n": "skillsabl stand reach lift bend kneel stoop climb push pull item weigh 50 pound lessabl follow written oral instructions work cold environ requir fridg freezer etc",
    ")Ability to work varying shifts, weekends, and holidaysPerks: If this sounds like the role for you, we offer some pretty cool perks!Complimentary work swag (your Summerhill Market work shirts are provided)Awesome discount on everything we sell!Flexible scheduleBenefits for Full-Time Associates after 1 year of EmploymentWeekly payEasily accessible locationsEquity Statement: Note: The purpose of this document is to provide a general summary of essential\n": "abil work vari shift weekend holidaysperk if sound like role offer pretti cool perk complimentari work swag summerhil market work shirt provid awesom discount everyth sell flexibl schedulebenefit full-tim associ 1 year employmentweekli payeasili access locationsequ statement note the purpos document provid gener summari essenti",
    "Profit Sharing and Stock Purchase Plan\n": "profit share stock purchas plan",
    "Tuition Reimbursement\n": "tuition reimburs",
    "Ensure proper follow up and take ownership of all service related issues as they ariseUnderstand the point-of-sale computer system in a timely fashion to ensure the professional completion of all sales transactionsEnsure all store displays are kept full, and that all merchandise is to\n": "ensur proper follow take ownership servic relat issu ariseunderstand point-of-sal comput system time fashion ensur profession complet sale transactionsensur store display kept full merchandis",
    "Must be able to indepen\n": "must abl indepen",
    "J2WRXA\n": "j2wrxa",
    "skillsKnowledge of the hotel-boutique conceptLanguages: Excellent English oral and written.Work related technology: Internet, including email systems/CloudMicrosFax machine, photocopier, scannerInternet & credit card machinesWindows applications (Outlook, Word, Excel)Working hours: Shift work based on weekly schedules ( weekdays and weekends)Part-time hours: 20-40 per weekExpected start date: asapJob Types: Full-time, Part-time, PermanentSalary: $14.00-$16.00 per hourSchedule:8 hour shiftDay shiftHolidaysMonday to FridayNight shiftWeekendsCOVID-19 considerations:Front desk area has plexiglass shields, gloves and masks are providedExperience:hotel: 1 year (Preferred)Work remotely:NoCOVID-19 precaution(s):Remote interview processPersonal protective equipment provided or requiredPlastic shield at work stationsTemperature screeningsSocial distancing guidelines in placeSanitizing, disinfecting, or cleaning procedures in place\n": "skillsknowledg hotel-boutiqu conceptlanguag excel english oral written.work relat technolog internet includ email systems/cloudmicrosfax machin photocopi scannerinternet credit card machineswindow applic outlook word excel work hour shift work base weekli schedul weekday weekend part-tim hour 20-40 per weekexpect start date asapjob type full-tim part-tim permanentsalari 14.00- 16.00 per hourschedule:8 hour shiftday shiftholidaysmonday fridaynight shiftweekendscovid-19 consider front desk area plexiglass shield glove mask providedexperi hotel 1 year prefer work remot nocovid-19 precaut remot interview processperson protect equip provid requiredplast shield work stationstemperatur screeningssoci distanc guidelin placesanit disinfect clean procedur place",
    "Accommodation is available upon request for applicants with disabilities in the recruitment and assessment process and when hired.Job Types: Full-time, Part-timeSalary: From $11.70 per hourBenefits:On-site parkingSchedule:Day shiftHolidaysMonday to FridayNight shiftWeekendsCOVID-19 considerations:All customers are required to wear a mask, curbside pickup available, common surfaced as sanitized regularly.Work remotely:NoCOVID-19 precaution(s):Personal protective equipment provided or requiredTemperature screeningsSocial distancing guidelines in placeSanitizing, disinfecting, or cleaning procedures in place\n": "accommod avail upon request applic disabl recruit assess process hired.job type full-tim part-timesalari from 11.70 per hourbenefit on-sit parkingschedul day shiftholidaysmonday fridaynight shiftweekendscovid-19 consider all custom requir wear mask curbsid pickup avail common surfac sanit regularly.work remot nocovid-19 precaut person protect equip provid requiredtemperatur screeningssoci distanc guidelin placesanit disinfect clean procedur place",
    "Serve customers with a positive attitude.handle cash.stocking shelves and keeping the store neat and tidyJob Types: Full-time, Part-timeSalary: From $16.00 per hourBenefits:Dental careExtended health careSchedule:8 hour shiftExperience:sales: 1 year (Preferred)customer service: 1 year (Preferred)Licence:Smart Serve, SIR or equivalent (Preferred)Work remotely:No\n": "serv custom posit attitude.handl cash.stock shelv keep store neat tidyjob type full-tim part-timesalari from 16.00 per hourbenefit dental careextend health careschedule:8 hour shiftexperi sale 1 year prefer custom servic 1 year prefer licenc smart serv sir equival prefer work remot no",
    "skills.Working knowledge of produce quality, hygiene, safety, and food preparation.Good communication and organizational skills.Ability to work as part of a team.Basic math skills.Ability to perform all physical aspects of the job such as lifting and carrying heavy items, climbing ladders, squatting and standing for long periods of time.Available to work evenings, weekends and HolidayWhile all responses are appreciated only those being considered for interviews will be acknowledged.\n": "skills.work knowledg produc qualiti hygien safeti food preparation.good commun organiz skills.abl work part team.bas math skills.abl perform physic aspect job lift carri heavi item climb ladder squat stand long period time.avail work even weekend holidaywhil respons appreci consid interview acknowledg",
    "Établir des relations durables avec la communauté;\n": "établir de relat durabl avec la communauté",
    "Operating cash registers, managing financial transactions, and balancing drawers.\n": "oper cash regist manag financi transact balanc drawer",
    "The cashier must be bilingual, have interpersonal skills and communication skills.\n": "the cashier must bilingu interperson skill commun skill",
    "The cashier is also a salesperson, they have the responsibili\n": "the cashier also salesperson responsibili",
    "Training is offered for candidates without experience.\n": "train offer candid without experi",
    "Ability to communicate in Cantonese/Mandarin is an asset, but not required.\n": "abil commun cantonese/mandarin asset requir",
    "Please do not apply if you don't enjoy customer service.\n": "pleas appli n't enjoy custom servic",
    "No work experience required, we have amazing people to help train you to be apart of our team.Job Types: Full-time, Part-time, PermanentAdditional pay:Bonus payOvertime payBenefits:Discounted or free foodFlexible scheduleOn-site parkingStore discountSchedule:8 hour shiftDay shiftHolidaysMonday to FridayNight shiftWeekendsCOVID-19 considerations:To keep our staff safe, we have set up plexiglass at the front counter and Drive thru, as well masks are manditory, we have hand sanitizer at our drive thru station for staff to use after handling cash, as well as at our front and exit doorExperience:fast food: 1 year (Preferred)Work remotely:No\n": "no work experi requir amaz peopl help train apart team.job type full-tim part-tim permanentaddit pay bonu payovertim paybenefit discount free foodflex scheduleon-sit parkingstor discountschedule:8 hour shiftday shiftholidaysmonday fridaynight shiftweekendscovid-19 consider to keep staff safe set plexiglass front counter drive thru well mask manditori hand sanit drive thru station staff use handl cash well front exit doorexperi fast food 1 year prefer work remot no",
    "skillsAbility to work with minimal functional directionMust be able to stand for long periods of timeMust be able to lift using work safe guidelinesAvailable to work varying shifts, including weekends and eveningsPrevious retail and/or grocery experience an assetThank you for your interest, however only qualified applicants selected for interview will be contacted.At Joe's No Frills, we are committed to creating a diverse and inclusive workplace.\n": "skillsabl work minim function directionmust abl stand long period timemust abl lift use work safe guidelinesavail work vari shift includ weekend eveningsprevi retail and/or groceri experi assetthank interest howev qualifi applic select interview contacted.at joe 's no frill commit creat divers inclus workplac",
    ").· Volunteer Time Off Program.· Generous Bonus Structures.· Generous In-Store Discount.We proudly support diversity from all walks of life and support equal pay rights to both men and women.\n": ".· volunt time off program.· gener bonu structures.· gener in-stor discount.w proudli support divers walk life support equal pay right men women",
    "Food handling is an asset but training is provided.\n": "food handl asset train provid",
    "Must be able to work all shifts.\n": "must abl work shift",
    "Experience would be an asset.If you are energetic, enthusiastic and want to be part of the Askew’s team, we want to hear from you.Please forward resume to: Heather Turner, Store Manager – UptownJob Type: Part-timeSchedule:HolidaysMonday to FridayWeekendsWork remotely:No\n": "experi would asset.if energet enthusiast want part askew ’ team want hear you.pleas forward resum heather turner store manag – uptownjob type part-timeschedul holidaysmonday fridayweekendswork remot no",
    "(This process takes several months and candidates must expect not to commence work during this time) Candidates may be eligible to receive a $1000 starting bonus upon completion of this process and a 6-months probationary period.\n": "thi process take sever month candid must expect commenc work time candid may elig receiv 1000 start bonu upon complet process 6-month probationari period",
    "Must be able to commute to the Ottawa-east area which is easily accessible by bus.\n": "must abl commut ottawa-east area easili access bu",
    "(no parking is available directly on-site but parking is available within about a 10 minute walk)What we offer?\n": "park avail directli on-sit park avail within 10 minut walk what offer",
    "Someone who is reliable and enjoys a fast-paced environment.\n": "someon reliabl enjoy fast-pac environ",
    "Evening and weekend work is required.\n": "even weekend work requir",
    "Must be able to lift 30lbs.Cheers!Job Types: Full-time, Part-time\n": "must abl lift 30lbs.cheer job type full-tim part-tim",
    ").S'assurer d'avoir toujours de la marchandise dans l'aire des caisses et s'assurer que les principes de vente au détail sont appliqués de façon efficace (p.\n": ".s'assur d'avoir toujour de la marchandis dan l'air de caiss et s'assur que le princip de vent au détail sont appliqué de façon efficac p",
    "ex., étiquettes, articles bien placés, aire propre, etc.\n": "ex. étiquett articl bien placé air propr etc",
    "The customer’s needs are your priority?\n": "the custom ’ need prioriti",
    "Then apply and join our exciting team.\n": "then appli join excit team",
    "Must be able to work up to 2 closing shifts/week and alternating weekend shifts.\n": "must abl work 2 close shifts/week altern weekend shift",
    "This person must be able to multitask in a dynamic atmosphere and be able to fit in with a strong team.\n": "thi person must abl multitask dynam atmospher abl fit strong team",
    "The schedule can be flexible depending on the candidate´s needs.Job Types: Part-time, CasualSalary: From $15.20 per hourAdditional pay:TipsBenefits:Casual dressDiscounted or free foodFlexible scheduleStore discountSchedule:Day shiftMonday to FridayWeekendsCOVID-19 considerations:We promote maks wearing and still provide limited seating.\n": "the schedul flexibl depend candidate´ needs.job type part-tim casualsalari from 15.20 per houraddit pay tipsbenefit casual dressdiscount free foodflex schedulestor discountschedul day shiftmonday fridayweekendscovid-19 consider we promot mak wear still provid limit seat",
    "skills.Ability to walk, bend, and stand for extended periods.Availability to work around peak hours, including early mornings, weekends, and holidays.A polite, engaging personality.Commitment to customer satisfaction and service excellence.Willingness to work as part of a high-energy, efficient team in a fast-paced environment.Part-time hours: 30 per weekJob Types: Full-time, Part-timeSalary: $15.00 per hourAdditional pay:TipsSchedule:8 hour shiftDay shiftMonday to FridayNight shiftWeekendsLicence:Serving It Right (Required)Work remotely:No\n": "skills.abl walk bend stand extend periods.avail work around peak hour includ earli morn weekend holidays.a polit engag personality.commit custom satisfact servic excellence.willing work part high-energi effici team fast-pac environment.part-tim hour 30 per weekjob type full-tim part-timesalari 15.00 per houraddit pay tipsschedule:8 hour shiftday shiftmonday fridaynight shiftweekendslic serv it right requir work remot no",
    "skillsAbility to work with minimal functional directionMust be able to stand for long periods of timeMust be able to lift using work safe guidelinesAvailable to work varying shifts, including weekends and eveningsPrevious retail and/or grocery experience an assetThank you for your interest, however only qualified applicants selected for interview will be contacted.At Mario & Selina's No Frills, we are committed to creating a diverse and inclusive workplace.\n": "skillsabl work minim function directionmust abl stand long period timemust abl lift use work safe guidelinesavail work vari shift includ weekend eveningsprevi retail and/or groceri experi assetthank interest howev qualifi applic select interview contacted.at mario selina 's no frill commit creat divers inclus workplac",
    "skills.Willingness to learn.Prior retail experience beneficial.Willingness to continually develop professional skills and knowledge base.Ability to work co-operatively in a team atmosphere.Experience with Kitchens and Appliances beneficialJob Types: Full-time, PermanentBenefits:Dental careExtended health careVision careSchedule:8 hour shiftExperience:sales: 1 year (preferred)customer service: 1 year (preferred)\n": "skills.willing learn.prior retail experi beneficial.willing continu develop profession skill knowledg base. work co-op team atmosphere.experi kitchen applianc beneficialjob type full-tim permanentbenefit dental careextend health carevis careschedule:8 hour shiftexperi sale 1 year prefer custom servic 1 year prefer",
    "skillsWe provide full training, uniforms and a flexible schedule.\n": "skillsw provid full train uniform flexibl schedul",
    "Work in a high volume liquor store.\n": "work high volum liquor store",
    "skillsPerform all other related duties and\n": "skillsperform relat duti",
    "Employm\n": "employm",
    "Ensure quality and customer focus and maintain an atmosphere of teamwork,\n": "ensur qualiti custom focu maintain atmospher teamwork",
    "Everything is cooked fresh and served immediately.\n": "everyth cook fresh serv immedi",
    "Experience is preferred but not mandatory as we will provide training.- cooking on a Wok,-preparing ingredients- customer service duties (serving and helping customers)- cleaningK\n": "experi prefer mandatori provid training.- cook wok -prepar ingredients- custom servic duti serv help custom cleaningk",
    "Extended heath benefits available to those who qualify.Part-time hours: 10-20 per weekFull time hoursL 30-40hrsJob Types: Full-time, Part-timeSalary: $15.70-$19.00 per hourAdditional pay:Overtime payTipsBenefits:Extended health careSchedule:Day shiftMonday to FridayNight shiftWeekendsExperience:line cook: 1 year (preferred)Language:English (required)Work remotely:No\n": "extend heath benefit avail qualify.part-tim hour 10-20 per weekful time hoursl 30-40hrsjob type full-tim part-timesalari 15.70- 19.00 per houraddit pay overtim paytipsbenefit extend health careschedul day shiftmonday fridaynight shiftweekendsexperi line cook 1 year prefer languag english requir work remot no",
    "Benefit from a purchase discount program, flexible and varied schedules, competitive pay and online learning through SDMU.\n": "benefit purchas discount program flexibl vari schedul competit pay onlin learn sdmu",
    "No experience necessaryJob Type: Full-timeAdditional pay:Overtime paySchedule:8 hour shiftMonday to FridayWork remotely:No\n": "no experi necessaryjob type full-timeaddit pay overtim payschedule:8 hour shiftmonday fridaywork remot no",
    "day, evening, night, weekend and HolidayHigh school degree or related would be a plusPart-time hours: 32-40 per weekJob Types: Full-time, Part-time, PermanentSalary: From $13.50 per hourBenefits:Dental careExtended health careLife insuranceVision careSchedule:8 hour shiftDay shiftHolidaysMonday to FridayNight shiftWeekendsCOVID-19 considerations:Operating under a strict approved operational planWork remotely:No\n": "day even night weekend holidayhigh school degre relat would pluspart-tim hour 32-40 per weekjob type full-tim part-tim permanentsalari from 13.50 per hourbenefit dental careextend health carelif insurancevis careschedule:8 hour shiftday shiftholidaysmonday fridaynight shiftweekendscovid-19 consider oper strict approv oper planwork remot no",
    "INDMO\n": "indmo",
    "skills4.\n": "skills4",
    "Ability to be flexible5.\n": "abil flexible5",
    "Ability to think critically and problem solve6.\n": "abil think critic problem solve6",
    "Team player8.\n": "team player8",
    "Willingness to learn9.\n": "willing learn9",
    "Willingness to work some evenings and weekends2.\n": "willing work even weekends2",
    "Step up to the plate and help team mates4.\n": "step plate help team mates4",
    "Contribute to the growth of the store5.\n": "contribut growth store5",
    "Process customer orders and record them in the restaurant database.\n": "process custom order record restaur databas",
    "Relay customers’ orders to the kitchen staff.\n": "relay custom ’ order kitchen staff",
    "Ensure all orders are delivered to the customers in a timely manner.\n": "ensur order deliv custom time manner",
    "Place food orders in the appropriate bags and boxes.\n": "place food order appropri bag box",
    "Respond to customer inquiries, issue receipts, and record customer suggestions.\n": "respond custom inquiri issu receipt record custom suggest",
    "Checking guest in and out, providing friendly customer service at all times and basic cashier skill.Requirements:Hotel experience preferredTeam PlayerAbility to multitask in fast paced environmentMust be able to read, write and follow oral and written directions in English at a level necessary to accomplish all tasks.Job knowledgeable of surrounding areas and attractions for guest needs is appreciatedAbility to stand and or walk for hours at a timeSecond language is an asset; being fluent in English is a MUST!\n": "check guest provid friendli custom servic time basic cashier skill.requir hotel experi preferredteam player multitask fast pace environmentmust abl read write follow oral written direct english level necessari accomplish tasks.job knowledg surround area attract guest need appreciated stand walk hour timesecond languag asset fluent english must",
    "Training will be provided for Health and Safety, as well as specialty knowledge.\n": "train provid health safeti well specialti knowledg",
    "* Ability to serve customers in a professional manner and to inspire their confidence and trust.\n": "abil serv custom profession manner inspir confid trust",
    "* Ability to lead and manage a team to achieve common goals in a fast-paced environment.\n": "abil lead manag team achiev common goal fast-pac environ",
    "* Ability to motivate and coach others as well as provide feedback.\n": "abil motiv coach other well provid feedback",
    "* Ability to plan, organize, delegate and follow up on team's activities and projects.\n": "abil plan organ deleg follow team 's activ project",
    "* Ability to find solutions to problems and make decisions.Must have open and flexible availability.If you are interested in joining our team please email in a resume and any questions you may have!Job Types: Full-time, PermanentBenefits:Dental careEmployee assistance programExtended health careLife insuranceOn-site parkingProfit sharingStore discountSchedule:Day shiftNight shiftWeekendsExperience:Retail Management: 3 years (Required)COVID-19 precaution(s):Personal protective equipment provided or requiredPlastic shield at work stationsSocial distancing guidelines in placeSanitizing, disinfecting, or cleaning procedures in place\n": "abil find solut problem make decisions.must open flexibl availability.if interest join team pleas email resum question may job type full-tim permanentbenefit dental careemploye assist programextend health carelif insuranceon-sit parkingprofit sharingstor discountschedul day shiftnight shiftweekendsexperi retail manag 3 year requir covid-19 precaut person protect equip provid requiredplast shield work stationssoci distanc guidelin placesanit disinfect clean procedur place",
    "Offer outstanding customer service to enhance the shopping experience\n": "offer outstand custom servic enhanc shop experi",
    "Clean your workplace (carpet and cash counter)\n": "clean workplac carpet cash counter",
    "Be organized-minded\n": "be organized-mind",
    "Collaboration and team mindset\n": "collabor team mindset",
    "Capability of a forklift driver is an asset\n": "capabl forklift driver asset",
    "Company established since 1914 and growing at a rapid pace\n": "compani establish sinc 1914 grow rapid pace",
    "This position requires a valid BC driver’s license as\n": "thi posit requir valid bc driver ’ licens",
    "skillsMust adhere to brand standards, food safety and health and safety policiesAble to work under pressure and at a fast paceWHY JOIN OUR TEAM!Unparalleled Growth ProspectsAt Harvey’s, we genuinely care about our people!\n": "skillsmust adher brand standard food safeti health safeti policies work pressur fast pacewhi join our team unparallel growth prospectsat harvey ’ genuin care peopl",
    "No matter where you come from or where you are heading in your career, there is a place for you to grow at Circle K / Couche-Tard.\n": "no matter come head career place grow circl k couche-tard",
    "The shift supervisor directly assists the manager and assistant manager in their daily tasks and is responsible for their teams performance on their shift.\n": "the shift supervisor directli assist manag assist manag daili task respons team perform shift",
    "Keep the store looking crisp, full and inviting.Team Player - Commitment to going above and beyond.Job Type: Part-timeSalary: $15.00 per hourSchedule:Day shiftHolidaysMonday to FridayNight shiftWeekendsExperience:Retail: 1 year (Preferred)Cash : 1 year (Preferred)\n": "keep store look crisp full inviting.team player commit go beyond.job type part-timesalari 15.00 per hourschedul day shiftholidaysmonday fridaynight shiftweekendsexperi retail 1 year prefer cash 1 year prefer",
    "Increased cleaning and sanitation measures in place.Work remotely:No\n": "increas clean sanit measur place.work remot no",
    "skills· Proven ability to achieve sales targets· Excellent communication skills (written and verbal) and numeracy· Extensive knowledge in computer parts and accessories, and consumer electronics· Physical ability to stand for extended periods of time, and to move and handle boxes of merchandise which entails lifting· Ability to work flexible shifts, including days, evenings, weekends and holidays as neededWe thank all interested candidates, however, only those under consideration will be contacted.Canada Computers is committed to creating a diverse environment and is proud to be an equal opportunity employer.\n": "skills· proven abil achiev sale targets· excel commun skill written verbal numeracy· extens knowledg comput part accessori consum electronics· physic abil stand extend period time move handl box merchandis entail lifting· abil work flexibl shift includ day even weekend holiday neededw thank interest candid howev consider contacted.canada comput commit creat divers environ proud equal opportun employ",
    "skillsWork well autonomously and in a teamPhysical Requirements: Ability to stand for extended periods and climb a ladder;Move, lift and handle boxes of merchandise and fixtures throughout the store (weighing up to 30 pounds).Availability Requirements: Days, evenings and weekends.LocationWe have stores in Kitchener (Manitou Drive), and St Jacobs (Outlet Mall and downtown).\n": "skillswork well autonom teamphys requir abil stand extend period climb ladder move lift handl box merchandis fixtur throughout store weigh 30 pound .avail requir day even weekends.locationw store kitchen manit drive st jacob outlet mall downtown",
    "The applicant will do shifts in all of the stores.This job description is not intended to be all-inclusive.\n": "the applic shift stores.thi job descript intend all-inclus",
    "This job entails the ability to lift 17kg (38 pounds), unloading, stocking, general store cleaning, customer service and MUST be willing to work night shifts and weekends.\n": "thi job entail abil lift 17kg 38 pound unload stock gener store clean custom servic must will work night shift weekend",
    "Welcome to Plantlife Cannabis!\n": "welcom plantlif cannabi",
    "IND1\n": "ind1",
    "Pension Plan Benefits\n": "pension plan benefit",
    "Ability to work independently in a fast-paced environment\n": "abil work independ fast-pac environ",
    "Experience as a Retail Cashier is an asset\n": "experi retail cashier asset",
    "Experience in body jewellery is not required.\n": "experi bodi jewelleri requir",
    "Accept cash payments\n": "accept cash payment",
    "Resolve problems\n": "resolv problem",
    "Multi-Tasker2.\n": "multi-tasker2",
    "offer exceptional customer service3.\n": "offer except custom service3",
    "Fast-LearnerIf you consider yourself meet above requirement.\n": "fast-learnerif consid meet requir",
    "*Do Not Call In To Store**Selected Candidate will be contacted via email*Job Types: Full-time, PermanentSalary: $15.00 per hourBenefits:Discounted or free foodStore discountSchedule:8 hour shiftDay shiftHolidaysMonday to FridayNight shiftWeekend availabilityLanguage:Chinese/Vietnamese/Tagalog (required)Shift availability:Day Shift (required)Night Shift (preferred)\n": "do not call in to store select candid contact via email job type full-tim permanentsalari 15.00 per hourbenefit discount free foodstor discountschedule:8 hour shiftday shiftholidaysmonday fridaynight shiftweekend availabilitylanguag chinese/vietnamese/tagalog requir shift avail day shift requir night shift prefer",
    "Scholarship Opportunities.\n": "scholarship opportun",
    "The brand is all about people having fun, enjoying life, helping others succeed and treating people with respect.\n": "the brand peopl fun enjoy life help other succeed treat peopl respect",
    "Training and development\n": "train develop",
    "Work towards a goal with an emphasis on service quality, customer satisfaction and financial performance.\n": "work toward goal emphasi servic qualiti custom satisfact financi perform",
    "Perform a variety of operational activities as assigned by the Store Manager or the Manager on Duty.\n": "perform varieti oper activ assign store manag manag duti",
    "Ability to work a flexible schedule to meet the needs of the business, which may require weekdays, evenings, weekends and holidays.\n": "abil work flexibl schedul meet need busi may requir weekday even weekend holiday",
    "skills.Maintain proper attendanceAll other duties assigned by the managementJob Types: Full-time, PermanentSalary: $15.50-$16.00 per hourBenefits:Extended health careSchedule:8 hour shiftExperience:customer service: 1 year (preferred)Work remotely:No\n": "skills.maintain proper attendanceal duti assign managementjob type full-tim permanentsalari 15.50- 16.00 per hourbenefit extend health careschedule:8 hour shiftexperi custom servic 1 year prefer work remot no",
    "skillsRetail or customer service experience an assetSome perks of working with us include an amazing clothing discount, an excellent training program and flexible scheduling!Please email your resume in PDF format and include in the subject line the location to which you are applying, or you can drop your resumes off in person to the below address:The Pen CentreUnit 98B, 221 Glendale AveSt Catharines, ONL2T 2K9Eclipse would like to thank all applicants for their interest, however, only those candidates selected for an interview will be contacted.Eclipse is an equal opportunity employer, and as such, does not discriminate in hiring or terms and conditions of employment on the basis of an individual’s race, ancestry, color, place of origin, religion, gender, gender identi\n": "skillsretail custom servic experi assetsom perk work us includ amaz cloth discount excel train program flexibl schedul pleas email resum pdf format includ subject line locat appli drop resum person address the pen centreunit 98b 221 glendal avest catharin onl2t 2k9eclips would like thank applic interest howev candid select interview contacted.eclips equal opportun employ discrimin hire term condit employ basi individu ’ race ancestri color place origin religion gender gender identi",
    "This position requires the successful completion of a criminal (and credit) background check\n": "thi posit requir success complet crimin credit background check",
    "The use and disclosure of the collected information is for the sole purpose of job search and placement activities for Shaw Communications.\n": "the use disclosur collect inform sole purpos job search placement activ shaw commun",
    "The information is subject to Personal Information Protection and Electronic Documents Act.\n": "the inform subject person inform protect electron document act",
    "The information will be retained and when disposed of, it is done so in a secure manner.\n": "the inform retain dispos done secur manner",
    "Send us your resume!Only selected candidates will be contacted.Bouclair is committed to the employment equity principle.The masculine is used without discrimination and solely to lighten the text.Who we are.Based in Montreal, Bouclair is a lifestyle brand with a unique offering of in-house designed home fashion décor and furniture.\n": "send us resum onli select candid contacted.bouclair commit employ equiti principle.th masculin use without discrimin sole lighten text.who are.bas montreal bouclair lifestyl brand uniqu offer in-hous design home fashion décor furnitur",
    "Leverage all customer services to build further loyalty by capturing every customer e-mail to build Benefeet database and offering GEOX@Home where necessary\n": "leverag custom servic build loyalti captur everi custom e-mail build benefeet databas offer geox home necessari",
    "POSITION REQUIREMENTS\n": "posit requir",
    "Send your resume now or drop by our location Mont Tacos Lasalle 7773 Newman, Montreal, Quebec H8N.————————————————————————————————————————Mont Tacos Lasalle 7773 Newman, Montreal, Quebec H8N 1X7.NOUS RECRUTONS MAINTENANTJoignez-vous à notre équipe Mont Tacos Lasalle.Des postes à temps plein ou à temps partiel sont disponibles.Aucune expérience requis.Nous sommes à la recherche de personnes sérieuses pour compléter notre équipe.\n": "send resum drop locat mont taco lasal 7773 newman montreal quebec h8n.————————————————————————————————————————mont taco lasal 7773 newman montreal quebec h8n 1x7.nou recruton maintenantjoignez-v à notr équip mont taco lasalle.d post à temp plein ou à temp partiel sont disponibles.aucun expérienc requis.n somm à la recherch de personn sérieus pour compléter notr équip",
    "skills.Must be self motivated and have the willingness to learn and excel.\n": "skills.must self motiv willing learn excel",
    "The gas station is open 7 days a week.Knowledge of operating a cash register.Part-time hours: 15-20 per weekExpected start date: 2021-11-22Job Type: Part-timeSalary: $13.50-$14.35 per hourSchedule:Monday to FridayNight shiftWeekend availabilityWork remotely:No\n": "the ga station open 7 day week.knowledg oper cash register.part-tim hour 15-20 per weekexpect start date 2021-11-22job type part-timesalari 13.50- 14.35 per hourschedul monday fridaynight shiftweekend availabilitywork remot no",
    "Someone who enjoys a fast paced working environment and who is able to multi-taskWork experience is preferable but not necessary.Job Types: Full-time, Part-timeAdditional pay:TipsSchedule:8 hour shiftDay shiftMonday to FridayNight shiftWeekend availabilityCOVID-19 considerations:Masks requiredWork remotely:No\n": "someon enjoy fast pace work environ abl multi-taskwork experi prefer necessary.job type full-tim part-timeaddit pay tipsschedule:8 hour shiftday shiftmonday fridaynight shiftweekend availabilitycovid-19 consider mask requiredwork remot no",
    "Join the thousands of innovators, advocates and forces who are making an impact every day at one of the biggest footwear brands in the world.\n": "join thousand innov advoc forc make impact everi day one biggest footwear brand world",
    "PRODUCT\n": "product",
    "OPERATIONS\n": "oper",
    "Experi\n": "experi",
    "Do you recognize yourself in this job description?\n": "do recogn job descript",
    "Company discount on merchandise ;\n": "compani discount merchandis",
    "#NB\n": "nb",
    "A knowledge of Cannabis is a must as well as providing a background check and a Smart Choices Cannabis certificate.\n": "a knowledg cannabi must well provid background check smart choic cannabi certif",
    "This certificate can be found at SmartChoi\n": "thi certif found smartchoi",
    "Store discount\n": "store discount",
    "Need someone that is very positive and likes people.\n": "need someon posit like peopl",
    "Must be available Saturday and Sunday.\n": "must avail saturday sunday",
    "Everyone does everything here, so you will also be learning cash, merchandising and cleaning.\n": "everyon everyth also learn cash merchandis clean",
    "Must be able to do cash as well as stock.\n": "must abl cash well stock",
    "Ensure compliance with all Chartwells and Compass Group operating policies and procedures and promotional\n": "ensur complianc chartwel compass group oper polici procedur promot",
    "No phone calls, please.Location: 1900 Heritage Drive SW,Calgary,AB T2V 2X3, Calgary\n": "no phone call please.loc 1900 heritag drive sw calgari ab t2v 2x3 calgari",
    "Pleasantry when answering the phone and assisting customers with retail shopping requests.Assists with stocking and facing the shelves, inputting deliveries and end of day cleaning.If you are capable of working in a very fast paced environment and if you prefer to work in a team environment this is the job for you!Job Types: Full-time, PermanentSalary: $31,200.00-$47,118.00 per yearAdditional pay:Bonus payBenefits:Company eventsOn-site parkingPaid time offStore discountSchedule:8 hour shiftWeekend availabilityExperience:sales: 1 year (preferred)customer service: 1 year (preferred)Shift availability:Day Shift (preferred)Work remotely:No\n": "pleasantri answer phone assist custom retail shop requests.assist stock face shelv input deliveri end day cleaning.if capabl work fast pace environ prefer work team environ job job type full-tim permanentsalari 31,200.00- 47,118.00 per yearaddit pay bonu paybenefit compani eventson-sit parkingpaid time offstor discountschedule:8 hour shiftweekend availabilityexperi sale 1 year prefer custom servic 1 year prefer shift avail day shift prefer work remot no",
    "requ\n": "requ",
    "LOOKING FOR EXPERIENCED PERSONNEL FOR GAS STATION CASHIER JOB FOR WEEKEND AFTERNOON SHIFT.Job Types: Full-time, Part-timeSalary: $14.35-$14.36 per hourSchedule:10 hour shift8 hour shiftEducation:Secondary School (preferred)Experience:customer service: 1 year (preferred)\n": "look for experienc personnel for ga station cashier job for weekend afternoon shift.job type full-tim part-timesalari 14.35- 14.36 per hourschedule:10 hour shift8 hour shifteduc secondari school prefer experi custom servic 1 year prefer",
    "No experience required for this but we need some experience for the tailor.Job Types: Full-time, Part-timeSalary: From $13.50 per hourSchedule:Monday to FridayWeekend availabilityWork remotely:No\n": "no experi requir need experi tailor.job type full-tim part-timesalari from 13.50 per hourschedul monday fridayweekend availabilitywork remot no",
    "Education, Certifications and Licenses\n": "educ certif licens",
    "LANGUAGE REQUIREMENTS\n": "languag requir",
    "Writing: None\n": "write none",
    "An environment that fosters\n": "an environ foster",
    "skills.Experience:sales: 1 year (preferred)customer service: 1 year (preferred)Job Types: Full-time, Part-timeAdditional pay:Overtime payBenefits:Flexible scheduleOn-site parkingStore discountSchedule:8 hour shiftDay shiftHolidaysMonday to FridayWeekend availability\n": "skills.experi sale 1 year prefer custom servic 1 year prefer job type full-tim part-timeaddit pay overtim paybenefit flexibl scheduleon-sit parkingstor discountschedule:8 hour shiftday shiftholidaysmonday fridayweekend avail",
    "Show a thorough understanding of Levi Strauss & Company’s history and heritage\n": "show thorough understand levi strauss compani ’ histori heritag",
    "Comply with Levi’s® Stores cash handling guidelines\n": "compli levi ’ s® store cash handl guidelin",
    "Comply with store security, safety, and loss prevention programs\n": "compli store secur safeti loss prevent program",
    "Assist in pricing of merchandise as needed\n": "assist price merchandis need",
    "Assist in physical inventory and cycle counts\n": "assist physic inventori cycl count",
    "Assist in maintaining store appearance in accordance with Levi’s® Stores visual presentation standards and general housekeeping procedures\n": "assist maintain store appear accord levi ’ s® store visual present standard gener housekeep procedur",
    "Contribute to sales and margin goals in the services area of the store, including print, digital marketing, shipping and tech services and identify improvement opportunities\n": "contribut sale margin goal servic area store includ print digit market ship tech servic identifi improv opportun",
    "Manage correspondence with customers through digital, phone and in person channels\n": "manag correspond custom digit phone person channel",
    "All training will be done on site.\n": "all train done site",
    "skillsYou’re up for learning new things and willing to jump right in and get your hands dirtyYou’re ridiculously reliable, incredibly responsible and always punctualYou’re available to work evenings and weekendsBonus points for having: At least 6 months experience working with a point of sale systemAt least 6 months of cash handling experienceContract length: 2.5 monthsPart-time hours: 20-30 per weekJob Types: Part-time, TemporaryBenefits:Flexible scheduleOn-site parkingStore discountSchedule:HolidaysWeekend availabilityExperience:Cashiering: 1 year (preferred)customer service: 1 year (preferred)Work remotely:No\n": "skillsyou ’ learn new thing will jump right get hand dirtyy ’ ridicul reliabl incred respons alway punctualy ’ avail work even weekendsbonu point at least 6 month experi work point sale systemat least 6 month cash handl experiencecontract length 2.5 monthspart-tim hour 20-30 per weekjob type part-tim temporarybenefit flexibl scheduleon-sit parkingstor discountschedul holidaysweekend availabilityexperi cashier 1 year prefer custom servic 1 year prefer work remot no",
    "A Clearance requires the absence of any criminal charges or convictions related to this position.\n": "a clearanc requir absenc crimin charg convict relat posit",
    "Business Unit/Department: Arts, Culture and Community Services (1200)\n": "busi unit/depart art cultur commun servic 1200",
    "Must be available to work flexible shifts which include day, nights and weekends\n": "must avail work flexibl shift includ day night weekend",
    "LUMBER/BUILDING MATERIALS ASSOCIATE\n": "lumber/build materi associ",
    "*Parking gratuit sur place*Bus a proximitéType d'emploi : Temps Plein, Temps PartielSalaire : à partir de 13,50$ par heureAvantages :Horaires flexiblesNourriture à Prix Réduit ou GratuiteSta\n": "park gratuit sur place bu proximitétyp d'emploi temp plein temp partielsalair à partir de 13,50 par heureavantag horair flexiblesnourritur à prix réduit ou gratuitesta",
    "G.T.\n": "g.t",
    "Take phone-in orders\n": "take phone-in order",
    "Process payments (cash & card)\n": "process payment cash card",
    "Be a team player by assisting co-workers as needed\n": "be team player assist co-work need",
    "Passionate about providing only the best guest experiences\n": "passion provid best guest experi",
    "Ability to maintain composure in a fast-paced environment\n": "abil maintain composur fast-pac environ",
    "Ability to stand for long periods of time and work in a hot environment\n": "abil stand long period time work hot environ",
    "Possess a safe food handlers certificate\n": "possess safe food handler certif",
    "The chance to be part of a close knit team\n": "the chanc part close knit team",
    "This position is eligible for an annual retention bonus of up to $1130\n": "thi posit elig annual retent bonu 1130",
    "Schedule: We are open 7 days a week from 9 a.m. to 5 p.m\n": "schedul we open 7 day week 9 a.m. 5 p.m",
    "Ability to work indoors and outdoors.\n": "abil work indoor outdoor",
    "Insurance premiums covered 50% by employer;\n": "insur premium cover 50 employ",
    "Overtime at time-and-a-half after 44 hours;\n": "overtim time-and-a-half 44 hour",
    "Employee discounts;\n": "employe discount",
    "Branded uniform provided.\n": "brand uniform provid",
    "Experience with understanding retail operation concepts such as maintaining to store standards, cash handling, and merchandise presentation.\n": "experi understand retail oper concept maintain store standard cash handl merchandis present",
    "Self-starter and uses good judgment in all situations.\n": "self-start use good judgment situat",
    "Be Self-motivated and eager to learn.Be a team player.\n": "be self-motiv eager learn.b team player",
    "Proof of vaccination is required for entry into our Company Premises unless an exemption is required by law.\n": "proof vaccin requir entri compani premis unless exempt requir law",
    "Proof of full vaccination or undertaking rapid testing twice a week is a condition of employment for successful candidates.\n": "proof full vaccin undertak rapid test twice week condit employ success candid",
    "Apply for this job if you:Have a ready smile and a warm personalityHave a passion for guest service and creating exceptional guest experiencesEnjoy working in a fast-paced environmentHave excellent communication skillsEnjoy learning new thingsAre available to work 20-40 hours/week.\n": "appli job have readi smile warm personalityhav passion guest servic creat except guest experiencesenjoy work fast-pac environmenthav excel commun skillsenjoy learn new thingsar avail work 20-40 hours/week",
    "stock refrigerators, cupboards\n": "stock refriger cupboard",
    "The candidate will be required to serve customers from our deli case.\n": "the candid requir serv custom deli case",
    "Must be flexible to work variety of scheduled shifts, according to the mall hours.Mall hours: Mon-Friday 10-8 Saturday 10-6, Sunday 12-5IN-PERSON INTERVIEW WILL BE REQUIREDExperience with natural vitamins and other supplements on the market definitely an asset!\n": "must flexibl work varieti schedul shift accord mall hours.mal hour mon-friday 10-8 saturday 10-6 sunday 12-5in-person interview will be requiredexperi natur vitamin supplement market definit asset",
    "List the days and times you are able to work.Education:Secondary School (preferred)Experience:Cash handling: 1 year (preferred)customer service: 1 year (preferred)Work remotely:No\n": "list day time abl work.educ secondari school prefer experi cash handl 1 year prefer custom servic 1 year prefer work remot no",
    "This position is based out of the North Shore Liquor Store, though it may require on some occasions to travel and work at other locations as business needs arise\n": "thi posit base north shore liquor store though may requir occas travel work locat busi need aris",
    "Process cash desk operations with engagement, efficiency, and accuracy\n": "process cash desk oper engag effici accuraci",
    "Participate in stock room set-up and organization\n": "particip stock room set-up organ",
    "Ensure the right quantity of stock is in the right place at the right time\n": "ensur right quantiti stock right place right time",
    "d9gCJ1dtt0\n": "d9gcj1dtt0",
    "Passionate about technology, you continuously grow your knowledge by demonstrating curiosity by asking questions and committing to ongoing self-development.\n": "passion technolog continu grow knowledg demonstr curios ask question commit ongo self-develop",
    "Each day will be fast-paced, challenging, rewarding and meaningful.\n": "each day fast-pac challeng reward meaning",
    "Stay updated through the various internal communication channels (mobile app, intranet, bulletin boards, etc).\n": "stay updat variou intern commun channel mobil app intranet bulletin board etc",
    "Technology savvy\n": "technolog savvi",
    "Capacity to work independently and seek out assistance as required\n": "capac work independ seek assist requir",
    "Location: 8989 South Trail Safeway\n": "locat 8989 south trail safeway",
    "Ontario\n": "ontario",
    "Position will be primarily as a cashier and a sales associate.\n": "posit primarili cashier sale associ",
    "Must be able to stand for long periods of time,\n": "must abl stand long period time",
    "Y or NExperience:customer service: 2 years (prefer\n": "y nexperi custom servic 2 year prefer",
    "eligibility of all prospective participants prior to the start of the work experience opportunity.\n": "elig prospect particip prior start work experi opportun",
    " Assist with all aspects of Thrift Shop operations including:\n": "assist aspect thrift shop oper includ",
    "o Dusting, cleaning, organizing\n": "dust clean organ",
    " Ensure COVID-19 safety protocols are in place for the safety of volunteers, customers,\n": "ensur covid-19 safeti protocol place safeti volunt custom",
    "Make a Great Sub!\n": "make great sub",
    "Cashier3.\n": "cashier3",
    "Maintain a Friendly and Professional Environment at Work.We will train all qualified candidates.This is not a CASH job.Shifts AvailableDay Shift From 7-7Overnight From 10-7Applicants that have an Open Availability will be prioritized.Please write your Availability.This is not a CASH JOB.Job Types: Full-time, Part-time, PermanentSalary: From $14.35 per hourAdditional pay:TipsBenefits:Discounted or free foodSchedule:Day shiftMonday to FridayNight shiftWeekend availabilityWork remotely:No\n": "maintain friendli profession environ work.w train qualifi candidates.thi cash job.shift availableday shift from 7-7overnight from 10-7applic open avail prioritized.pleas write availability.thi cash job.job type full-tim part-tim permanentsalari from 14.35 per houraddit pay tipsbenefit discount free foodschedul day shiftmonday fridaynight shiftweekend availabilitywork remot no",
    "skillsAbility to stand for long periods of timePrior retail experience is an assetMust be willing to work open to close, weekends and evening shiftsMust be able to lift 25+ lbsMust be at least 16 years of ageBenefits: a 200$ signing bonus!\n": "skillsabl stand long period timeprior retail experi assetmust will work open close weekend even shiftsmust abl lift 25+ lbsmust least 16 year agebenefit 200 sign bonu",
    "Ability to Supervise\n": "abil supervis",
    "Must be available for evenings, weekends and day shifts.\n": "must avail even weekend day shift",
    "Team members are united by values and proud of the reputation we are building together.\n": "team member unit valu proud reput build togeth",
    "Every day is a professional development d\n": "everi day profession develop",
    "Pursuant to the San Francisco Fair Chance Ordinance, we will consider qualified applicants with arrest and conviction records for employment.Disability AccommodationTory Burch is committed to providing reasonable accommodations to applicants and employees with disabilities.\n": "pursuant san francisco fair chanc ordin consid qualifi applic arrest convict record employment.dis accommodationtori burch commit provid reason accommod applic employe disabl",
    "RESPONSIBILITIES:\n": "respons",
    "Opening and Closing of Cash points within the store.\n": "open close cash point within store",
    "Supervision and training of cashier staff.\n": "supervis train cashier staff",
    "Ensure that customers are correctly charged and take payment in accordance with established pr\n": "ensur custom correctli charg take payment accord establish pr",
    "Vacation\n": "vacat",
    "Ensure that customers are correctly charged and take payment in accordance with esta\n": "ensur custom correctli charg take payment accord esta",
    "Ability to multitask\n": "abil multitask",
    "Innovation for display and design presentation,\n": "innov display design present",
    "Need a challenge?\n": "need challeng",
    "Experience not necessary.This job consists of standing, lifting, walking and cleaning.\n": "experi necessary.thi job consist stand lift walk clean",
    "Take customers orders, Opening and closing stuff including sweep mop, Baking goods etc.Job Types: Full-time, Part-timeSalary: From $15.00 per hourAdditional pay:Bonus payBenefits:Discounted or free foodFlexible scheduleOn-site parkingSchedule:10 hour shift12 hour shift8 hour shiftDay shiftMonday to FridayWeekend availabilityWork remotely:No\n": "take custom order open close stuff includ sweep mop bake good etc.job type full-tim part-timesalari from 15.00 per houraddit pay bonu paybenefit discount free foodflex scheduleon-sit parkingschedule:10 hour shift12 hour shift8 hour shiftday shiftmonday fridayweekend availabilitywork remot no",
    "Join our teamYour job would require you to serve and interact with customers, handle cash, serve lottery tickets/cigarettes/cigars and packaged food and drinks.\n": "join teamyour job would requir serv interact custom handl cash serv lotteri tickets/cigarettes/cigar packag food drink",
    "Home electronics\n": "home electron",
    "Must be able to work independently as well as part of a team.\n": "must abl work independ well part team",
    "A passion for gardening & retail - you will be the role model for truly outstanding & memorable guest experience\n": "a passion garden retail role model truli outstand memor guest experi",
    "* The masculine generic is used in this text only for the purpose of lightening the form and making it easier to read.\n": "the masculin gener use text purpos lighten form make easier read",
    "Must be available during the day as our hours are 8am-3pm daily.Job Type: Part-timeAdditional pay:TipsSchedule:Day shiftWeekend availabilityWork remotely:No\n": "must avail day hour 8am-3pm daily.job type part-timeaddit pay tipsschedul day shiftweekend availabilitywork remot no",
    "All staff wear masks in the store.\n": "all staff wear mask store",
    "This role will be responsible of being an ambassador of the Nespresso Brand at the Boutique and deliver the highest possible customer service through every interaction in keeping with our premium image and positioning.A day in the life of a Coffee SpecialistAs a Coffee Specialist you will be working on sales and customer service.Your Key Activities and Job Responsibilities will include the following:Achieve personal and common sales and service level targets;Welcome the Boutique clientele and identify their needs;Ensure that the Boutique is clean (well-ordered, correct equipment, properly presented);Work in shifts and fulfil ones role and expectations.\n": "thi role respons ambassador nespresso brand boutiqu deliv highest possibl custom servic everi interact keep premium imag positioning.a day life coffe specialista coffe specialist work sale custom service.your key activ job respons includ follow achiev person common sale servic level target welcom boutiqu clientel identifi need ensur boutiqu clean well-ord correct equip properli present work shift fulfil one role expect",
    "Requirement:\n": "requir",
    "skillsAbility to perform heavy lifting on a regular basis (30 + pounds)Basic computer skills with knowledge of web-based applicationsUnderstanding of volunteer management and renovation and building materials are considered assetsYour Future at Habitat for Humanity GTA AwaitsIf you are ready to make a meaningful impact and become a part of our team, please submit your resume to this posting!Applicants must be eligible to work in Canada throughout the duration of their employment with Habitat for Humanity GTA.\n": "skillsabl perform heavi lift regular basi 30 pound basic comput skill knowledg web-bas applicationsunderstand volunt manag renov build materi consid assetsyour futur habitat human gta awaitsif readi make meaning impact becom part team pleas submit resum post applic must elig work canada throughout durat employ habitat human gta",
    "Please inform us should accommodation be required at any point during the recruitment and selection process.As part of our selection process, the successful candidate must receive clearance by a police background check.\n": "pleas inform us accommod requir point recruit select process.a part select process success candid must receiv clearanc polic background check",
    "Employment will be contingent on proof of vaccination.We thank all applicants for their interest in Habitat for Humanity GTA, however only those selected for an interview will be contacted.Job Types: Part-time, Permanent\n": "employ conting proof vaccination.w thank applic interest habitat human gta howev select interview contacted.job type part-tim perman",
    "The room for growth with Insta Pawn is phenomenal.\n": "the room growth insta pawn phenomen",
    "Process loans, sales, layaway's and redemption's.\n": "process loan sale layaway 's redempt 's",
    "The ability to source outside sales through online marketplaces.\n": "the abil sourc outsid sale onlin marketplac",
    "Speed and accuracy is a big part of the job.\n": "speed accuraci big part job",
    "Uniform provided at no charge.\n": "uniform provid charg",
    "Company:Greenbank Plaza is location right on intersection of Hwy 12 and Hwy 47 near Greenbank, ON.\n": "compani greenbank plaza locat right intersect hwi 12 hwi 47 near greenbank on",
    "Must be at least 18 years old\n": "must least 18 year old",
    "Paid time off (after 25 hours/week average)\n": "paid time 25 hours/week averag",
    "Discounted shift meals\n": "discount shift meal",
    "The health and wellbeing of our staff, managers and guests is always our top priority.\n": "the health wellb staff manag guest alway top prioriti",
    "..\n": "..",
    "Join our positive, warm environment where we encourage and coach each other through our various career paths.\n": "join posit warm environ encourag coach variou career path",
    "Scheduling service appointments for client vehicles in a courteous and ef\n": "schedul servic appoint client vehicl courteou ef",
    "This position is based at the Ladner Gas Bar, though it may require on occasion to travel and work at other locations as business needs arise\n": "thi posit base ladner ga bar though may requir occas travel work locat busi need aris",
    "Take customers’ orders and process payments (by phone or in person)\n": "take custom ’ order process payment phone person",
    "Be familiar with the Rail menu and daily specials\n": "be familiar rail menu daili special",
    "Confirm with online tablet (delivery service) when an order is ready for pick up\n": "confirm onlin tablet deliveri servic order readi pick",
    "Maintain a clean and organized take-out area\n": "maintain clean organ take-out area",
    "Balance your cash at the end of each shift\n": "balanc cash end shift",
    "Must be bilingual (English and French) and 18 years or older\n": "must bilingu english french 18 year older",
    "Ability to multitask and remain calm and professional in a fast-paced environment\n": "abil multitask remain calm profession fast-pac environ",
    "Ability to work unsupervised in a busy env\n": "abil work unsupervis busi env",
    "Travel Requirements: [[zero]]\n": "travel requir zero",
    "Location: [[4830]]\n": "locat 4830",
    "B\n": "b",
    "Ability to work varied hours/days as business dictates\n": "abil work vari hours/day busi dictat",
    "Communication Skills.\n": "commun skill",
    "Ability to work under minimal supervision with computerized systems.\n": "abil work minim supervis computer system",
    "Experience in a similar role, in a Canadian Tire store or Automotive Service Centre, is considered an asset.\n": "experi similar role canadian tire store automot servic centr consid asset",
    "Take food and drink orders and receive payment from customers.\n": "take food drink order receiv payment custom",
    "Read food order slips or receive verbal instructions as to food required by patron, and prepare and cook food according to instruction\n": "read food order slip receiv verbal instruct food requir patron prepar cook food accord instruct",
    "Must be available for Black Friday and Christmas / Boxing Week\n": "must avail black friday christma box week",
    "skillsRetail or customer service experience an assetSome perks of working with us include an amazing clothing discount, an excellent training program and flexible scheduling!Please email your resume in PDF format and include in the subject line the location to which you are applying, or you can drop your resumes off in person to the below address:Place Bathurst Mall1300 St. Peter AvenueBathurst, NBE2A 3A6Eclipse would like to thank all applicants for their interest, however, only those candidates selected for an interview will be contacted.Eclipse is an equal opportunity employer, and as such, does not discriminate in hiring or terms and conditions of employment on the basis of an individual’s race, ancestry, color, place of origin, religion, gender, gender identity, citize\n": "skillsretail custom servic experi assetsom perk work us includ amaz cloth discount excel train program flexibl schedul pleas email resum pdf format includ subject line locat appli drop resum person address place bathurst mall1300 st. peter avenuebathurst nbe2a 3a6eclips would like thank applic interest howev candid select interview contacted.eclips equal opportun employ discrimin hire term condit employ basi individu ’ race ancestri color place origin religion gender gender ident citiz",
    "BS\n": "bs",
    "Experience with animals preferred.Job Types: Part-time, PermanentSalary: $14.35 per hourBenefits:Store discountCOVID-19 considerations:Customers are required to wear masks.\n": "experi anim preferred.job type part-tim permanentsalari 14.35 per hourbenefit store discountcovid-19 consider custom requir wear mask",
    "Experience in fast food would be an asset.Duties would include: Serving customers, preparing orders, maintaining cleanliness, daily prep.You can be part of the changing face of fast food:- Serve simple, great tasting food, farmed with care- Be part of a great working climate- Positively impact the environment by reducing landfill waste- Benefit from a work schedule that meets your needsApply now.\n": "experi fast food would asset.duti would includ serv custom prepar order maintain cleanli daili prep.you part chang face fast food serv simpl great tast food farm care- be part great work climate- posit impact environ reduc landfil waste- benefit work schedul meet needsappli",
    "This position does include free meals while working, off shift discounts and tips.\n": "thi posit includ free meal work shift discount tip",
    "Please reach out if you are interested and available to start soon!Expected start date: 2021-11-15Job Types: Full-time, PermanentSalary: $12.75-$13.00 per hourAdditional pay:TipsBenefits:Discounted or free foodOn-site parkingStore discountSchedule:Day shiftMonday to FridayLanguage:English (required)Shift availability:Day Shift (required)Night Shift (preferred)\n": "pleas reach interest avail start soon expect start date 2021-11-15job type full-tim permanentsalari 12.75- 13.00 per houraddit pay tipsbenefit discount free foodon-sit parkingstor discountschedul day shiftmonday fridaylanguag english requir shift avail day shift requir night shift prefer",
    "Ability to work in steel toe shoes/boots\n": "abil work steel toe shoes/boot",
    "Ability to lift up to 50 lbs\n": "abil lift 50 lb",
    "Experience and understanding of Indigenous culture and traditions is an asset.\n": "experi understand indigen cultur tradit asset",
    "Working knowledge of the state of homelessness in Edmonton and across the country is an asset.\n": "work knowledg state homeless edmonton across countri asset",
    "Experience working in retail environment\n": "experi work retail environ",
    "Company Website\n": "compani websit",
    "www.findedmonton.com\n": "www.findedmonton.com",
    "Heightened sanitization protocols\n": "heighten sanit protocol",
    "The information on this site is for information purposes only and is not intended to have legal consequences.\n": "the inform site inform purpos intend legal consequ",
    "*Must be available Sundays 10am - 2pm and Mondays from 5pm-10pmOther shift times would vary.\n": "must avail sunday 10am 2pm monday 5pm-10pmother shift time would vari",
    "Possibility of splitting\n": "possibl split",
    "The stylist also assists in all areas of store operations as requested by immediate supervisor.Primary ResponsibilitiesMaximize personal sales at all opportunitiesProvide\n": "the stylist also assist area store oper request immedi supervisor.primari responsibilitiesmaxim person sale opportunitiesprovid",
    "Experience handling cash and processing transactions with credit cards.\n": "experi handl cash process transact credit card",
    "Experience in ticketing programs (TM1) is an asset.\n": "experi ticket program tm1 asset",
    "Ability to anticipate, identify and solve problems.\n": "abil anticip identifi solv problem",
    "Experience working in a unionized environment is an asset.\n": "experi work union environ asset",
    "Must be able to obtain and maintain a satisfactory Criminal Record Check for the duration of employment.\n": "must abl obtain maintain satisfactori crimin record check durat employ",
    "This position is an in-scope position under the RWDSU Collective Agreement.\n": "thi posit in-scop posit rwdsu collect agreement",
    "Employment will be contingent on proof of vaccination.We thank all applicants for their interest in Habitat for Humanity GTA, however only those selected for an interview will be contacted.Job Types: Full-time, PermanentSalary: $15.00 per hour\n": "employ conting proof vaccination.w thank applic interest habitat human gta howev select interview contacted.job type full-tim permanentsalari 15.00 per hour",
    "Tackle the challenge of a new store opening\n": "tackl challeng new store open",
    "Transfer to any one of our 1600 stores nationwide\n": "transfer one 1600 store nationwid",
    "Attention to detail.6.\n": "attent detail.6",
    "Winning mindset.8.\n": "win mindset.8",
    "Leadership.9.\n": "leadership.9",
    "Team player.10.\n": "team player.10",
    "Ability to multi-task and prioritize competing demands.Experience and Requirements:A minimum of 2 years guest services related experience in a related industry.2.\n": "abil multi-task priorit compet demands.experi requir a minimum 2 year guest servic relat experi relat industry.2",
    "Opening and closing shifts available.\n": "open close shift avail",
    "Must be available to work the day or evening shift 7 days per week.Must be able to work for 6am start.Part-time hours: 4-32 per weekApplication deadline: 2021-09-29Job Types: Part-time, PermanentSalary: From $12.65 per hourAdditional pay:Overtime payBenefits:Employee assistance programEmployee stock purchase planOn-site parkingStore discountSchedule:Day shiftMonday to FridayOn callWeekendsCOVID-19 considerations:We follow the direction of the Chief Medical Examiner with regard to CovidWork remotely:No\n": "must avail work day even shift 7 day per week.must abl work 6am start.part-tim hour 4-32 per weekappl deadlin 2021-09-29job type part-tim permanentsalari from 12.65 per houraddit pay overtim paybenefit employe assist programemploye stock purchas planon-sit parkingstor discountschedul day shiftmonday fridayon callweekendscovid-19 consider we follow direct chief medic examin regard covidwork remot no",
    "Experience in specialty coffee is essential for this role - you must understand how to dial in a grinder, steam milk and pour latte art.\n": "experi specialti coffe essenti role must understand dial grinder steam milk pour latt art",
    "skillsmust be reliable and able to work flexible hoursmust have a strong work ethicmust be able to work in a fast-paced environment and as part of a teamJob Type: Part-timeSalary: $14.50 per hourSchedule:Night ShiftWeekendsExperience:sales: 1 year (Preferred)Job Duties:Answer incoming customer inquiries\n": "skillsmust reliabl abl work flexibl hoursmust strong work ethicmust abl work fast-pac environ part teamjob type part-timesalari 14.50 per hourschedul night shiftweekendsexperi sale 1 year prefer job duti answer incom custom inquiri",
    "Keep the store looking crisp, full and inviting.Team Player - Commitment to going above and beyond to win the season and grow the Just CozyJob Type: Part-timeSalary: $15.00 per hourSchedule:Day shiftHolidaysMonday to FridayNight shiftWeekendsExperience:Retail Experience: 1 year (Preferred)Work remotely:No\n": "keep store look crisp full inviting.team player commit go beyond win season grow just cozyjob type part-timesalari 15.00 per hourschedul day shiftholidaysmonday fridaynight shiftweekendsexperi retail experi 1 year prefer work remot no",
    "skillscustomer service orientationpatienceadaptabilityinitiativepersuasivenessstress tolerancehigh energy levelintegrity- team playerPart-time hours: 15-20 per weekExpected start date: IMMEDIATELYJob Types: Part-time, PermanentSalary: $14.00 per hourBenefits:Casual dressCompany eventsFlexible scheduleStore discountSchedule:8 hour shiftDay shiftMonday to FridayWeekendsCOVID-19 considerations:For the safety of our Staff and Customers, we have implemented a thorough cleaning regime, mandatory masks and hand sanitizer.Experience:Customer service: 2 years (preferred)Retail sales: 2 years (preferred)Work remotely:No\n": "skillscustom servic orientationpatienceadaptabilityinitiativepersuasivenessstress tolerancehigh energi levelintegrity- team playerpart-tim hour 15-20 per weekexpect start date immediatelyjob type part-tim permanentsalari 14.00 per hourbenefit casual dresscompani eventsflex schedulestor discountschedule:8 hour shiftday shiftmonday fridayweekendscovid-19 consider for safeti staff custom implement thorough clean regim mandatori mask hand sanitizer.experi custom servic 2 year prefer retail sale 2 year prefer work remot no",
    "Experience is an asset.But not mandatory.Job Types: Full-time, CasualSalary: $14.00-$17.00 per hourAdditional pay:TipsBenefits:Com\n": "experi asset.but mandatory.job type full-tim casualsalari 14.00- 17.00 per houraddit pay tipsbenefit com",
    "Take out counter attendant required for busy restaurant in the St. Lawrence Market.\n": "take counter attend requir busi restaur st. lawrenc market",
    "skillsCustome\n": "skillscustom",
    "All staff and customers required to wear a mask in the store.Experience:sales: 1 year (preferred)customer service: 1 year (preferred)Work remotely:No\n": "all staff custom requir wear mask store.experi sale 1 year prefer custom servic 1 year prefer work remot no"
}